import 'package:flutter/material.dart';
import 'package:maktabat_almoslim/widgets/container_scrollview.dart';
import 'package:provider/provider.dart';
import 'package:shared_preferences/shared_preferences.dart';

import '../../../widgets/add_custom_bottom_navigation_bar.dart';
import '../../../widgets/list_of_nine_verses.dart';
import '../../favorites_provider.dart';
import '../../favorites_screen.dart';
import '../ad3iya_mashhoura.dart';
import 'douaa_alihtijab.dart';
import 'douaa_nodba.dart';

class DouaaZamanAlghaiba extends StatefulWidget {
  static String screenRoute = 'douaa_zaman_alghaiba_screen';
  const DouaaZamanAlghaiba({super.key});

  @override
  State<DouaaZamanAlghaiba> createState() => _DouaaZamanAlghaibaState();
}

double _fontSize = 18;
double _fontSizeTablet = 30;

class _DouaaZamanAlghaibaState extends State<DouaaZamanAlghaiba> {
  bool isIcon = true;
  @override
  void initState() {
    super.initState();
    _loadFavoriteState();
  }

  Future<void> _loadFavoriteState() async {
    final prefs = await SharedPreferences.getInstance();
    bool? savedState = prefs.getBool('isFavorite_douaa_zaman_alghaiba_screen');
    setState(() {
      isIcon = savedState ?? true;
    });
  }

  Future<void> _saveFavoriteState(bool value) async {
    final prefs = await SharedPreferences.getInstance();
    await prefs.setBool('isFavorite_douaa_zaman_alghaiba_screen', value);
  }

  Future<bool> _onWillPop() async {
    final args =
        ModalRoute.of(context)!.settings.arguments as Map<String, dynamic>?;
    final previousPage = args?['previousPage'];
    if (previousPage == 'favorite_screen') {
      Navigator.of(context).pushReplacementNamed(FavoritesScreen.screenRoute);
      return false;
    } else {
      Navigator.of(context)
          .pushReplacementNamed(Ad3iyaMashhoura.screenRoute);
      return false;
    }
  }

  @override
  Widget build(BuildContext context) {
    double size = MediaQuery.of(context).textScaleFactor;
    final screenWidth = MediaQuery.of(context).size.width;
    final isTablet = screenWidth >= 600;
    final args =
        ModalRoute.of(context)!.settings.arguments as Map<String, dynamic>?;
    final previousPage = args?['previousPage'];
    return WillPopScope(
      onWillPop: _onWillPop,
      child: Scaffold(
        appBar: AppBar(
          toolbarHeight: isTablet ? 100 : 50,
          centerTitle: true,
          leading: IconButton(
            onPressed: () {
              if (previousPage == 'favorite_screen') {
                Navigator.of(context)
                    .pushReplacementNamed(FavoritesScreen.screenRoute);
              } else {
                Navigator.of(context).pushReplacementNamed(
                    Ad3iyaMashhoura.screenRoute);
              }
            },
            icon: Icon(
              Icons.arrow_back,
              size: isTablet ? 50 : 25,
            ),
          ),
          actions: [
            IconButton(
              padding: EdgeInsets.only(left: isTablet ? 50 : 30),
              icon: Icon(
                isIcon ? Icons.favorite_border : Icons.favorite_rounded,
                size: isTablet ? 40 : 25,
                color: isIcon ? Colors.black : Colors.red,
              ),
              onPressed: () async {
                setState(() {
                  isIcon = !isIcon;
                });
                await _saveFavoriteState(isIcon);

                if (!isIcon) {
                  Provider.of<FavoritesProvider>(context, listen: false)
                      .addFavorite(
                          'دعاء زمن الغيبة', DouaaZamanAlghaiba.screenRoute);
                } else {
                  Provider.of<FavoritesProvider>(context, listen: false)
                      .removeFavorite(
                          'دعاء زمن الغيبة',
                          DouaaZamanAlghaiba.screenRoute,
                          DouaaZamanAlghaiba.screenRoute);
                }
              },
            ),
          ],
          title: Text(
            'دعاء زمن الغيبة',
            style: TextStyle(
              fontSize: isTablet
                  ? 40
                  : size > 1.0
                      ? 20
                      : 23,
              fontWeight: FontWeight.bold,
            ),
          ),
        ),
        body: ContainerScrollview(
          widget: Column(
            crossAxisAlignment: CrossAxisAlignment.start,
            children: [
              Container(
                child: Column(
                  children: [
                    Center(
                      child: Text(
                        'بسم الله الرحمن الرحيم',
                        style: TextStyle(
                          fontSize: isTablet ? _fontSizeTablet : _fontSize,
                          fontWeight: FontWeight.w900,
                        ),
                      ),
                    ),
                    Center(
                      child: Text(
                        'اللهم صلِّ على محمد وآل محمد',
                        style: TextStyle(
                          fontSize: isTablet ? _fontSizeTablet : _fontSize,
                          fontWeight: FontWeight.w900,
                        ),
                      ),
                    ),
                  ],
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: '',
                  subtitle:
                      'رُوي بسند معتبر أنَّ الشيخ أبا عمرو النَّائِب الأوَّل من نوَّاب إمام العصر صَلَوات الله عليه أملى هذا الدُّعاء على أبي محمد بن همام وَأَمَره أن يدعو به، وقد ذكر الدُّعاء السيد ابن طاووس في كتاب جمال الأسبوع بعد ذكره الدَّعوات الواردة بعد فريضة العصر يوم الجُمعة وبعد الصَّلاة الكبيرة وقال: وإذا كان لك عذر عن كل ما ذكرناه فاحذر أن تهمل هذا الدُّعاء، فإنا قد عرفنا من فضل الله جل جلالُهُ الَّذي خصَّنا به، فاعتمد عليه وهو هذا الدُّعاءُ :',
                  weight: FontWeight.w400,
                  size: isTablet ? _fontSizeTablet - 4 : _fontSize - 4,
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: '',
                  subtitle:
                      'أَللّهمَّ عرِّفْنِي نَفْسَكَ، فَإِنَّكَ إِنْ لَمْ تُعَرِّفْنِي نَفْسَكَ لَمْ أَعْرِفْ رَسُولَكَ، أَللّهمَّ عَرِّفْنِي رَسُولَكَ فَإِنَّكَ إِنْ لَمْ تُعَرِّفْنِي رَسُولَكَ لَمْ أَعْرِفْ حُجَّتَكَ، أَللّهمَّ عَرِّفْنِي حُجَّتَكَ فَإِنَّكَ إِنْ لَمْ تُعَرِّفْنِي حُجَّتَكَ ضَلَلْتُ عَنْ دِينِي، أَللّهمَّ لاَ تُمِتْنِي مِيتَةً جَاهِلِيَّةً، وَلاَ تُزِغْ قَلْبِي بَعْدَ إِذْ هَدَيْتَنِي، أَللّهمَّ فَكَمَا هَدَيْتَنِي لِوَلاَيَةِ مَنْ فَرَضْتَ عَلَيَّ طَاعَتَهُ مِنْ وُلاَةَ أَمْرِكَ بَعْدَ رَسُولِكَ صَلَوَاتُكَ عَلَيْهِ وَآلِهِ حَتَّىٰ وَالَيْتُ وُلاَةَ أَمْرِكَ أَمِيرَ الْمُؤْمِنِينَ عَلِيَّ ٱبْنَ أَبِي طَالِبٍ وَالْحَسَنَ وَالْحُسَيْنَ وَعَلِيّاً وَمُحَمَّداً وَجَعْفَراً وَمُوسَىٰ وَعَلِيّاً وَمُحَمَّداً وَعَلِيّاً وَالْحَسَنَ وَالْحُجَّةَ الْقَائِمَ الْمَهْدِيَّ صَلَوَاتُكَ عَلَيْهِمْ أَجْمَعِينَ.\n'
                      'أَللّهمَّ فَثَبَّتْنِي عَلَىٰ دِينِكَ وَٱسْتَعْمِلْنِي بِطَاعَتِكَ، وَلَيِّنْ قَلْبِي لِوَلِيِّ أَمْرِكَ، وَعَافِنِي مِمَّا ٱمْتَحَنْتَ بِهِ خَلْقَكَ، وَثَبِّتْنِي عَلَىٰ طَاعَةِ وَلِيِّ أَمْرِكَ ٱلَّذِي سَتَرْتَهُ عَنْ خَلْقِكَ، وَبِإِذْنِكَ غَابَ عَنْ بَرِيَّتِكَ، وَأَمْرَكَ يَنْتَظِرُ وَأَنْتَ الْعَالِمُ غَيْرُ الْمُعَلَّمِ بِالْوَقْتِ ٱلَّذِي فِيهِ صَلاَحُ أَمْرِ وَلِيِّكَ فِي ٱلإِذْنِ لَهُ بِإِظْهَارِ أَمْرِهِ وَكَشْفِ سِتْرِهِ، فَصَبِّرْنِي عَلَىٰ ذَلِكَ حَتَّىٰ لاَ أُحِبَّ تَعْجِيلَ مَا أَخَّرْتَ وَلاَ تَأْخِيرَ مَا عَجَّلْتَ، وَلاَ كَشْفَ مَا سَتَرْتَ، وَلاَ الْبَحْثَ عَمَا كَتَمْتَ، وَلاَ أُنَازِعَكَ فِي تَدْبِيرِكَ وَلاَ أَقُولُ لِمَ وَكَيْفَ؟ وَمَا بَالُ وَلِيِّ ٱلأَمْرِ لاَ يَظْهَرُ؟ وَقَدِ ٱمْتَلأَتِ ٱلأَرْضُ مِنَ الْجَوْرِ؟ وَأُفَوِّضُ أُمُورِي كُلِّهَا إِلَيْكَ.\n'
                      'َللّهمَّ إِنِي أَسْأَلُكَ أَنْ تُرِيَنِي وَلِيَّ أَمْرَكَ ظَاهِراً نَافِذ ٱلأَمْرِ، مَعَ عِلْمِي بَأَنَّ لَكَ ٱلسُّلْطَانَ وَالْقُدْرَةَ وَالْبُرْهَانَ وَالْحُجَّةَ وَالْمَشِيئَةَ وَالْحَوْلَ وَالْقُوَّةَ، فَٱفْعَلْ ذَلِكَ بِي وَبِجَمِيعِ الْمُؤْمِنِينَ، حَتَّىٰ نَنْظُرَ إِلَىٰ وَلِيِّ أَمْرِكَ صَلَوَاتُكَ عَلَيْهِ ظَاهِرَ الْمَقَالَةِ، وَاضِحِ ٱلدَّلاَلَةِ، هَادِياً مِنَ ٱلضَّلاَلَةِ، شَافِياً مِنَ الْجَهَالَةِ، أَبْرِزْ يَا رَبِّ مُشَاهَدَتَهُ، وَثَبِّتْ قَوَاعِدَهُ، وَٱجْعَلْنَا مِمَّنْ تَقِرُّ عَيْنُهُ بِرُؤْيَتِهِ، وَأَقِمْنَا بِخِدْمَتِهِ، وَتَوَفَّنَا عَلَىٰ مِلَّتِهِ، وَٱحْشُرْنَا فِي زُمْرَتِهِ.\n'
                      'أَللّهمَّ أَعِذْهُ مِنْ شَرِّ جَمِيعِ مَا خَلَقْتَ وَبَرَأْتَ وَأَنْشَأْتَ وَصَوَّرْتَ، وَٱحْفَظْهُ مِنْ بِيْنِ يَدَيْهِ وَمِنْ خَلْفِهِ، وَعَنْ يَمِينِهِ وَعَنْ شِمَالِهِ، وَمِنْ فَوْقِهِ وَمِنْ تَحْتِهِ، بِحِفْظِكَ ٱلَّذِي لاَ يَضِيعُ مَنْ حَفِظْتَهُ بِهِ، وَٱحْفَظْ فِيهِ رَسُولَكَ وَوَصِيَّ رَسُولِكَ عَلَيْهِ وَآلِهِ ٱلسَّلاَمُ.\n'
                      'َللّهمَّ وَمُدَّ فِي عُمْرِهِ، وَزِدْ فِي أَجَلِهِ، وَأَعِنْهُ عَلَىٰ مَا وَلَّيْتَهُ وَٱسْتَرْعَيْتَهُ، وَزِدْ فِي كَرَامَتِكَ لَهُ فَإِنَّهُ الْهَادِيُ الْمَهْدِيُّ، وَالْقَائِمُ الْمُهْتَدِي، وَٱلطَّاهِرُ ٱلتَّقِيُّ ٱلزَّكِيُّ ٱلنَّقِيُّ ٱلرَّضِيُّ الْمَرْضِيِّ ، ٱلصَّابِرُ ٱلشَّكُورُ الْمُجْتَهِدُ.\n'
                      'َللّهمَّ وَلاَ تَسْلُبْنَا الْيَقِينَ لِطُولِ ٱلأَمَدِ فِي غَيْبَتِهِ وَٱنْقِطَاعِ خَبَرِهِ عَنَّا، وَلاَ تُنْسِنَا ذِكْرَهُ وَٱنْتِظَارَهُ وَٱلإِيمَانَ بِهِ وَقُوَّةَ الْيَقِينِ فِي ظُهُورِهِ وَٱلدُّعَاءَ لَهُ وَٱلصَّلاَةَ عَلَيْهِ حَتَّىٰ لاَ يُقَنِّطُنَا طُولُ غَيْبَتِهِ مِنْ قِيَامِهِ، وَيَكُونَ يَقِينُنَا فِي ذَلِكَ كَيَقِينَنَا فِي قِيَامِ رَسُولِكَ صَلَوَاتُكَ عَلَيْهِ وَآلِهِ، وَمَا جَاءَ بِهِ مِنْ وَحْيِكَ وَتَنْزِيلِكَ، فَقَوِّ قُلُوبَنَا عَلَىٰ ٱلإِيمَانِ بِهِ حَتَّىٰ تَسْلُكَ بَنَا عَلَىٰ يَدَيْهِ مِنْهَاجَ الْهُدَىٰ وَالْمَحَجَّةَ الْعُظْمَىٰ وَٱلطَّرِيقَةَ الْوُسْطَىٰ، وَقَوِّنَا عَلَىٰ طَاعَتِهِ وَثَبِّتْنَا عَلَىٰ مُتَابَعَتِهِ (مُشَايَعَتِهِ)، وَٱجْعَلْنَا فِي حِزْبِهِ وَأَعْوَانِهِ وَأَنْصَارِهِ، وَٱلرَّاضِينَ بِفِعْلِهِ، وَلاَ تَسْلُبَنَا ذَلِكِ فِي حَيَاتِنَا وَلاَ عَنْدَ وَفَاتِنَا حَتَّىٰ تَتَوَفَّانَا وَنَحْنُ عَلَىٰ ذَلِكَ غَيْرَ شَاكِّينَ وَلاَ نَاكِثِينَ وَلاَ مُرْتَابِينَ وَلاَ مُكَذِّبِينَ.\n'
                      'أَللّهمَّ عَجِّلْ فَرَجَهُ وَأَيِّدْهُ بِٱلنَّصْرِ، وَٱنْصُرْ نَاصِرِيهِ وَٱخْذُلْ خَاذِلِيهِ، وَدَمْدِمْ عَلَىٰ مَنْ نَصَبَ لَهُ وَكَذَّبَ بِهِ وَأَظْهِرْ بِهِ الْحَقَّ، وَأَمِتْ بِهِ الْجَوْرَ وِٱسْتَنْقِذَ بِهِ عِبَادَكَ الْمُؤْمِنِينَ مِنَ ٱلذُّلِّ، وَٱنْعِشَ بِهِ الْبِلاَدَ وَٱقْتُلْ بِهِ جَبَابِرَةَ الْكُفْرِ (الْجَبَابِرَةِ وَالْكَفَرَةِ)، وَٱقْصِمْ بِهِ رُؤُوسَ ٱلضَّلاَلَةِ وَذَلِّلْ بِهِ الْجَبَّارِينَ وَالْكَافِرِينَ، وَأَبِرْ بِهِ الْمُنَافِقِينَ وَٱلنَّاكِثِينَ وَجَمِيعَ الْمُخَالِفِينَ وَالْمُلْحِدِينَ فِي مَشَارِقِ ٱلأَرْضِ وَمَغَارِبِهَا، وَبَرِّهَا وَبَحْرِهَا وَسَهْلِهَا وَجَبَلِهَا، حَتَّىٰ لاَ تَدَعَ مِنْهُمْ دَيَّاراً وَلاَ تُبْقِيَ لَهُمْ آثَاراً، طَهِّرْ مِنْهُمْ بِلاَدَكَ، وَٱشْفِ مِنْهُمْ صُدُورَ عَبَادِكَ، وَجَدِّدْ بِهِ مَا ٱمْتَحَىٰ مِنْ دِينِكَ، وَأَصْلِحْ بِهِ مَا بُدِّل مِنْ حُكْمِكَ، وَغُيِّرَ مِنْ سُنَّتِكَ حَتَّىٰ يَعُودَ دِينُكَ بِهِ وَعَلَىٰ يَدَيْهِ غَضّاً جَدِيداً صَحِيحاً لاَ عِوَجَ فِيهِ وَلاَ بِدْعَةَ مَعَهُ، حَتَّىٰ تُطْفِئَ بِعَدْلِهِ نِيرَانَ الْكَافِرِينَ فَإِنَّهُ عَبْدُكَ ٱلَّذِي ٱسْتَخْلَصْتَهُ لِنَفْسِكَ وَٱرْتَضَيْتَهُ لِنَصْرِ دِينِكَ، وَٱصْطَفَيْتَهُ بِعِلْمِكَ، وَعَصَمْتَهُ مِنْ ٱلذُّنُوبَ وَبَرَّأْتَهُ مِنَ الْعُيُوبِ، وَأَطْلَعْتَهُ عَلَىٰ الْغُيُوبِ وَأَنْعَمْتَ عَلَيْهِ وَطَهَّرْتَهُ مِنَ ٱلرِّجْسِ وَنَقَّيْتَهُ مِنَ ٱلدَّنَسِ.\n'
                      'أَللّهمَّ فَصَلِّ عَلَيْهِ وَعَلَىٰ آبَائِهِ ٱلأَئِمَّةِ ٱلطَّاهِرِينَ وَعَلَىٰ شِيعَتِهِ الْمُنْتَجَبِينَ وَبَلِّغْهُمْ مِنْ آمَالِهِمْ أَفْضَلَ مَا يَأْمَلُونَ وَٱجْعَلْ ذَلِكَ مِنَّا خَالِصاً مِنْ كُلِّ شَكٍّ وَشُبْهَةٍ وَرِيَاءٍ وَسُمْعَةٍ، حَتَّىٰ لاَ نُرِيدَ بِهِ غَيْرَكَ، وَلاَ نَطْلُبَ بِهِ إِلاَّ وَجْهَكَ.\n'
                      'َللّهمَّ إِنَّا نَشْكُو إِلَيْكَ فَقْدَ نَبِيِّنَا وَغَيْبَةَ إِمَامِنَا (وَلِيِّنَا)، وَشِدَّةَ ٱلزَّمَانِ عَلَيْنَا، وَوُقُوعَ الْفِتَنِ بَنَا، وَتَظَاهُرَ ٱلأَعْدَاءِ عَلَيْنَا وَكَثْرَةَ عَدُوِّنَا، وَقِلَّةَ عَدَدِنَا.\n'
                      'أَللّهمَّ فَٱفْرُجْ ذَلِكَ عَنَّا بِفَتْحٍ مِنْكَ تُعَجِّلُهُ، وَنَصْرٍ مِنْكَ تُعِزُّهُ، وَإِمَامِ عَدْلٍ تُظْهِرُهُ إِلَـٰهَ الْحَقِّ آمِينَ.\n'
                      'َللّهمَّ إِنَّا نَسْأَلُكَ أَنْ تَأْذَنَ لِوَلِيِّكَ فِي إِظْهَارِ عَدْلِكَ فِي عِبَادِكَ، وَقَتْلَ أَعْدَائِكَ فِي بِلاَدِكَ، حَتَّىٰ لاَ تَدَعَ لِلْجَوْرِ يَا رَبِّ دِعَامَةً إِلاَّ قَصَمْتَهَا، وَلاَ بَقِيَةً إِلاَّ أَفْنَيْتَهَا، وَلاَ قَوَّةَ إِلاَّ أَوْهَنْتَهَا، وَلاَ رُكْناً إِلاَّ هَدَمْتَهُ، وَلاَ حَداً إِلاَّ فَلَلْتَهُ، وَلاَ سِلاَحاً إِلاَّ أَكْلَلْتَهُ، وَلاَ رَايَةً إِلاَّ نَكَّسْتَهَا، وَلاَ شُجَاعاً إِلاَّ قَتَلْتَهُ، وَلاَ جَيْشاً إِلاَّ خَذَلْتَهُ، وَٱرْمِهِمْ يَا رَبِّ بَحَجَرِكَ ٱلدَّامِغِ وَٱضْرِبْهُمْ بَسَيْفِكَ الْقَاطِعِ وَبَأْسِكَ ٱلَّذِي لاَ تَرُدُّهُ عَنِ الْقَوْمِ الْمُجْرِمِينَ، وَعَذِّبْ أَعْدَائَكَ وَأَعْدَاءَ وَلِيِّكَ وَأَعْدَاءَ رَسُولِكَ صَلَوَاتُكَ عَلَيْهِ وَآلِهِ بِيَدِ وَلِيِّكَ وَأَيْدِي عِبَادِكَ الْمُؤْمِنِينَ.\n'
                      'أَللّهمَّ ٱكْفِ وَلِيِّكَ وَحُجَّتَكَ فِي أَرْضِكَ هَوْلَ عَدُوِّهِ وَكَيْدَ مَنْ أَرَادَهُ (كَادَهُ) وَٱمْكُرْ مَنْ مَكَرَ بِهِ وَٱجْعَلَ دَائِرَةَ ٱلسَّوْءِ عَلَىٰ مَنْ أَرَادَ بِهِ سُوءاً، وَٱقْطَعْ عَنْهُ مَادَّتَهُمْ، وَأَرْعِبْ لَهُ قُلُوبَهُمْ، وَزَلْزِلْ أَقَدَامَهُمْ، وَخُذْهُمْ جَهْرَةً وَبَغْتَةً، وَشَدِّدْ عَلَيْهِمْ عَذَابَكَ، وَٱخْزِهِمْ فِي عِبَادِكَ، وَالْعَنْهُمْ فِي بِلاَدِكَ، وَأَسْكِنْهُمْ أَسْفَلَ نَارِكَ، وَأَحِطْ بِهِمْ أَشَدَّ عَذَابِكَ، وَأَصْلِهِمْ نَاراً وَٱحْشُ قُبُورَ مَوْتَاهُمْ نَاراً، وَأَصْلِهِمْ حَرَّ نَارِكَ، فَإِنَّهُمْ أَضَاعُوا ٱلصَّلاَةَ وَٱتَّبَعُوا ٱلشَّهَوَاتِ وَأَضَلُّوا عِبَادَكَ وَأَخْرَبُوا بِلاَدَكَ.\n'
                      'أَللّهمَّ وَأَحْي بِوَلِيِّكَ الْقُرْآنَ، وَأَرِنَا نُورَهُ سَرْمَداً لاَ لَيْلَ فِيهِ، وَأَحْي بِهِ الْقُلُوبَ الْمَيِّتَةَ، وَأَشْفِ بِهِ ٱلصُّدُورَ الْوَغِرَةَ، وَٱجْمَعْ بِهِ ٱلأَهْوَاءَ الْمُخْتَلِفَةَ عَلَىٰ الْحَقِّ، وَأَقِمْ بِهِ الْحُدُودَ الْمُعَطَّلَةَ وَٱلأَحْكَامَ الْمُهْمَلَةَ حَتَّىٰ لاَ يَبْقَىٰ حَقُّ إِلاَّ ظَهَرَ وَلاَ عَدْلٌ إِلاَّ زَهَرَ، وَٱجْعَلْنَا يَا رَبِّ مِنْ أَعْوَانِهِ وَمُقَوِّيَةِ سُلْطَانِهِ وَالْمُؤْتَمِرِينَ لأَمْرِهِ وَٱلرَّاضِينَ بِفِعْلِهِ، وَالْمُسَلِّمِينَ لأَحْكَامِهِ، وَمِمَّنْ لاَ حَاجَةَ بِهِ إِلَىٰ ٱلتَّقِيَّةِ مِنْ خَلْقِكَ، وَأَنْتَ يَا رَبِّ ٱلَّذِي تَكْشِفُ ٱلضُّرَّ، وَتُجِيبُ الْمُضْطَرَّ إِذَا دَعَاكَ، وَتُنْجِي مِنَ الْكَرْبِ الْعَظِيمِ، فَٱكْشِفِ ٱلضُّرَّ عَنْ وَلِيِّكَ، وَٱجْعَلْهُ خَلِيفَةً فِي أَرْضِكَ كَمَا ضَمِنْتَ لَهُ.\n'
                      'أَللّهمَّ لاَ تَجْعَلْنِي مِنْ خُصَمَاءِ آلِ مُحَمَّدٍ عَلَيْهِمُ ٱلسَّلاَمُ، وَلاَ تَجْعَلْنِي مِنْ أَعْدَاءِ آلِ مُحَمَّدٍ عَلَيْهِمُ ٱلسَّلاَمُ ، وَلاَ تَجْعَلْنِي مِنْ أَهْلِ الْحَنَقِ وَالْغَيْطِ عَلَىٰ آلِ مُحَمَّدٍ عَلَيْهِمُ ٱلسَّلاَمُ ، فَإِنِّي أَعُوذُ بِكَ مِنْ ذَلِكَ فَأَعِذْنِي، وَأَسْتَجِيرُ بِكَ فَأَجِرْنِي.\n'
                      'َللّهمَّ صَلِّ عَلَىٰ مُحَمَّدٍ وَآلِ مُحَمَّدٍ، وَٱجْعَلْنِي بِهِمْ فَائِزاً عِنْدَكَ فِي ٱلدُّنْيَا وٱلآخِرَةِ وَمِنَ الْمُقَرَّبِينَ آمِينَ رَبَّ الْعَالَمِينَ.\n',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
            ],
          ),
        ),
        bottomNavigationBar: AddCustomBottomNavigationBar(
        pushNext: DouaaNodba.screenRoute,
        pushBack: DouaaAlihtijab.screenRoute,
        soud: 'https://cdn.jsdelivr.net/gh/SounaDiab/image_audio@master/audio/دعاء زمن الغيبة.mp3',
        onTap: (double fontSize) {
          // تحديث حجم الخط
          setState(() {
            isTablet ? _fontSizeTablet = fontSize : _fontSize = fontSize;
          });
          print('fontSize: $fontSize');
          // إغلاق Dialog
          Navigator.of(context).pop();
        },
        onLongPress: () {
          final snackBar = SnackBar(
            content: Center(
              child: Text(
                '${isTablet ? _fontSizeTablet.toInt() : _fontSize.toInt()}',
                style: TextStyle(
                  color: Colors.white,
                  fontSize: 16,
                ),
              ),
            ),
            width: 60,
            behavior: SnackBarBehavior.floating,
            backgroundColor: Colors.blue,
            duration: Duration(seconds: 2),
            shape: ShapeBorder.lerp(
              RoundedRectangleBorder(
                borderRadius: BorderRadius.circular(50),
              ),
              RoundedRectangleBorder(
                borderRadius: BorderRadius.circular(50),
              ),
              1,
            ),
          );
          ScaffoldMessenger.of(context).showSnackBar(snackBar);
        },
      ),
      ),
    );
  }
}
