import 'package:flutter/material.dart';
import 'package:maktabat_almoslim/widgets/container_scrollview.dart';
import 'package:provider/provider.dart';
import 'package:shared_preferences/shared_preferences.dart';

import '../../../widgets/add_custom_bottom_navigation_bar.dart';
import '../../../widgets/list_of_nine_verses.dart';
import '../../favorites_provider.dart';
import '../../favorites_screen.dart';
import '../ad3iya_mashhoura.dart';
import 'douaa_al3asharat.dart';
import 'douaa_altawasol.dart';

class DouaaKomail extends StatefulWidget {
  static String screenRoute = 'douaa_komail_screen';
  const DouaaKomail({super.key});

  @override
  State<DouaaKomail> createState() => _DouaaKomailState();
}

double _fontSize = 18;
double _fontSizeTablet = 30;

class _DouaaKomailState extends State<DouaaKomail> {
  bool isIcon = true;
  @override
  void initState() {
    super.initState();
    _loadFavoriteState();
  }

  Future<void> _loadFavoriteState() async {
    final prefs = await SharedPreferences.getInstance();
    bool? savedState = prefs.getBool('isFavorite_douaa_komail_screen');
    setState(() {
      isIcon = savedState ?? true;
    });
  }

  Future<void> _saveFavoriteState(bool value) async {
    final prefs = await SharedPreferences.getInstance();
    await prefs.setBool('isFavorite_douaa_komail_screen', value);
  }

  Future<bool> _onWillPop() async {
    final args =
        ModalRoute.of(context)!.settings.arguments as Map<String, dynamic>?;
    final previousPage = args?['previousPage'];
    if (previousPage == 'favorite_screen') {
      Navigator.of(context).pushReplacementNamed(FavoritesScreen.screenRoute);
      return false;
    } else {
      Navigator.of(context)
          .pushReplacementNamed(Ad3iyaMashhoura.screenRoute);
      return false;
    }
  }

  @override
  Widget build(BuildContext context) {
    double size = MediaQuery.of(context).textScaleFactor;
    final screenWidth = MediaQuery.of(context).size.width;
    final isTablet = screenWidth >= 600;
    final args =
        ModalRoute.of(context)!.settings.arguments as Map<String, dynamic>?;
    final previousPage = args?['previousPage'];
    return WillPopScope(
      onWillPop: _onWillPop,
      child: Scaffold(
        appBar: AppBar(
          toolbarHeight: isTablet ? 100 : 50,
          centerTitle: true,
          leading: IconButton(
            onPressed: () {
              if (previousPage == 'favorite_screen') {
                Navigator.of(context)
                    .pushReplacementNamed(FavoritesScreen.screenRoute);
              } else {
                Navigator.of(context).pushReplacementNamed(
                    Ad3iyaMashhoura.screenRoute);
              }
            },
            icon: Icon(
              Icons.arrow_back,
              size: isTablet ? 50 : 25,
            ),
          ),
          actions: [
            IconButton(
              padding: EdgeInsets.only(left: isTablet ? 50 : 30),
              icon: Icon(
                isIcon ? Icons.favorite_border : Icons.favorite_rounded,
                size: isTablet ? 40 : 25,
                color: isIcon ? Colors.black : Colors.red,
              ),
              onPressed: () async {
                setState(() {
                  isIcon = !isIcon;
                });
                await _saveFavoriteState(isIcon);

                if (!isIcon) {
                  Provider.of<FavoritesProvider>(context, listen: false)
                      .addFavorite('دعاء كميل', DouaaKomail.screenRoute);
                } else {
                  Provider.of<FavoritesProvider>(context, listen: false)
                      .removeFavorite('دعاء كميل', DouaaKomail.screenRoute,
                          DouaaKomail.screenRoute);
                }
              },
            ),
          ],
          title: Text(
            'دعاء كميل',
            style: TextStyle(
              fontSize: isTablet
                  ? 40
                  : size > 1.0
                      ? 20
                      : 23,
              fontWeight: FontWeight.bold,
            ),
          ),
        ),
        body: ContainerScrollview(
          widget: Column(
            crossAxisAlignment: CrossAxisAlignment.start,
            children: [
              Container(
                child: Column(
                  children: [
                    Center(
                      child: Text(
                        'بسم الله الرحمن الرحيم',
                        style: TextStyle(
                          fontSize: isTablet ? _fontSizeTablet : _fontSize,
                          fontWeight: FontWeight.w900,
                        ),
                      ),
                    ),
                    Center(
                      child: Text(
                        'اللهم صلِّ على محمد وآل محمد',
                        style: TextStyle(
                          fontSize: isTablet ? _fontSizeTablet : _fontSize,
                          fontWeight: FontWeight.w900,
                        ),
                      ),
                    ),
                  ],
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: '',
                  subtitle:
                      'وهُو من الدّعوات المعروفة ، قال العلامة المجلسي (رحمه الله) : انّه أفضل الادعية وهُو دُعاء خضر (عليه السلام) وقد علّمه أمير المؤمنين (عليه السلام)كميلاً، وهُو من خواصّ أصحابه ويدعى به في ليلة النّصف مِن شعبان وليلة الجمعة ويجدي في كفاية شرّ الاعداء، وفي فتح باب الرّزق، وفي غفران الذّنوب، وقد رواه الشّيخ والسيّد كلاهما (قدس سرهما) وأنا أرويه عن كتاب مصباح المتهجّد، وهو هذا الدّعاء :',
                  weight: FontWeight.w400,
                  size: isTablet ? _fontSizeTablet - 4 : _fontSize - 4,
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: '',
                  subtitle:
                      'اللهم إنِّي أَسْأَلُكَ بِرَحْمَتِكَ الَّتي وَسِعَتْ كُلَّ شَيْء، وَبِقُوَّتِكَ الَّتي قَهَرْتَ بِها كُلَّ شَيْء، وَخَضَعَ لَها كُلُّ شَيء، وَذَلَّ لَها كُلُّ شَيء، وَبِجَبَرُوتِكَ الَّتي غَلَبْتَ بِها كُلَّ شَيء، وَبِعِزَّتِكَ الَّتي لا يَقُومُ لَها شَيءٌ، وَبِعَظَمَتِكَ الَّتي مَلأَتْ كُلَّ شَيء، وَبِسُلْطانِكَ الَّذي عَلا كُلَّ شَيء، وَبِوَجْهِكَ الْباقي بَعْدَ فَناءِ كُلِّ شَيء، وَبِأَسْمائِكَ الَّتي مَلأَتْ أرْكانَ كُلِّ شَيء، وَبِعِلْمِكَ الَّذي أَحاطَ بِكُلِّ شَيء، وَبِنُورِ وَجْهِكَ الَّذي أَضاءَ لَهُ كُلُّ شيء، يا نُورُ يا قُدُّوسُ، يا أَوَّلَ الأوَّلِينَ وَيا آخِرَ الآخِرينَ. اَللّهُمَّ اغْفِرْ لِي الذُّنُوبَ الَّتي تَهْتِكُ الْعِصَمَ، اَللّهُمَّ اغْفِرْ لِي الذُّنُوبَ الَّتي تُنْزِلُ النِّقَمَ، اَللّهُمَّ اغْفِرْ لِي الذُّنُوبَ الَّتي تُغَيِّرُ النِّعَمَ، اَللّهُمَّ اغْفِرْ لي الذُّنُوبَ الَّتي تَحْبِسُ الدُّعاءَ، اللّهُمَّ اغفِر لِيَ الذُّنوبَ الَّتي تَقطَعُ الرَّجاءَ، اَللّهُمَّ اغْفِرْ لِي الذُّنُوبَ الَّتي تُنْزِلُ الْبَلاءَ، اَللّهُمَّ اغْفِرْ لي كُلَّ ذَنْب اَذْنَبْتُهُ، وَكُلَّ خَطيئَة اَخْطَأتُها.\n'
                      'اَللّهُمَّ اِنّي اَتَقَرَّبُ اِلَيْكَ بِذِكْرِكَ، وَاَسْتَشْفِعُ بِكَ إلى نَفْسِكَ، وَأَسْأَلُكَ بِجُودِكَ أن تُدْنِيَني مِنْ قُرْبِكَ، وَأَنْ تُوزِعَني شُكْرَكَ، وَأَنْ تُلْهِمَني ذِكْرَكَ، اَللّهُمَّ إني أَسْأَلُكَ سُؤالَ خاضِع مُتَذَلِّل خاشِع أن تُسامِحَني وَتَرْحَمَني وَتَجْعَلَني بِقِسْمِكَ راضِياً قانِعاً، وَفي جَميعِ الأحوال مُتَواضِعاً. اَللّهُمَّ وَأَسْأَلُكَ سُؤالَ مَنِ اشْتَدَّتْ فاقَتُهُ، وَاَنْزَلَ بِكَ عِنْدَ الشَّدائِدِ حاجَتَهُ، وَعَظُمَ فيما عِنْدَكَ رَغْبَتُهُ. اَللّهُمَّ عَظُمَ سُلْطانُكَ، وَعَلا مَكانُكَ، وَخَفِي مَكْرُكَ، وَظَهَرَ اَمْرُكَ وَغَلَبَ قَهْرُكَ، وَجَرَتْ قُدْرَتُكَ، وَلا يُمْكِنُ الْفِرارُ مِنْ حُكُومَتِكَ. اَللّهُمَّ لا أجِدُ لِذُنُوبي غافِراً، وَلا لِقَبائِحي ساتِراً، وَلا لِشَيء مِنْ عَمَلِي الْقَبيحِ بِالْحَسَنِ مُبَدِّلاً غَيْرَكَ، لا اِلهَ إلاّ أنْتَ، سُبْحانَكَ وَبِحَمْدِكَ، ظَلَمْتُ نَفْسي، وَتَجَرَّأْتُ بِجَهْلي، وَسَكَنْتُ إلى قَديمِ ذِكْرِكَ لي وَمَنِّكَ عَلَيَّ.\n'
                      'اَللّهُمَّ مَوْلاي كَمْ مِنْ قَبيح سَتَرْتَهُ، وَكَمْ مِنْ فادِح مِنَ الْبَلاءِ اَقَلْتَهُ، وَكَمْ مِنْ عِثارٍ وَقَيْتَهُ، وَكَمْ مِنْ مَكْرُوهٍ دَفَعْتَهُ، وَكَمْ مِنْ ثَناءٍ جَميلٍ لَسْتُ اَهْلاً لَهُ نَشَرْتَهُ. اَللّهُمَّ عَظُمَ بَلائي، وَاَفْرَطَ بي سُوءُ حالي، وَقَصُرَتْ بي اَعْمالي، وَقَعَدَتْ بي اَغْلالي، وَحَبَسَني عَنْ نَفْعي بُعْدُ اَمَلي، وَخَدَعَتْنِي الدُّنْيا بِغُرُورِها، وَنَفْسي بِجِنايَتِها، وَمِطالي يا سَيِّدي فَأَسْأَلُكَ بِعِزَّتِكَ أن لا يَحْجُبَ عَنْكَ دُعائي سُوءُ عَمَلي وَفِعالي، وَلا تَفْضَحْني بِخَفِي مَا اطَّلَعْتَ عَلَيْهِ مِنْ سِرّي، وَلا تُعاجِلْني بِالْعُقُوبَةِ عَلى ما عَمِلْتُهُ في خَلَواتي مِنْ سُوءِ فِعْلي وَإساءَتي، وَدَوامِ تَفْريطي وَجَهالَتي، وَكَثْرَةِ شَهَواتي وَغَفْلَتي، وَكُنِ اللّهُمَّ بِعِزَّتِكَ لي في كُلِّ الأحوالِ رَؤوفاً، وَعَلَي في جَميعِ الاُْمُورِ عَطُوفاً.\n'
                      'اِلهي وَرَبّي مَنْ لي غَيْرُكَ أَسْأَلُهُ كَشْفَ ضُرّي، وَالنَّظَرَ في اَمْري، اِلهي وَمَوْلاي اَجْرَيْتَ عَلَي حُكْماً اِتَّبَعْتُ فيهِ هَوى نَفْسي، وَلَمْ اَحْتَرِسْ فيهِ مِنْ تَزْيينِ عَدُوّي، فَغَرَّني بِما اَهْوى وَاَسْعَدَهُ عَلى ذلِكَ الْقَضاءُ، فَتَجاوَزْتُ بِما جَرى عَلَيَّ مِنْ ذلِكَ بَعْضَ حُدُودِكَ، وَخالَفْتُ بَعْضَ اَوامِرِكَ، فَلَكَ الْحَمْدُ عَلي في جَميعِ ذلِكَ، وَلا حُجَّةَ لي فيما جَرى عَلَيَّ فيهِ قَضاؤُكَ، وَاَلْزَمَني حُكْمُكَ وَبَلاؤُكَ. وَقَدْ اَتَيْتُكَ يا اِلهي بَعْدَ تَقْصيري وَاِسْرافي عَلى نَفْسي مُعْتَذِراً نادِماً مُنْكَسِراً مُسْتَقيلاً مُسْتَغْفِراً مُنيباً مُقِرّاً مُذْعِناً مُعْتَرِفاً، لا أجِدُ مَفَرّاً مِمّا كانَ مِنّي، وَلا مَفْزَعاً اَتَوَجَّهُ إليه في أَمْري، غَيْرَ قَبُولِكَ عُذْري، وَاِدْخالِكَ اِيّايَ في سَعَة رَحْمَتِكَ. اَللّهُمَّ فَاقْبَلْ عُذْري، وَارْحَمْ شِدَّةَ ضُرّي، وَفُكَّني مِنْ شَدِّ وَثاقي.\n'
                      'يا رَبِّ ارْحَمْ ضَعْفَ بَدَني، وَرِقَّةَ جِلْدي، وَدِقَّةَ عَظْمي، يا مَنْ بَدَأَ خَلْفي وَذِكْري وَتَرْبِيَتي وَبِرّي وَتَغْذِيَتي هَبْني لاِبْتِداءِ كَرَمِكَ، وَسالِفِ بِرِّكَ بي. يا اِلهي وَسَيِّدي وَرَبّي، اَتُراكَ مُعَذِّبي بِنارِكَ بَعْدَ تَوْحيدِكَ، وَبَعْدَ مَا انْطَوى عَلَيْهِ قَلْبي مِنْ مَعْرِفَتِكَ، وَلَهِجَ بِهِ لِساني مِنْ ذِكْرِكَ، وَاعْتَقَدَهُ ضَميري مِنْ حُبِّكَ، وَبَعْدَ صِدْقِ اعْتِرافي وَدُعائي خاضِعاً لِرُبُوبِيَّتِكَ، هَيْهاتَ أنْتَ اَكْرَمُ مِنْ أنْ تُضَيِّعَ مَنْ رَبَّيْتَهُ، أوْ تُبَعِّدَ مَنْ أدْنَيْتَهُ، اَوْ تُشَرِّدَ مَنْ آوَيْتَهُ، اَوْ تُسَلِّمَ اِلَى الْبَلاءِ مَنْ كَفَيْتَهُ وَرَحِمْتَهُ، وَلَيْتَ شِعْري يا سَيِّدي وَاِلهي وَمَوْلايَ، اَتُسَلِّطُ النّارَ عَلى وُجُوه خَرَّتْ لِعَظَمَتِكَ ساجِدَةً، وَعَلى اَلْسُن نَطَقَتْ بِتَوْحيدِكَ صادِقَةً، وَبِشُكْرِكَ مادِحَةً، وَعَلى قُلُوبٍ اعْتَرَفَتْ بِإلهِيَّتِكَ مُحَقِّقَةً، وَعَلى ضَمائِرَ حَوَتْ مِنَ الْعِلْمِ بِكَ حَتّى صارَتْ خاشِعَةً، وَعَلى جَوارِحَ سَعَتْ إلى أوْطانِ تَعَبُّدِكَ طائِعَةً، وَاَشارَتْ بِاسْتِغْفارِكَ مُذْعِنَةً، ما هكَذَا الظَّنُّ بِكَ، وَلا اُخْبِرْنا بِفَضْلِكَ عَنْكَ.\n'
                      'يا كَريمُ يا رَبِّ وَاَنْتَ تَعْلَمُ ضَعْفي عَنْ قَليل مِنْ بَلاءِ الدُّنْيا وَعُقُوباتِها، وَما يَجْري فيها مِنَ الْمَكارِهِ عَلى أهْلِها، عَلى أنَّ ذلِكَ بَلاءٌ وَمَكْرُوهٌ قَليلٌ مَكْثُهُ، يَسيرٌ بَقاؤُهُ، قَصيرٌ مُدَّتُهُ، فَكَيْفَ احْتِمالي لِبَلاءِ الآخِرَةِ، وَجَليلِ وُقُوعِ الْمَكارِهِ فيها، وَهُوَ بَلاءٌ تَطُولُ مُدَّتُهُ، وَيَدُومُ مَقامُهُ، وَلا يُخَفَّفُ عَنْ اَهْلِهِ، لاَِنَّهُ لا يَكُونُ إلاّ عَنْ غَضَبِكَ وَاْنتِقامِكَ وَسَخَطِكَ، وَهذا ما لا تَقُومُ لَهُ السَّماواتُ وَالأرْضُ، يا سَيِّدِي فَكَيْفَ لي وَأنَا عَبْدُكَ الضَّعيفُ الذَّليلُ الْحَقيرُ الْمِسْكينُ الْمُسْتَكينُ. يا اِلهي وَرَبّي وَسَيِّدِي وَمَوْلايَ لأيِّ الاُْمُورِ اِلَيْكَ اَشْكُو، وَلِما مِنْها أضِجُّ وَاَبْكي، لأليمِ الْعَذابِ وَشِدَّتِهِ، أمْ لِطُولِ الْبَلاءِ وَمُدَّتِهِ؟\n'
                      'فَلَئِنْ صَيَّرْتَني لِلْعُقُوباتِ مَعَ أعْدائِكَ، وَجَمَعْتَ بَيْني وَبَيْنَ أهْلِ بَلائِكَ، وَفَرَّقْتَ بَيْني وَبَيْنَ أحِبّائِكَ وَأوْليائِكَ، فَهَبْني يا إلهي وَسَيِّدِي وَمَوْلايَ وَرَبّي صَبَرْتُ عَلى عَذابِكَ، فَكَيْفَ اَصْبِرُ عَلى فِراقِكَ، وَهَبْني صَبَرْتُ عَلى حَرِّ نارِكَ، فَكَيْفَ اَصْبِرُ عَنِ النَّظَرِ إلى كَرامَتِكَ، أمْ كَيْفَ أسْكُنُ فِي النّارِ وَرَجائي عَفْوُكَ، فَبِعِزَّتِكَ يا سَيِّدي وَمَوْلايَ اُقْسِمُ صادِقاً لَئِنْ تَرَكْتَني ناطِقاً لاَِضِجَّنَّ إلَيْكَ بَيْنَ أهْلِها ضَجيجَ الآمِلينَ، وَلأصْرُخَنَّ إلَيْكَ صُراخَ الْمَسْتَصْرِخينَ، وَلأبْكِيَنَّ عَلَيْكَ بُكاءَ الْفاقِدينَ، وَلاَُنادِيَنَّكَ اَيْنَ كُنْتْ (كُنْتُ) يا وَلِيَّ الْمُؤْمِنينَ، يا غايَةَ آمالِ الْعارِفينَ، يا غِياثَ الْمُسْتَغيثينَ، يا حَبيبَ قُلُوبِ الصّادِقينَ، وَيا اِلهَ الْعالَمينَ.\n'
                      'أفَتُراكَ سُبْحانَكَ يا إلهي وَبِحَمْدِكَ تَسْمَعُ فيها صَوْتَ عَبْد مُسْلِم سُجِنَ فيها بِمُخالَفَتِهِ، وَذاقَ طَعْمَ عَذابِها بِمَعْصِيَتِهِ، وَحُبِسَ بَيْنَ اَطْباقِها بِجُرْمِهِ وَجَريرَتِهِ، وَهُوَ يَضِجُّ إلَيْكَ ضَجيجَ مُؤَمِّل لِرَحْمَتِكَ، وَيُناديكَ بِلِسانِ أهْلِ تَوْحيدِكَ، وَيَتَوَسَّلُ إلَيْكَ بِرُبُوبِيَّتِكَ، يا مَوْلايَ فَكَيْفَ يَبْقى فِي الْعَذابِ وَهُوَ يَرْجُو ما سَلَفَ مِنْ حِلْمِكَ، أَمْ كَيْفَ تُؤْلِمُهُ النّارُ وَهُوَ يَأْمُلُ فَضْلَكَ وَرَحْمَتَكَ، اَمْ كَيْفَ يُحْرِقُهُ لَهيبُها وَأنْتَ تَسْمَعُ صَوْتَهُ وَتَرى مَكانَه، اَمْ كَيْفَ يَشْتَمِلُ عَلَيْهِ زَفيرُها وَأنْتَ تَعْلَمُ ضَعْفَهُ، اَمْ كَيْفَ يَتَقَلْقَلُ بَيْنَ اَطْباقِها وَأنْتَ تَعْلَمُ صِدْقَهُ، اَمْ كَيْفَ تَزْجُرُهُ زَبانِيَتُها وَهُوَ يُناديكَ يا رَبَّهُ، اَمْ كَيْفَ يَرْجُو فَضْلَكَ في عِتْقِهِ مِنْها فَتَتْرُكُهُ فيها، هَيْهاتَ ما ذلِكَ الظَّنُ بِكَ، وَلاَ الْمَعْرُوفُ مِنْ فَضْلِكَ، وَلا مُشْبِهٌ لِما عامَلْتَ بِهِ الْمُوَحِّدينَ مِنْ بِرِّكَ وَاِحْسانِكَ، فَبِالْيَقينِ اَقْطَعُ لَوْ لا ما حَكَمْتَ بِهِ مِنْ تَعْذيبِ جاحِديكَ، وَقَضَيْتَ بِهِ مِنْ اِخْلادِ مُعانِدِيكَ، لَجَعَلْتَ النّارَ كُلَّها بَرْداً وَسَلاماً، وَما كانَ لأحَد فيها مَقَرّاً وَلا مُقاماً، لكِنَّكَ تَقَدَّسَتْ أسْماؤُكَ اَقْسَمْتَ أنْ تَمْلاََها مِنَ الْكافِرينَ مِنَ الْجِنَّةِ وَالنّاسِ اَجْمَعينَ، وَأنْ تُخَلِّدَ فيهَا الْمُعانِدينَ، وَأنْتَ جَلَّ ثَناؤُكَ قُلْتَ مُبْتَدِئاً، وَتَطَوَّلْتَ بِالإنْعامِ مُتَكَرِّماً، اَفَمَنْ كانَ مُؤْمِناً كَمَنْ كانَ فاسِقاً لا يَسْتَوُونَ.\n'
                      'إلهي وَسَيِّدى فَأَسْأَلُكَ بِالْقُدْرَةِ الَّتي قَدَّرْتَها، وَبِالْقَضِيَّةِ الَّتي حَتَمْتَها وَحَكَمْتَها، وَغَلَبْتَ مَنْ عَلَيْهِ اَجْرَيْتَها، أنْ تَهَبَ لي في هذِهِ اللَّيْلَةِ وَفي هذِهِ السّاعَةِ كُلَّ جُرْم اَجْرَمْتُهُ، وَكُلَّ ذَنْب اَذْنَبْتُهُ، وَكُلَّ قَبِيح أسْرَرْتُهُ، وَكُلَّ جَهْل عَمِلْتُهُ، كَتَمْتُهُ أوْ اَعْلَنْتُهُ، أخْفَيْتُهُ أوْ اَظْهَرْتُهُ، وَكُلَّ سَيِّئَة أمَرْتَ بِاِثْباتِهَا الْكِرامَ الْكاتِبينَ الَّذينَ وَكَّلْتَهُمْ بِحِفْظِ ما يَكُونُ مِنّي، وَجَعَلْتَهُمْ شُهُوداً عَلَيَّ مَعَ جَوارِحي، وَكُنْتَ أنْتَ الرَّقيبَ عَلَيَّ مِنْ وَرائِهِمْ، وَالشّاهِدَ لِما خَفِيَ عَنْهُمْ، وَبِرَحْمَتِكَ اَخْفَيْتَهُ، وَبِفَضْلِكَ سَتَرْتَهُ، وَأنْ تُوَفِّرَ حَظّي مِنْ كُلِّ خَيْر اَنْزَلْتَهُ أوْ اِحْسان فَضَّلْتَهُ، أوْ بِرٍّ نَشَرْتَهُ، أوْ رِزْق بَسَطْتَهُ، أوْ ذَنْب تَغْفِرُهُ، أوْ خَطَأ تَسْتُرُهُ، يا رَبِّ يا رَبِّ يا رَبِّ.\n'
                      'يا اِلهي وَسَيِّدي وَمَوْلايَ وَمالِكَ رِقّي، يا مَنْ بِيَدِهِ ناصِيَتي، يا عَليماً بِضُرّي وَمَسْكَنَتي، يا خَبيراً بِفَقْري وَفاقَتي، يا رَبِّ يا رَبِّ يا رَبِّ، أَسْأَلُكَ بِحَقِّكَ وَقُدْسِكَ، وَاَعْظَمِ صِفاتِكَ وَاَسْمائِكَ، أنْ تَجْعَلَ اَوْقاتي مِنَ اللَّيْلِ وَالنَّهارِ بِذِكْرِكَ مَعْمُورَةً، وَبِخِدْمَتِكَ مَوْصُولَةً، وَاَعْمالي عِنْدَكَ مَقْبُولَةً، حَتّى تَكُونَ أعْمالي وَأوْرادي كُلُّها وِرْداً واحِداً، وَحالي في خِدْمَتِكَ سَرْمَداً. يا سَيِّدي يا مَنْ عَلَيْهِ مُعَوَّلي، يا مَنْ اِلَيْهِ شَكَوْتُ أحْوالي، يا رَبِّ يا رَبِّ يا رَبِّ، قَوِّ عَلى خِدْمَتِكَ جَوارِحي، وَاشْدُدْ عَلَى الْعَزيمَةِ جَوانِحي، وَهَبْ لِيَ الْجِدَّ في خَشْيَتِكَ، وَالدَّوامَ فِي الاِْتِّصالِ بِخِدْمَتِكَ، حَتّى أسْرَحَ إلَيْكَ في مَيادينِ السّابِقينَ، وَاُسْرِعَ إلَيْكَ فِي الْبارِزينَ، وَاَشْتاقَ إلى قُرْبِكَ فِي الْمُشْتاقينَ، وَاَدْنُوَ مِنْكَ دُنُوَّ الُْمخْلِصينَ، وَاَخافَكَ مَخافَةَ الْمُوقِنينَ، وَاَجْتَمِعَ في جِوارِكَ مَعَ الْمُؤْمِنينَ.\n'
                      'اَللّهُمَّ وَمَنْ اَرادَني بِسُوء فَاَرِدْهُ، وَمَنْ كادَني فَكِدْهُ، وَاجْعَلْني مِنْ أحْسَنِ عَبيدِكَ نَصيباً عِنْدَكَ، وَاَقْرَبِهِمْ مَنْزِلَةً مِنْكَ، وَاَخَصِّهِمْ زُلْفَةً لَدَيْكَ، فَاِنَّهُ لا يُنالُ ذلِكَ إلاّ بِفَضْلِكَ، وَجُدْ لي بِجُودِكَ، وَاعْطِفْ عَلَيَّ بِمَجْدِكَ، وَاحْفَظْني بِرَحْمَتِكَ، وَاجْعَلْ لِساني بِذِكْرِكَ لَهِجَاً، وَقَلْبي بِحُبِّكَ مُتَيَّماً، وَمُنَّ عَلَيَّ بِحُسْنِ اِجابَتِكَ، وَاَقِلْني عَثْرَتي، وَاغْفِرْ زَلَّتي، فَاِنَّكَ قَضَيْتَ عَلى عِبادِكَ بِعِبادَتِكَ، وَاَمَرْتَهُمْ بِدُعائِكَ، وَضَمِنْتَ لَهُمُ الإجابَةَ، فَاِلَيْكَ يا رَبِّ نَصَبْتُ وَجْهي، وَاِلَيْكَ يا رَبِّ مَدَدْتُ يَدي، فَبِعِزَّتِكَ اسْتَجِبْ لي دُعائي، وَبَلِّغْني مُنايَ، وَلا تَقْطَعْ مِنْ فَضْلِكَ رَجائي، وَاكْفِني شَرَّ الْجِنِّ وَالإنْسِ مِنْ اَعْدائي. يا سَريعَ الرِّضا اِغْفِرْ لِمَنْ لا يَمْلِكُ إلاّ الدُّعاءَ، فَاِنَّكَ فَعّالٌ لِما تَشاءُ، يا مَنِ اسْمُهُ دَواءٌ وَذِكْرُهُ شِفاءٌ وَطاعَتُهُ غِنىً، اِرْحَمْ مَنْ رَأْسُ مالِهِ الرَّجاءُ، وَسِلاحُهُ الْبُكاءُ، يا سابِغَ النِّعَمِ، يا دافِعَ النِّقَمِ، يا نُورَ الْمُسْتَوْحِشينَ فِي الظُّلَمِ، يا عالِماً لا يُعَلَّمُ، صَلِّ عَلى مُحَمَّد وَآلِ مُحَمَّد، وَافْعَلْ بي ما أنْتَ اَهْلُهُ، وَصَلَّى اللهُ عَلى رَسُولِهِ وَالأَئِمَّةِ الْمَيامينَ مِنْ آلِهِ، وَسَلَّمَ تَسْليماً كَثيراً ".\n',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
            ],
          ),
        ),
        bottomNavigationBar: AddCustomBottomNavigationBar(
        pushNext: DouaaAl3asharat.screenRoute,
        pushBack: DouaaAltawasol.screenRoute,
        soud: 'دعاء كميل.mp3',
        onTap: (double fontSize) {
          // تحديث حجم الخط
          setState(() {
            isTablet ? _fontSizeTablet = fontSize : _fontSize = fontSize;
          });
          print('fontSize: $fontSize');
          // إغلاق Dialog
          Navigator.of(context).pop();
        },
        onLongPress: () {
          final snackBar = SnackBar(
            content: Center(
              child: Text(
                '${isTablet ? _fontSizeTablet.toInt() : _fontSize.toInt()}',
                style: TextStyle(
                  color: Colors.white,
                  fontSize: 16,
                ),
              ),
            ),
            width: 60,
            behavior: SnackBarBehavior.floating,
            backgroundColor: Colors.blue,
            duration: Duration(seconds: 2),
            shape: ShapeBorder.lerp(
              RoundedRectangleBorder(
                borderRadius: BorderRadius.circular(50),
              ),
              RoundedRectangleBorder(
                borderRadius: BorderRadius.circular(50),
              ),
              1,
            ),
          );
          ScaffoldMessenger.of(context).showSnackBar(snackBar);
        },
      ),
      ),
    );
  }
}
