import 'package:flutter/material.dart';
import 'package:maktabat_almoslim/widgets/container_scrollview.dart';
import 'package:provider/provider.dart';
import 'package:shared_preferences/shared_preferences.dart';

import '../../../widgets/add_custom_bottom_navigation_bar.dart';
import '../../../widgets/list_of_nine_verses.dart';
import '../../favorites_provider.dart';
import '../../favorites_screen.dart';
import '../ala7raz_walad3iya_almoujaza.dart';
import 'almonajat_bitalab_al7awa2ij.dart';
import 'fi_ba3d_ma_yata3alak_belmawt.dart';

class FiAsarBa3dSowarWalayat extends StatefulWidget {
  static String screenRoute = 'fi_asar_ba3d_sowar_walayat_screen';
  const FiAsarBa3dSowarWalayat({super.key});

  @override
  State<FiAsarBa3dSowarWalayat> createState() => _FiAsarBa3dSowarWalayatState();
}

double _fontSize = 18;
double _fontSizeTablet = 30;

class _FiAsarBa3dSowarWalayatState extends State<FiAsarBa3dSowarWalayat> {
  bool isIcon = true;
  @override
  void initState() {
    super.initState();
    _loadFavoriteState();
  }

  Future<void> _loadFavoriteState() async {
    final prefs = await SharedPreferences.getInstance();
    bool? savedState =
        prefs.getBool('isFavorite_fi_asar_ba3d_sowar_walayat_screen');
    setState(() {
      isIcon = savedState ?? true;
    });
  }

  Future<void> _saveFavoriteState(bool value) async {
    final prefs = await SharedPreferences.getInstance();
    await prefs.setBool('isFavorite_fi_asar_ba3d_sowar_walayat_screen', value);
  }

  Future<bool> _onWillPop() async {
    final args =
        ModalRoute.of(context)!.settings.arguments as Map<String, dynamic>?;
    final previousPage = args?['previousPage'];
    if (previousPage == 'favorite_screen') {
      Navigator.of(context).pushReplacementNamed(FavoritesScreen.screenRoute);
      return false;
    } else {
      Navigator.of(context)
          .pushReplacementNamed(Ala7razWalad3iyaAlmoujaza.screenRoute);
      return false;
    }
  }

  @override
  Widget build(BuildContext context) {
    double size = MediaQuery.of(context).textScaleFactor;
    final screenWidth = MediaQuery.of(context).size.width;
    final isTablet = screenWidth >= 600;
    return WillPopScope(
      onWillPop: _onWillPop,
      child: Scaffold(
        appBar: AppBar(
          toolbarHeight: isTablet ? 100 : 50,
          centerTitle: true,
          leading: IconButton(
            onPressed: _onWillPop,
            icon: Icon(
              Icons.arrow_back,
              size: isTablet ? 50 : 25,
            ),
          ),
          actions: [
            IconButton(
              padding: EdgeInsets.only(left: isTablet ? 50 : 30),
              icon: Icon(
                isIcon ? Icons.favorite_border : Icons.favorite_rounded,
                size: isTablet ? 40 : 25,
                color: isIcon ? Colors.black : Colors.red,
              ),
              onPressed: () async {
                setState(() {
                  isIcon = !isIcon;
                });
                await _saveFavoriteState(isIcon);

                if (!isIcon) {
                  Provider.of<FavoritesProvider>(context, listen: false)
                      .addFavorite('في آثار بعض السور والايات وذكر أمور مختلفة',
                          FiAsarBa3dSowarWalayat.screenRoute);
                } else {
                  Provider.of<FavoritesProvider>(context, listen: false)
                      .removeFavorite(
                          'في آثار بعض السور والايات وذكر أمور مختلفة',
                          FiAsarBa3dSowarWalayat.screenRoute,
                          FiAsarBa3dSowarWalayat.screenRoute);
                }
              },
            ),
          ],
          title: Text(
            'في آثار بعض السور والايات وذكر أمور مختلفة',
            style: TextStyle(
              fontSize: isTablet
                  ? 40
                  : size > 1.0
                      ? 20
                      : 23,
              fontWeight: FontWeight.bold,
            ),
          ),
        ),
        body: ContainerScrollview(
          widget: Column(
            crossAxisAlignment: CrossAxisAlignment.start,
            children: [
              Container(
                child: Column(
                  children: [
                    Center(
                      child: Text(
                        'بسم الله الرحمن الرحيم',
                        style: TextStyle(
                          fontSize: isTablet ? _fontSizeTablet : _fontSize,
                          fontWeight: FontWeight.w900,
                        ),
                      ),
                    ),
                    Center(
                      child: Text(
                        'اللهم صلِّ على محمد وآل محمد',
                        style: TextStyle(
                          fontSize: isTablet ? _fontSizeTablet : _fontSize,
                          fontWeight: FontWeight.w900,
                        ),
                      ),
                    ),
                  ],
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: 'وفيه اربعين فقرةً :'
                      'الأول :',
                  subtitle: 'روى الكليني في الكافي عن الباقر (عليه السلام) قال: من قرأ المسبحات كلها أي سورة الحديد والحشر والصف والجمعة والتغابن والاعلى قبل أن ينام لم يمت حتى يدرك القائم (عليه السلام) وإن مات كان في جوار محمد النبي (صلّى الله عليه وآله وسلم).',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: 'الثاني :',
                  subtitle: 'أيضاً في الكافي أن النبي (صلّى الله عليه وآله وسلم) قال: من قرأ أربع آيات من أوّل البقرة وآية الكرسي، وآيتين بعدها، وثلاث آيات من آخرها، لم ير في نفسه وماله شَيْئاً يكرهه، ولا يقربه شيطان، ولاينسى القرآن.',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: 'الثالث :',
                  subtitle: 'روى الكليني أيضاً عن الإمام محمد الباقر (عليه السلام): من قرأ إنّا أنزلناه في ليلة القدر، يجهر بها صوته كان كالشاهر سيفه، ومن قرأها سرّا كان كالمتشحّط بدمه في سبيل الله ، ومن قرأها عشر مرات غفرت له ألف ذنب من ذنوبه.',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: 'الرابع :',
                  subtitle: 'وروى الكليني أيضاً عن الصادق (عليه السلام) قال: كان أبي يقول: قل هو الله أحد ثلث القرآن، وقل ياأيّها الكافرون ربع القرآن.',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: 'الخامس :',
                  subtitle: 'روي عن الإمام موسى (عليه السلام) قال: من قرأ آية الكرسي عند منامه لم يخف الفالج إن شاء الله ، ومن قرأها في دبر كل فريضة، لم يضره ذو حمة، وقال من قدّم قل هو الله أحد بينه وبين جبار منعه الله عزَّ وجلَّ منه، يقرؤها من بين يديه ومن خلفه وعن يمينه وعن شماله فإذا فعل ذلك رزقه الله عزَّ وجلَّ خيره ومنعه من شره، وقال: إذا خفت أمراً فاقرأ مائة آية من القرآن من حيث شئت، ثم قل: اللّهُمَّ اكشف عَنِّي البَلاءِ ثلاث مرات.',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: 'السادس :',
                  subtitle: 'روى الكليني أيضاً عن الصادق (عليه السلام) قال: من كان يومن بالله واليوم الاخر، فلا يدع أن يقرأ في دبر الفريضة قل هو الله أحد فإنّه من قرأها جمع الله له خير الدنيا والاخرة وغفر له ولوالديه وما ولد.',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: 'السابع :',
                  subtitle: 'روي عنه أيضاً قال: من قرأ ألهيكم التكاثر عند النوم وُقِيَ فتنة القبر.',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: 'الثامن :',
                  subtitle: 'وروي عنه أيضاً قال: لو قرأت الحمد على ميت سبعين مرة ثم ردّت فيه الروح، ماكان ذلك عجبا.',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: 'التاسع :',
                  subtitle: 'قد روي عن موسى بن جعفر (عليه السلام) فضل كثير للصبي إذا قرأ في كل ليلة قل أعوذ برب الفلق ثلاث مرات، وقل أعوذ برب الناس ثلاث مرات، والتوحيد مائة مرة، فإن لم يقدر، فخمسين مرة، فإن تعهد نفسه بذلك أو تعوهد كان محفوظا إلى يوم وفاته.',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: 'العاشر :',
                  subtitle: 'روى الكليني أيضاً عن الإمام جعفر الصادق (عليه السلام) قال للمفضل: يامفضل احتجز من الناس كلهم ب‍‍: بسم الله الرحمن الرحيم وب‍‍: قل هو الله أحد اقرأها عن يمينك وعن شمالك، ومن بين يديك، ومن خلفك، ومن فوقك، ومن تحتك، فإذا دخلت على سلطان جائر فاقرأها حين تنظر إليه ثلاث مرات، واعقد بيدك اليسرى، ثم لاتفارقها حتى تخرج من عنده (أي احتفظ بأصابعك كما هي مضمومة حتى تخرج) أو المعنى لاتترك قراءة السورة حتى تخرج من عنده كما احتمله البعض.',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: 'الحادي عشر :',
                  subtitle: 'في رواية عن أمير المومنين (عليه السلام) أنّه للامن من الحرق والغرق إقرأ:\n\n'
                  'الله الَّذي نَزَّلَ الكِتابَ وَهُوَ يَتَولَّ الصالِحينَ وَماقَدَرُوا الله حَقَّ قَدْرِهِ. وَالاَرْضُ جَميعاً قَبْضَتُهُ يَوْمَ القِيامَةِ مَطْوِياتٌ بِيَمينِهِ سبُحْانَهُ وَتَعالى عَمّا يُشْرِكونَ. وللدابة إذا استصعبت على صاحبها إقرأ في أذنها اليمنى :\n\n'
                  'وَلَهُ أَسْلَمَ مَنْ في السَّماوَاتِ وَالاَرْضِ طَوْعا وَكَرْها وَإلَيْهِ يُرْجَعونَ.\n\n'
                  'واقرأ في الارض المسبعة (وهي أرض تسكنها السباع) :\n\n'
                  'لَقَدْ جأَكُمْ رَسُولٌ مِنْ أَنْفِسِكُمْ عَزيزٌ عَلَيْهِ ماعَنِتُّمْ حَريصٌ عَلَيْكُمْ بِالمُؤمنينَ رَؤوفٌ رَحيمٌ فِإنْ تَوَلّوْا فَقُلْ حَسْبِيَ الله لا إلهَ إِلاّ هَوَ عَلَيْهِ تَوَكَّلْتُ وَهُوَ رَبُّ العَرْشِ العَظيمِ.\n\n'
                  'ولرد الضّالة : اقرأ يَّس في ركعتين وقل: ياهاديَ الضّالَةِ رُدَّ عَلَيَّ ضالَتي.\n\n'
                  'ولرجوع العبد الابق اقرأ : كَظُلُماتٍ في بَحْرٍ لُجِّي يَغْشيهُ مَوجٌ مِنْ فَوْقِهِ مَوجٌ… الى قوله عزَّ وجلَّ وَمَنْ لَمْ يَجْعَلِ الله لَهُ نُوراً فَمالَهُ مِنْ نُورٍ.\n\n'
                  'وللامن من اللص إقرأ إذا أويت الى فراشك: قُلْ ادْعوا الله او ادْعُوا الرَّحْمنَ الى وَكَبِّرْهُ تَكْبيراً.',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: 'الثاني عشر :',
                  subtitle: 'عن الصادق (عليه السلام) قال: لاتملُّوا قراءة إذا زلزلت الارض زلزالها فإنّه من كانت قراءته بها في نوافله لم يصبه الله عزَّ وجلَّ بزلزلة أبداً، ولم يمت بها، ولا بصاعقة، ولا بآفة من آفات الدنيا حتى يموت، وإذا مات نزل عليه ملك كريم من عند ربّه فيقعد عند رأسه فيقول: ياملك الموت إرفق بوليّ الله فإنّه كان كَثِيراً مايذكرني… الخبر.\n\n'
                  'وفي ذيل الرواية أنّه يكشف له الغطاء فيرى منازله في الجنّة فيخرج روحه من ألْين ما يكون من العلاج ثم يشيع روحه إلى الجنّة سبعون ألف ملك، يبتدرون بها إلى الجنّة.',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: 'الثالث عشر :',
                  subtitle: 'وروى الكليني أيضاً عن الإمام محمد الباقر (عليه السلام) قال: سورة الملك هي المانعة تمنع من عذاب القبر … الخبر.',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: 'الرابع عشر :',
                  subtitle: 'وروي عنه (عليه السلام) أيضاً قال: وقع مصحف في البحر فوجدوه وقد ذهب مافيه إِلاّ هذه الآية ألا إِلى الله تَصِيرُ الامُورُ.',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: 'الخامس عشر :',
                  subtitle: 'روى الشيخ الكليني أيضاً عن زرارة أنّه كان يقول: تأخذ المصحف في الثلث الثاني من شهر رمضان فتنشره وتضعه بين يديك وتقول :\n\n'
                  'اللّهُمَّ إنِّي أَسْأَلُكَ بِكِتابِكَ المُنَزَّلُ وَما فيهِ وَفيهِ اسْمُكَ الاَعْظَمُ الاَكْبَرُ وَأَسْماؤكَ الحُسْنى وَما يُخافُ وَيُرْجى أَنْ تَجْعَلْني مِنْ عُتَقائِكَ مِنَ النّارِ. وتدعو بما بداً لك من حاجة.',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: 'السادس عشر :',
                  subtitle: 'قال الكفعمي في المصباح والمحدّث الفيض، في خلاصة الاذكار وجدت في بعض كتب الإمامية أنّ من أراد أن يرى في منامه أحد الانبياء أو الأئمة (عليهم السلام) أو أحد النّاس أو والديه فيلقرأ سورة الشمس والليل والقدر وقل ياأيّها الكافرون وسورة الاخلاص والمعوذتين ثم يقرأ سورة الاخلاص مائة مرة ويصلي على النبي وآله مائة مرة ولينم على وضؤ وعلى جانبه الايمن فإنّه يرى في المنام من شاء إن شاء الله ويتكلم معه إن شاء الله ماشاء، ووجدت في نسخة أخرى أنّه يعمل ما ذكر سبع ليالٍ، بعد مايدعو بهذا الدعاء :\n\n'
                  'اللّهُمَّ أَنْتَ الحَيُّ الَّذي لايُوصَفُ وَالايْمانُ يُعْرَفُ مِنْهُ، مِنْكَ بَدَتْ الاَشْياءُ وَإلَيْكَ تَعُودُ فَما أَقْبَلَ مِنْها كُنْتَ مَلْجَأَهُ وَمَنْجاهُ وَما أَدْبَرَ مِنْها لَمْ يَكُنْ لَهُ مَلْجَأُ وَلا مَنْجَا مِنْكَ إِلاّ إلَيْكَ فَأَسْأَلُكَ بِلا إلهَ إِلاّ أَنْتَ وَأَسْأَلُكَ بِبِسْمِ الله الرَّحْمنِ الرَّحيمِ وَبِحَقِّ مُحَمَّدٍ حبيبك صَلّى الله عَلَيْهِ وَآلِهِ سَيِّدَ النَبِيينَ وَبِحَقِّ عَليِّ خَيْرِ الوَصِيينَ وَبِحَقِّ فَاطِمَةَ سَيِّدَةِ نِساءِ العَالَمينَ وَبِحَقِّ الحَسَنِ وَالحُسَيْنِ اللَّذَينِ جَعَلْتَهُما سَيِّدَيْ شَبابِ أَهْلِ الجَنَّةِ عَلَيْهِمْ أَجْمَعينَ السَّلامُ أَنْ تُصَلِّيَ عَلى مُحَمَّدٍ وَآلِ مُحَمَّدٍ وَأَنْ تَريني مَيِّتي في الحالِ الَّتي هُوَ فِيها.',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: 'السابع عشر :',
                  subtitle: 'في الخلاصة أيضاً عن بعض الكتب أنّه وجدت في كتاب (الاداب الحميدة) تأليف محمد بن جرير الطّبري، عن حارث بن روح عن أبيه عن جده، أنّه قال لابنائه: إذا أحزنكم أمر فلا يبيت احدكم إِلاّ وهو طاهر وفراشه ودثاره طاهران، ولم تكن معه امرأة، ثم يقرأ سبع مرات سورة والشمس وسبعا سورة والليل، ثم يقول : اللّهُمَّ اجْعَلْ لي مِنْ أَمْري هذا فَرَجاً وَمَخْرَجاً، فإذا فعل ذلك رأى في منامه من يعلّمه المخرج من الغمّ في تلك الليلة، أو الليلة الثالثة، أو الخامسة، واظن أنّه قال أو السابعة.\n\n'
                  'أقول : قال بعض ليقرأ سورة والضحى وألم نشرح أيضاً وفي الجواهر المنثورة، من أراد أن يرى مطلبه في منامه فليقرأ عند النوم كلاًّ من هذه السور سبع مرات: الشمس، والليل، والتين، والاخلاص، وقل أعوذ برب الفلق، وقل أعوذ برب الناس، ولينم على طهارة في مكان نظيف، في ثوب نظيف، مستقبلاً القبلة على جانبه الايمن أي ينام على هيئة الميت، في اللحد، ولينو مطلبه، فان لم يره في الليلة الأولى رآه في ماتليها من الليالي، ولاتعدو الليلة السابعة، قيل إنّها مجربة.',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: 'الثامن عشر :',
                  subtitle: 'أيضاً روي في خلاصة الاذكار عن الزهراء صلوات الله عليها قالت: دخل عليّ رسول الله (صلّى الله عليه وآله وسلم) وقد افترشت فراشي للنوم، فقال لي: يافاطمة لاتنامي إِلاّ وقد عملت أربعة: ختمت القرآن، وجعلت الانبياء شفعاءك، وأرضيت المؤمنين عن نفسك، وحججت واعتمرت، قال هذا وأخذ في الصلاة فصبرت حتى أتمّ صلاته، قلت يارسول الله (صلّى الله عليه وآله وسلم) أمرت بأربعة لا أقدر عليها في هذا الحال فتبسم (صلّى الله عليه وآله وسلم) وقال: إذا قرأت قل هو الله أحد ثلاث مرات، فكأنك ختمت القرآن، وإذا صلّيت عليّ وعلى الانبياء قبلي كنّا شفعاءك يوم القيامة، وإذا استغفرت للمؤمنين رضوا كلهم عنك، وإذا قلت : سُبْحانَ الله وَالحَمْدُ لله وَلا إلهَ إِلاّ الله وَالله أَكْبَرُ، فقد حججت واعتمرت.\n\n'
                  'أقول : روى الكفعمي رض أنّ من قال عند النوم ثلاثا: يَفْعَلُ الله مايَشاءُ بِقُدْرَتِهِ وَيَحْكُمُ مايُريدُ بِعِزَّتِهِ. فكأنما صلّى ألف ركعة.',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: 'التاسع عشر :',
                  subtitle: 'أيضاً في خلاصة الاذكار قل عند المطالعة :\n\n'
                  'اللّهُمَّ أخْرِجْني مِنْ ظُلُماتِ الوَهْمِ وَأكْرِمْني بِنُورِ الفَهْمِ، اللّهُمَّ افْتَحْ عَلَيْنا أَبْوابَ رَحْمَتِكَ وَانْشُرْ عَلَيْنا خَزائِنَ عُلُومِكَ بِرَحْمَتِكَ ياأَرْحَمَ الرّاحِمينَ.',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: 'العشرون :',
                  subtitle: 'روي أن رجلاً كتب إلى الإمام محمد التقي (عليه السلام) إنّ عليّ دينا كَثِيراً فكتب (عليه السلام) في الجواب أكثر من الاستغفار، واجعل لسانك مُبْتَلاً بقراءة إنّا أنزلناه.',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: 'الحادي والعشرون :',
                  subtitle: 'في الحديث أنّ المفضّل شكا إلى الصادق (عليه السلام) ضيق النفس، وقال إنّي إذا سرت قليلاً تضايق نفسي، فأضطر إلى الجلوس، فقال له: إشرب من أبوال الابل ليسكن الداء. وفي حديث آخر شكا إليه رجل السعال فقال: خذ في راحتك شَيْئاً من الكاشم (الانجدان الرومي) ومثله من السكر فاستفّه يوما أو يومين، قال الرجل: مافعلته إِلاّ مرّة حتى ذهب.',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: 'الثاني والعشرون :',
                  subtitle: 'روي عن أمير المؤمنين (عليه السلام) أنّه مرّ عيسى بن مريم (عليه السلام) ببلدة فرأى أهلها صفر الوجوه دكن العيون، فشكوا إليه كثرة الاسقام، فقال إنّكم تطبخون لحم الابل قبل غسله، ولا يخرج من الدنيا حيوان إِلاّ ومعه جنابة، فدأبوا على غسل لحم الابل قبل الطبخ فزالت عنهم الاسقام.\n\n'
                  'ومرّ عيسى (عليه السلام) ببلدة أخرى كانت قد تساقطت أسنان أهلها ، وانتفخت وجوههم، فقال لهم: دعوا أفواهكم مفتوحة عند النوم ولا تطبّقوها، فعملوا بما قال فزال الداء عنهم.',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: 'الثالث والعشرون :',
                  subtitle: 'عن الإمام محمد الباقر (عليه السلام) قال إذا شاهدت أحداً من أهل البَلاءِ فقل خفاتا بحيث لا يسمعك ثلاث مرات : الحَمْدُ لله الَّذي عافاني مِمّا ابْتَلاكَ بِهِ وَلَوْ شاءَ فَعَلَ فمن فعل ذلك لن يصاب بذلك البلاء.\n\n'
                  'وعلى رواية أخرى قل : الحَمْدُ لله الَّذي عافاني مِمّا ابْتَلاكَ بِهِ وَفَضَّلَني عَلَيْكَ وَعَلى كَثيرٍ مِمَّنْ خَلَقْ، وأخفت حتى لايسمعك.',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: 'الرابع والعشرون :',
                  subtitle: 'عن الإمام جعفر الصادق (عليه السلام) قال: إذا حملت المرأة ومضت من حملها أربعة أشهر، فأدر بوجهها إلى القبلة واقرأ آية الكرسي واضرب على جانبها بيدك وقل: اللّهُمَّ إِنِّي قَدْ سَمَّيْتُهُ مُحَمَّداً، فإذا فعل ذلك، جعل الله الجنين ذكراً، فإذا سمّاه محمّداً بورك فيه وإن لم يسمه به، فإن شاء الله أخذه منه وإن شاء وهبه إيّاه.',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: 'الخامس والعشرون :',
                  subtitle: 'روي أنه يقال عند ذبح العقيقة :\n\n'
                  'بِسْمِ الله وَبِالله اللّهُمَّ عَقيقَةً عَنْ فُلانٍ ـ ويسمى المولود ـ لَحْمُها بِلَحْمِهِ وَدَمُها بِدَمِهِ وَعَظْمُها بِعَظْمِهِ اللّهُمَّ اجْعَلْها وِقاءً لآلِ مُحَمَّدٍ عَلَيْهِ وَآلِهِ السَّلامُ.\n\n'
                  'وقال في حديث آخر : تقول :\n\n'
                  'ياقَوْمِ إنّي بَريٌ مِمّا تُشْرِكُونَ إنّي وَجَّهْتُ وَجْهي لِلَّذي فَطَرَ السَّماوَاتِ وَالاَرْضِ حَنيفا مُسْلِما وَما أَنا مِنَ المُشْرِكينَ إنَّ صَلاتي وَنُسِكي وَمَحْيايَ وَمَمَاتي لله رَبِّ العالَمينَ لاشَريكَ لَهُ وَبِذلِكَ أُمِرْتُ وَأَنا مِنَ المُسْلِمينَ، اللّهُمَّ مِنْكَ وَلَكَ بِسْمِ الله وَبِالله وَالله أَكْبَرُ، اللّهُمَّ صَلِّ عَلى مُحَمَّدٍ وَآل مُحَمَّدٍ وَتَقَبَّلْ مِنْ فُلانٍ بِنْ فُلانٍ. ويسمي المولود باسمه ثم يذبح.\n\n'
                  'قال العلاّ مة المجلسي في (الحلية) : العقيقة سنة مؤكدة لمن قدر عليها وقد أوجبها بعض العلماء، والافضل أن تذبح العقيقة في اليوم السابع، وهي سنّة على الاب إن أخرها عنه حتى يبلغ الصبي، فإذا بلغ تحوّل الاستحباب عن الاب إلى البالغ نفسه، مادام حيا. وفي أحاديث كثيرة أنّ العقيقة واجبة على من ولد له مولود. وفي أحاديث كثيرة أن كل مولود مرتهن بالعقيقة أي إن لم يعق عنه، تعرّض لانواع البَلاءِ والموت.\n\n'
                  'وعن الصادق (عليه السلام) قال : العقيقة لازمة لمن كان غنيا ومن كان فقيراً إذا أيسر فعل وإن لم يقدر على ذلك فليس عليه وإن لم يعق عنه حتى ضحى عنه، فقد اجزأته الاضحية.\n\n'
                  'وروي في حديث آخر قيل له (عليه السلام) : قد طلبنا شاتا نعقه، فلم نجد فما تقول ؟ انتصدق بثمنه قال (عليه السلام) أطلبوه حتى تجدوه، إن الله يحبّ إطعام الطعام، وإهراق الدم. وسئل في حديث آخر، هل يعق للمولود إذا مات في اليوم السابع، فأجاب (عليه السلام) إن مات قبل الظهر فليس عنه عقيقة وإن مات بعده فليعق عنه.\n\n'
                  'وروي في حديث معتبر عن عمر بن يزيد أنّه قال له (عليه السلام) : إنّي والله ماأدري كان أبي عق عني أم لا، فأمره (عليه السلام) بالعقيقة فعق عن نفسه وهو شيخ. وفي حديث حسن عنه (عليه السلام) قال: يسمى الصبي في اليوم السابع، ويعق عنه، ويحلق رأسه ويتصدق بزنة الشعر فضّة، وترسل الرجل والفخذ للقابلة التي عاونت الام في وضع الحمل، ويطعم الناس بالباقي منها، ويتصدق به.\n\n'
                  'وقال في حديث موثق آخر إذا ولد لك ابن أو بنت، فتعقّ عنه في اليوم السابع شاةً أو إبلاً وتسميه ، وتحلق رأسه في اليوم السابع، وتتصدق بوزن الشعر ذهبا أو فضّة، وفي حديث آخر يعطى القابلة ربع الشاة، فان لم تكن قابلة فلامّه تعطيها من شاءت، ويطعم منها عشرة من المسلمين، فإذا زاد فهو أفضل ولا يأكل هو من لحمها وإن كانت القابلة يهوديّة أعطى لها ثمن ربعها.\n\n'
                  'وورد في حديث آخر يعطى للقابلة ثلث الشاة، والمشهور بين العلماء أن العقيقة تكون إبلاً أو شاةً أو معزا.\n\n'
                  'وعن الإمام الباقر (عليه السلام) قال إنّ رسول الله (صلّى الله عليه وآله وسلم) أذّن في أذن الحسنين صلوات الله عليهما يوم ولادتهما وفاطمة (عليها السلام) عقت عنهما في اليوم السابع وأعطت القابلة رجل شاة وديناراً. والعقيقة ينبغي أن تكون جملاً قد أتمّ السنة الخامسة من العمر أو ماعزاً أتمّ الأولى من عمره، أو غنما ذا ستة أشهر، والافضل أن يكون قد أتمّ الشهر السابع أيضاً وينبغي أن لا يكون مايعق به خصيا قد سلّت خصيتاه، والافضل أن لايكون معصور الخصية، وأن يكون سليم القرن، لم يصب بكسر يبلغ النقي، وسليم الاذن وأن لايكون هزيلاً جداً، ولا أعمى ولا أعرج يصعب الركوب عليه، ولكن ورد في حديث معتبر عن الصادق (عليه السلام) قال: ليست العقيقة من الاضحية فيجزي فيها الشاة كيفما كانت، والغرض إنما هو اللحم، فما كان أفره كان أفضل والمشهور بين العلماء استحباب أن يعق الذكر عن الذكر، والانثى عن الانثى، وأظن أنّ الذكر أفضل عن كليهما كما عليه أحاديث معتبرة كثيرة، ولا بأس بالانثى عنهما أيضا.\n\n'
                  'ومن المسنون أن لايأكل الوالدان من العقيقة والاحسن أن يدعا كل طعام طبخ فيه شي من لحمها وأكل الام منها أشد كراهة والافضل أن لا يأكل منها من في دار الابوين من عيالهما والمسنون أن تطبخ العقيقة، فلا يتصدق بها نيئة وأقله أن يطبخ بالماء والملح، بل يحتمل أن يكون هذا هو الافضل ولا بأس بالتصدق بها نيئة ولا يغني التصدّق بثمنها إذا لم يوجد مايعقّ به، بل يصبر حتى يوجد، ولا يشترط الفقر فيمن يدعى على العقيقة والافضل أن تكون الدعوة للصلحاء والفقراء انتهى.\n\n'
                  'أقول : المشهور كراهة كسر عظام العقيقة، ولاينافيها الحديث. يكسر عظمها ويقطع لحمها وتصنع بها بعد الذبح ماشئت.\n\n'
                  'وقال صاحب الجواهر إنّ ما اشتهر بين أهل العراق من استحباب أن تربط عظامها في خرقة بيضاء وتدفن، فلم اقف على نصّ فيه، والله العالم.',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: 'السادس والعشرون :',
                  subtitle: 'عن الصادق (عليه السلام) في الصبي إذا ختن قال: يقول هذه الكلمات وأي رجل لم يقلها على ختان ولده فليقلها عليه من قبل أن يحتلم، فإن قالها كفي حرّ الحديد من قتل أو غيره:\n\n'
                  'اللّهُمَّ إنَّ هذِهِ سُنَّتُكَ وَسُنَّةُ نَبِيِّكَ صَلَواتُكَ عَلَيْهِ وَآلِهِ وَاتِّباعٌ مِنّا لَكَ وَلِنَبِيِّكَ بِمَشيِّتِكَ وَبِإرادَتِكَ وَقَضائِكَ لامْرٍ أرَدْتَهُ وَقَضاءٍ حَتَمْتَهُ وَأَمْرٍ أَنْفَذْتَهُ وَأَذَقْتَهُ حَرَّ الحَديدِ في خِتانِهِ وَحِجامَتِهِ بِأَمْرٍ أَنْتَ أَعْرَفُ بِهِ مِنّي، اللّهُمَّ فَطَهِّرْهُ مِنَ الذُّنُوبِ وَزِدْ في عُمرِهِ وَإدْفَعْ الافاتِ عَنْ بَدَنِهِ وَالاَوْجَاعَ عَنْ جِسْمِهِ وَزِدْهُ مِنْ الغِنى وَادْفَعْ عَنْهُ الفَقْرَ فَإنَّكَ تَعْلَمُ وَلا نَعْلَمُ.',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: 'السابع والعشرون :',
                  subtitle: 'روى السيد ابن طاووس عن (دعوات) الخطيب المستغفري، عن رسول الله (صلّى الله عليه وآله وسلم) قال : إذا أردت أن تتفأل بكتاب الله عزَّ وجلَّ فاقرأ سورة الاخلاص ثلاث مرات، ثم صلّ على النبي وآله ثلاثا. ثم قل :\n\n'
                  'اللّهُمَّ إنّي تَفأَلْتُ بِكِتابِكَ وَتَوّكَّلْتُ عَلَيْكَ فَأَرِني مِنْ كِتابِكَ ماهُوَ مَكْتُومٌ مِنْ سِرِّكَ المَكْنونِ في غَيْبِكَ ، ثم افتح الجامع (أي القرآن الحاوي لجميع السور والايات) وخذ الفأل من الخط الأول في الجانب الأول من غير أن تعد الاوراق والخطوط.\n\n'
                  'وأعلم أن العلامة المجلسي قد روى في بعض مؤلفات الاصحاب عن خطّ الشيخ يوسف القطيفي عن خط آيه الله العلامة، عن الصادق (عليه السلام) قال: إذا أردت الاستخارة من الكتاب العزيز فقل بعد البسملة:\n\n'
                  'إنْ كانَ في قَضائِكَ وَقَدَرِكَ أَنْ تَمُنَّ عَلى شِيعَةِ آلِ مُحَمَّدٍ عَلَيْهِمْ السَّلامُ بِفَرَجِ وَلِيِّكَ وَحُجَّتِكَ عَلى خَلْقِكَ فَاخْرِجْ إلَيْنا آيَةً مِنْ كِتابِكَ نَسْتَدِلُّ بِها عَلى ذلِكَ.\n\n'
                  'ثم تفتح المصحف وتعدّ ستّ ورقات، ومن السابعة ستّة أسطر، وتنظر مافيه، وقال الشيخ الشهيد رض في (الذكرى) ومن الاستخارات :\n\n'
                  'الاستخارة بالعدد : ولم تكن هذه مشهورة في العصور الماضية قبل زمان السيد الكبير العابد رضيّ الدين محمد بن محمد الاوي الحسيني المجاور للمشهد المقدس الغروي رضي الله عنه وقد رويناها عنه وجميع مروياته عن عدة من مشايخنا عن الشيخ الكبير الفاضل جمال الدين بن المطهر، عن والده رضي الله عنهما، عن السيد رضي الدين عن صاحب الامر (عليه السلام)، يقرأ فاتحة الكتاب عشر مرات، وأقل منه ثلاث مرات والادنى منه مرّة، ثم يقرأ سورة القدر عشر مرات ، ثم يدعو بهذا الدعاء ثلاث مرات:\n\n'
                  'اللّهُمَّ إنّي أَسْتَخيرُكَ لِعِلْمِكَ بِعاقِبَةِ الاَمُورِ، وَأَسْتَشيرُكَ لِحُسْنِ ظَنِّي بِكَ في المَأمُولِ وَالَمحْذُورِ، اللّهُمَّ إنْ كانَ الاَمْرُ الفُلاني مِمّا قَدْ نيطَتْ بِالبَرَكَةِ أَعْجازُهُ وَبَواديهِ وَحُفَّتْ بِالكَرامَةِ أَيّامُهُ وَلَياليهِ فَخِرْ لي اللّهُمَّ فيهِ خيرَةً تَرُدُّ شَمُوسَهُ ذَلولاً وَتَقْعَضُ أَيَّامَهُ سُرُوراً، اللّهُمَّ إمَّا أمْرٌ فَأئْتَمِرُ وَإمَّا نَهيٌ فَأنْتَهِي، اللّهُمَّ إنّي أسْتَخِيرُكَ بِرَحْمَتِكَ خِيرَةً في عافِيَةٍ.\n\n'
                  'ثم يقبض على قطعة من السبحة ويضمر حاجته فإن كان عدد تلك القطعة زوحا فهو افعل، وان كان فرداً فهو لا تفعل، أو بالعكس. أي إن كان زوجا فهو لا تفعل وإن كان فرداً فهو افعل، حسب ما يبني عليه المستخير من الأول.\n\n'
                  'أقول : تقعض (بالضاد المعجمة) أي تردّ وتعطف ونحن قد أوردنا صلاة الاستخارة ذات الرقاع وبعض أنواع الاستخارات وساعات الاستخارة في باب الصلوات فراجعها هناك، واعلم أنّ السيد ابن طاووس قال: إنّي ماوجدت حديثا صريحا أنّ الانسان يستخير لسواه لكن وجدت أحاديث كثيرة تتضمن الحثّ على قضاء حوائج الاخوان بالدّعوات وسائر التوسّلات حتى رأيت في الاخبار من فوائد الدعاء للاخوان، مالا أحتاج الى ذكره الان، لظهوره بين الاعيان والاستخارة هي من جملة الحاجات، ومن جملة الدعوات، واستخارة الانسان لغيره داخلة في عموم الاخبار الواردة بما ذكرناه لان الانسان إذا كلفه غيره من الاخوان لاستخارة له فقد صارت الحاجة للّذي يباشر الاستخارات فليستخير لنفسه أو للّذي يكلفه الاستخارة، أمّا استخارته لنفسه بأنّه هل المصلحة له في القول لمن يكلّفه الاستخارة إفعل أم لا ؟ وأما استخارته للّذي يكلّفه الاستخارة في الفعل أو الترك وهذا مما يدخل تحت عنوان الروايات بالاستخارات وبقضاء الحاجات، قال العلامة المجلسي رض ماذكره السيّد من جواز الاستخارة للغير لايخلو عن قوة للعمومات لاسيّما إذا قصد النائب لنفسه أن يقول للمستخير إفعل أم لا كما أومى إليه السيد هو حيله لدخولها تحت الاخبار الخاصة لكن الأولى والاحوط أن يستخير صاحب الحاجة لنفسه لانّا لم نر خبراً ورد فيه التوكيل في ذلك.\n\n'
                  'ولو كان ذلك جائزاً أو راجحا لكان الاصحاب يلتمسون من الأئمة ذلك. ولو كان ذلك لكان منقولاً، لا أقل في رواية مع أن المضطرّ أولى بالاجابة ودعاءه أقرب الى الخلوص. انتهى.',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: 'الثامن والعشرون :',
                  subtitle: 'عن النبي (صلّى الله عليه وآله وسلم) قال: من راى يهوديا أو نصرانيا أو مجوسيا فقال :\n\n'
                  'الحَمْدُ لله الَّذِي فَضَّلَنِي عَلَيْكَ بِالاسْلامِ دِينا وَبِالقُرْآنِ كِتابا وَبِمُحَمَّدٍ نَبِيّا وَبِعَلِيٍّ إماما وَبِالمُؤْمِنينَ إخْوانا وَبِالكَعْبَةِ قِبْلَةً.\n\n'
                  'لم يجمع الله بينه وبين الكفّار في جهنم.\n\n'
                  'أقول : يستفاد من آيات وأحاديث كثيرة أنّ المسلم عليه أن يجتنب عن مودّة الكفار، والتحابب والميل إليهم، والتشبّه بهم وسلوك طريقهم. قال الله تعالى: قَدْ كانَتْ لَكُمْ أُسْوَةٌ حَسَنَةٌ في إبْراهِيمَ وَالَّذِينَ مَعَهُ إذْ قالُوا لِقَوْمِهِمْ إنَّا بُرَأؤُاْ مِنْكُمْ وَمِمَّا تَعْبُدُونَ مِنْ دُونِ الله وَبَداً بَيْنَنا وَبَيْنَكُمْ العَداوَةُ وَالبَغْضاءُ أَبَداً.\n\n'
                  'وروى الصدوق عن الصادق (عليه السلام) قال : أوحى الله إلى نبي من الانبياء، قل للمؤمنين: لاتلبسوا لباس أعدائي ولا تطعموا مطاعم أعدائي ولا تسلكوا مسالك أعدائي فتكونوا أعدائي كما هم أعدائي. ولذلك نرى المنع في كثير من الاحاديث عن أعمال خاصّة اجتنابا عن التشبّه بالكفار.\n\n'
                  'كما روي عن النبي (صلّى الله عليه وآله وسلم) قال : حُفّوا الشوارب واعفوا اللحى ولا تتشبهوا بالمجوس واليهود.\n\n'
                  'وقال أيضا : إنّ المجوس جزّوا لحاهم ووفّروا شواربهم وإنّا نحن نجزّ الشوارب ونعفي اللحى، ولمّا بلغ دعوة النبي (صلّى الله عليه وآله وسلم) الملوك، كتب كسرى إلى عامل اليمن بأذان أن يبعث النبي (صلّى الله عليه وآله وسلم) إليه فبعث كاتبه بانويه ورجلاً آخر يقال له خرخسك إليه (صلّى الله عليه وآله وسلم)، وكانا قد دخلا على رسول الله (صلّى الله عليه وآله وسلم) وقد حلقا لحاهما وأعفيا شواربهما، فكره النظر إليهما وقال ويلكما من أمركما بهذا، قالا أمرنا بهذا ربنا ـ يعنيان كسرى ـ فقال رسول الله (صلّى الله عليه وآله وسلم): لكن ربي أمرني باعفاء لحيتي وقصّ شاربي، واعلم أن الله تعالى قال في سورة هود: وَلا تَرْكَنُوا إِلى الَّذِينَ ظَلَمُوا فَتَمَسَّكُمْ النَّارُ وَمَالَكُمْ مِنْ دُونِ الله مِنْ أَوْلِيَآءَ ثُمَّ لاتُنْصَرُونَ، وكلمة الركون فسرها المفسرون بالميل القليل فإذا كان هذا مقتضى الميل الخفيف فكيف الشديد منه، وقال بعضهم: إنّ الرّكون إليهم هو الدخول معهم في ظلمهم، واظهار الرضا بفعلهم، وإبداء الموالاة لهم. وروي عن أهل البيت (عليهم السلام) : إنّ الركون هو مودتهم ونصحهم وإطاعتهم.',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: 'التاسع والعشرون :',
                  subtitle: 'تسعة عشر حرفا تورث الفرج عن الداعي بها، علّمها رسول الله أمير المؤمنين صلوات الله عليهما، ورواها الصدوق في الخصال، في أبواب تسعة عشر قال: تقول:\n\n'
                  'ياعِمادَ مَنْ لا عِمادَ لَهُ وَياذُخْرَ مَنْ لا ذُخْرَ لَهُ وَياسَنَدَ مَنْ لاسَنَدَ لَهُ وَياحِرْزَ مَنْ لاحِرْزَ لَهُ وَياغِياثَ مَنْ لا غِياثَ لَهُ، وَيا كَرِيمَ العَفْوِ وَياحَسَنَ البَلاءِ وَياعَظِيمَ الرَّجاءِ وَياعِزَّ الضُّعَفاءِ وَيامُنْقِذَ الغَرْقى وَيامُنْجِيَ الهَلْكى، يامُحْسِنُ يامُجْمِلُ يامُنْعِمُ يا مُفْضِلُ، أَنْتَ الَّذِي سَجَدَ لَكَ سَوادُ الليْلِ وَنُورُ النَّهارِ وَضَوْءُ القَمَرِ وَشُعاعِ الشَّمْسِ وَدَوِيُّ الماءِ وَحَفِيفُ الشَّجَرِ، ياالله ياالله ياالله أَنْتَ وَحْدَكَ لاشَرِيكَ لَكَ.\n\n'
                  'ثم تقول : اللّهُمَّ افْعَلْ بِي كَذا وَكَذا وتذكر حاجتك فإنّك لاتقوم من مقامك إِلاّ وقد استجيب دعاؤك، إن شاء الله تعالى.',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: 'الثلاثون :',
                  subtitle: 'روى الكفعمي في كتاب (مفاتيح الغيب)، أنّه من كتب لفظة: بسم الله على بابه الخارج أمن من الهلاك وإن كان كافراً وذكر أن فرعون لم يهلكه الله سريعا وأمهله مع ادّعائه الربوبية، لانّه كتب: بسم الله على بابه الخارج وأوحى الله تعالى إلى موسى (عليه السلام) لما أراد سرعة هلاكه: أنت تنظر إلى كفره وأنا أنظر إلى ما كتبه على بابه.',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: 'الواحد والثلاثون :',
                  subtitle: 'روى الشيخ ابن فهد أنّه أخبر أبو الدرداء يوما، بأنّ حريقا أصاب داره، قال: لم يصبه الحريق ، فأخبره آخر بذلك فأجاب بجوابه إلى ثلاث مرات، ثم علم أنّه قد احترق ماجاوره من الدّور، وتفرّد داره بالسلامة من الحريق.\n\n'
                  'فسألوه كيف علمت أنّ دارك لم يصبه الحريق ؟ قال : لانّي سمعت رسول الله (صلّى الله عليه وآله وسلم) يقول : من دعا بهذا الدعاء صباحا لم يصبه ذلك اليوم سوء، ومن دعا به ليلاً لم يصبه سوء في تلك الليلة، وإنّي كنت قد دعوت به :\n\n'
                  'اللّهُمَّ أَنْتَ رَبِّي لا إلهَ إِلاّ أَنْتَ عَلَيْكَ تَوَكَّلْتُ وَأَنْتَ رَبُّ العَرْشِ العَظيمِ وَلا حَوْلَ وَلا قُوَّةَ إِلاّ بِالله العَلِيِّ العَظِيمِ، ماشاء الله كانَ وَمالَمْ يَشَاء لَمْ يَكُنْ أعْلَمُ أنَّ الله عَلى كُلِّ شَيٍ قَدِيرٌ وَأنَّ الله قَدْ أحاطَ بِكُلِّ شَيٍ عِلْما، اللّهُمَّ إنِّي أعُوذُ بِكَ مِنْ شَرِّ نَفْسِي وَمِنْ شَرِّ قَضاء السُّوءِ وَمِنْ شَرِّ كُلِّ ذِي شَرٍّ وَمِنْ شَرِّ الجنِّ وَالانْسِ وَمِنْ شَرِّ كُلِّ دابّةٍ أنْتَ آخِذٌ بِناصِيَتِها إنَّ رَبِّي عَلى صِراطٍ مُسْتَقِيمٍ.',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: 'الثاني والثلاثون :',
                  subtitle: 'روى الكليني وغيره عن الإمام جعفر الصادق أنّه علّم زرارة هذا الدعاء ليدعو به في غيبة الإمام (عليه السلام) وامتحان الشيعة :\n\n'
                  'اللّهُمَّ عَرِّفْنِي نَفْسَكَ فَإنَّكَ إنْ لَمْ تُعَرِّفْنِي نَفْسَكَ لَمْ أعْرِفْ نَبِيَّكَ اللّهُمَّ عَرِّفْنِي رَسُولَكَ فَإنَّكَ إنْ لَمْ تُعَرِّفْنِي رَسُولَكَ لَمْ أعْرِفْ حُجَّتَكَ، اللّهُمَّ عَرِّفْنِي حُجَّتَكَ فَإنَّكَ إنْ لَمْ تُعَرِّفْنِي حُجَّتَكَ ضَلَلْتُ عَنْ دِينِي.',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: 'الثالث والثلاثون :',
                  subtitle: 'في (عدّة الداعي) عن أمير المؤمنين (عليه السلام) قال: إذا أراد أحدكم النوم فليضع يده ليمنى تحت خده الايمن ويقول :\n\n'
                  'بِسْمِ الله وَضَعْتُ جَنْبِي لله عَلى مِلَّةِ إبْراهِيم وَدِينِ مُحَمَّدٍ صَلّى الله عَلَيْهِ وَآلِهِ وَوِلايَةِ مَنْ افْتَرَضَ الله طاعَتَهُ ماشَاءَ الله كانَ وَما لَمْ يَشَاءْ لَمْ يَكُنْ. فمن قال ذلك عند منامه حفظه الله من اللص المغير والهدم واستغفرت له الملائكة.',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: 'الرابع والثلاثون :',
                  subtitle: 'في (عدّة الداعي) أيضا : ان قراءة إنّا أنزلناه في ليلة القدر على مايدَّخره المر حرز له على ماروي عنهم (عليه السلام).',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: 'الخامس والثلاثون :',
                  subtitle: 'وروي أيضاً عن أمير المؤمنين (عليه السلام) قال: من قرأ مائة آية من القرآن من أي القرآن شاء، ثم قال : ياالله سبع مرات، فلو دعا على الصخرة لقلعها.',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: 'السادس والثلاثون :',
                  subtitle: 'وروي أيضاً عنه (عليه السلام) من قرأ قل هو الله أحد ثلاث مرات حين يأخذ مضجعه وكل الله به خمسين ألف ملك يحرسونه ليلته، وعن الصادق (عليه السلام) قال: من مضى به يوم فصلّى فيه خمس صلوات ولم يقرأ فيها ب‍‍(قل هو الله أحد) قيل له يا عبد الله لست من المصلين. وعنه (عليه السلام) أيضاً قال: من مضت له جمعة أي اسبوع ولم يقرأ فيها ب‍‍(قل هو الله أحد) ثم مات، مات على دين أبي لهب. وعنه (عليه السلام) أيضاً قال: من أصابه مرض أو شدّة، فلم يقرأ في مرضه أو في تلك الشدّة، قل هو الله أحد، فمات فيه فهو من أهل النار.',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: 'السابع والثلاثون :',
                  subtitle: 'أورد في (عدّة الداعي) أيضاً هذه الرّقية، لحفظ زرع البطيخ والخيار وغيرهما من أضرار الدود وغيره مما يفسدها من الحيوان، وصفتها أن يكتب على أربع قصبات أو على أربع رقع، فيضع الرقع في جوف القصبات ثم يضعها في الجوانب الاربع للمزرعة :\n\n'
                  'أيّها الدود أيّها الدَّوَابُّ وَالهَوامُّ وَالحَيْواناتُ أُخْرُجُوا مِنْ هذِهِ الارْضِ وَالزَّرْعِ إِلى الخَرابِ كَما خَرَجَ إبْنُ مَتَّى مِنْ بَطْنِ الحُوتِ، فَإنْ لَمْ تَخْرُجُوا أرْسَلْتُ عَلَيْكُمْ شُواظا مِنْ نارٍ وَنُحاسٍ فَلا تَنْتَصِرانِ. ألَمْ تَرَ إِلى الَّذِينَ خَرَجُوا مِنْ دِيارِهِمْ وَهُمْ اُلُوفٌ حَذَرَ المَوْتِ فَقالَ لَهُمْ الله مُوتوا فماتُوا. أُخْرُجْ مِنْها فَإنَّكَ رَجِيمٌ فَخَرَجَ مِنْها خائِفا يَتَرَقَّبُ سُبْحانَ الّذِي أسْرى بِعَبْدِهِ لَيْلاً مِنَ المَسْجِدِ الحَرامِ إِلى المَسْجِدِ الاقْصى كَأنَّهُمْ يَوْمَ يَرَوْنَها لَمْ يَلْبَثُوا إِلاّ عَشِيَّةً اوْ ضُحاها فَأخْرَجْناهُمْ مِنْ جَنَّاتٍ وَعُيُونٍ وَزُرُوعٍ وَمَقامٍ كَريمٍ وَنِعْمَةٍ كانُوا فِيها فاكِهِينَ فَما بَكَتْ عَلَيْهِمُ السَّماء وَالارْضُ وَما كانُوا مُنْظَرينَ. أُخْرُجْ مِنْها فَما يَكُونُ لَكَ أنْ تَتَكَبَّرَ فِيها فَاخرُجْ إنَّكَ مِنَ الصَّاغِرينَ. أُخْرُجْ مِنْها مَذْمُوما مَدْحُوراً فَلَنَأتِيَنَّهُمْ بِجُنُودٍ لاقِبَلَ لَهُمْ وَلَنُخْرِجَنَّهُمْ مِنْها أذِلَّةً وَهُمْ صاغِرُونَ.',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: 'الثامن والثلاثون :',
                  subtitle: 'روى السيد ابن طاووس عن الباقر (عليه السلام) إنّ من أصبح وهو متختم بالعقيق في يمناه فأدار فصّه إلى باطن كفّه قبل أن يقع نظره إلى أحد فنظر إليه وقرأ سورة : إنّا أنزلناه في ليلة القدر… إلى آخرها، ثم قال :\n\n'
                  'آمَنْتُ بِالله وَحْدَهُ لاشَريكَ لَهُ وَكَفَرْتُ بِالجِبْتِ وَالطَّاغُوتِ وَآمَنْتُ بِسِرِّ آلِ مُحَمَّدٍ وَعَلانِيَتِهِمْ وَظاهِرِهِمْ وَباطِنِهِمْ وَأوَّلِهِمْ وَآخِرِهِمْ.\n\n'
                  'فإذا فعل ذلك صانه الله عزَّ وجلَّ في يومه من كل ماينزل من السماء وما يعرج فيه، وما يلج في الارض وما يخرج منها وكان في حرز من الله وأحبّائه إلى الليل.',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: 'التاسع والثلاثون :',
                  subtitle: 'روى الكفعمي عن كتاب (جمع الشتات) عن الصادق (عليه السلام) إذا أردت أن تحدث عنا بحديث فأنساكه الشيطان فضع يدك على جبهتك وقل :\n\n'
                  'صَلّى الله عَلى مُحَمَّدٍ وَآلِ مُحَمَّدٍ اللّهُمَّ إنِّي أَسْأَلُكَ يامُذَكِّرَ الخَيْرِ وَفاعِلَهُ وَالامِرَ بِهِ ذَكِّرْنِي ما أنْسانِيهِ الشَّيْطانُ.\n\n'
                  'وفي كتاب (من لايحضره الفقيه) عن الصادق (عليه السلام) من كثر عليه السهو في الصلاة فليقل إذا دخل الخلا : بِسْمِ الله أعوذُ بِالله مِنَ الرِّجْسِ النَّجِسِ الخَبِيثِ الُمخْبِثِ الشَّيْطانِ الرَّجيمِ.\n\n'
                  'أقول : من شاء أن يقوي ذاكرته فليستعمل السواك وليصم وليقرأ القرآن لاسيما آية الكرسي وليدمن أكل الزبيب على الريق، ولا سيّما إحدى وعشرين حبة من الاحمر منه، فذلك ينفع للفهم والذهن والحفظ، ومما يورث الحفظ‍ أكل اللحم مما يلي العنق وأكل الحلوا والعسل والعدس وقيل إنّ ممّا جرب للحفظ أن يؤخذ من الكندر والسعد وسكر طبر زد أجزاء متساوية وتسحق ناعما ويستف كل يوم خمسة دراهم، يستعمل ثلاثة أيام ويقطع خمسة، وهكذا وليقل أيضاً كل يوم بعد فريضة الصبح قبل أن يتكلم: ياحَيُّ ياقَيُّومُ فلايَفُوتُ شَيْئاً عِلْمُهُ وَلايؤدُهُ، وليقرأ عقيب الصلوات دعاء: سُبْحانَ مَنْ لايَعْتَدِي عَلى أهْلِ مَمْلَكَتِهِ، وليصل أيضاً مارويناه في الباب الثاني من الصلاة لقوّة الذاكرة، وغير ذلك وليتجنب مايورث النسيان وهو أكل التفّاح الحامض والكزبرة الخضراء، والجبن وسؤر الفار، والبول في الماء الواقف وقراءة ألواح القبور، والمشي بين امرأتين، والقاء القملة الحية على الارض، وترك تقليم الاظفار وترك القيلولة، والاكثار من المعاصي وكثرة الهموم والاحزان في أمور الدنيا وكثرة الاشغال والعلائق والنظر إلى المصلوب والمرور بين القطار من الجمل.',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: 'الاربعون :',
                  subtitle: 'روى الشيخ ابن فهد عن الصادق صلوات الله عليه: إن كل دعاء لم يبدأ بالتمجيد فهو أبتر وإنما التمجيد ثم الثناء، قال الراوي : ماأدنى مايجزي من التمجيد قال قل:\n\n'
                  'اللّهُمَّ أنْتَ الأول فَلَيْسَ قَبْلَكَ شَيٌ وَأنْتَ الاخِرُ فَلَيْسَ بَعْدَكَ شَيٌ وَأنْتَ الظّاهِرُ فَلَيْسَ فَوْقَكَ شَيٌ وَأنْتَ الباطِنُ فَلَيْسَ دُونَكَ شَيٌ وَأَنْتَ العَزِيزُ الحَكِيمُ.',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
            ],
          ),
        ),
        bottomNavigationBar: AddCustomBottomNavigationBar(
          pushNext: FiBa3dMaYata3alakBelmawt.screenRoute,
          pushBack: AlmonajatBitalabAl7awa2ij.screenRoute,
          soud: 'https://cdn.jsdelivr.net/gh/SounaDiab/image_audio@master/audio/في اثر بعض السور والايات.mp3',
          onTap: (double fontSize) {
            // تحديث حجم الخط
            setState(() {
              isTablet ? _fontSizeTablet = fontSize : _fontSize = fontSize;
            });
            print('fontSize: $fontSize');
            // إغلاق Dialog
            Navigator.of(context).pop();
          },
          onLongPress: () {
            final snackBar = SnackBar(
              content: Center(
                child: Text(
                  '${isTablet ? _fontSizeTablet.toInt() : _fontSize.toInt()}',
                  style: TextStyle(
                    color: Colors.white,
                    fontSize: 16,
                  ),
                ),
              ),
              width: 60,
              behavior: SnackBarBehavior.floating,
              backgroundColor: Colors.blue,
              duration: Duration(seconds: 2),
              shape: ShapeBorder.lerp(
                RoundedRectangleBorder(
                  borderRadius: BorderRadius.circular(50),
                ),
                RoundedRectangleBorder(
                  borderRadius: BorderRadius.circular(50),
                ),
                1,
              ),
            );
            ScaffoldMessenger.of(context).showSnackBar(snackBar);
          },
        ),
      ),
    );
  }
}
