import 'package:flutter/material.dart';
import 'package:maktabat_almoslim/widgets/container_scrollview.dart';
import 'package:provider/provider.dart';
import 'package:shared_preferences/shared_preferences.dart';

import '../../../widgets/add_custom_bottom_navigation_bar.dart';
import '../../../widgets/list_of_nine_verses.dart';
import '../../favorites_provider.dart';
import '../../favorites_screen.dart';
import '../ala7raz_walad3iya_almoujaza.dart';
import 'dou3a2_alsajad_fi_zikr_altawba.dart';
import 'fi_asar_ba3d_sowar_walayat.dart';

class FiBa3dMaYata3alakBelmawt extends StatefulWidget {
  static String screenRoute = 'fi_ba3d_ma_yata3alak_belmawt_screen';
  const FiBa3dMaYata3alakBelmawt({super.key});

  @override
  State<FiBa3dMaYata3alakBelmawt> createState() =>
      _FiBa3dMaYata3alakBelmawtState();
}

double _fontSize = 18;
double _fontSizeTablet = 30;

class _FiBa3dMaYata3alakBelmawtState extends State<FiBa3dMaYata3alakBelmawt> {
  bool isIcon = true;
  @override
  void initState() {
    super.initState();
    _loadFavoriteState();
  }

  Future<void> _loadFavoriteState() async {
    final prefs = await SharedPreferences.getInstance();
    bool? savedState =
        prefs.getBool('isFavorite_fi_ba3d_ma_yata3alak_belmawt_screen');
    setState(() {
      isIcon = savedState ?? true;
    });
  }

  Future<void> _saveFavoriteState(bool value) async {
    final prefs = await SharedPreferences.getInstance();
    await prefs.setBool(
        'isFavorite_fi_ba3d_ma_yata3alak_belmawt_screen', value);
  }

  Future<bool> _onWillPop() async {
    final args =
        ModalRoute.of(context)!.settings.arguments as Map<String, dynamic>?;
    final previousPage = args?['previousPage'];
    if (previousPage == 'favorite_screen') {
      Navigator.of(context).pushReplacementNamed(FavoritesScreen.screenRoute);
      return false;
    } else {
      Navigator.of(context)
          .pushReplacementNamed(Ala7razWalad3iyaAlmoujaza.screenRoute);
      return false;
    }
  }

  @override
  Widget build(BuildContext context) {
    double size = MediaQuery.of(context).textScaleFactor;
    final screenWidth = MediaQuery.of(context).size.width;
    final isTablet = screenWidth >= 600;
    return WillPopScope(
      onWillPop: _onWillPop,
      child: Scaffold(
        appBar: AppBar(
          toolbarHeight: isTablet ? 100 : 50,
          centerTitle: true,
          leading: IconButton(
            onPressed: _onWillPop,
            icon: Icon(
              Icons.arrow_back,
              size: isTablet ? 50 : 25,
            ),
          ),
          actions: [
            IconButton(
              padding: EdgeInsets.only(left: isTablet ? 50 : 30),
              icon: Icon(
                isIcon ? Icons.favorite_border : Icons.favorite_rounded,
                size: isTablet ? 40 : 25,
                color: isIcon ? Colors.black : Colors.red,
              ),
              onPressed: () async {
                setState(() {
                  isIcon = !isIcon;
                });
                await _saveFavoriteState(isIcon);

                if (!isIcon) {
                  Provider.of<FavoritesProvider>(context, listen: false)
                      .addFavorite('في بعض مايتعلق بالموت من الاداب والادعية',
                          FiBa3dMaYata3alakBelmawt.screenRoute);
                } else {
                  Provider.of<FavoritesProvider>(context, listen: false)
                      .removeFavorite(
                          'في بعض مايتعلق بالموت من الاداب والادعية',
                          FiBa3dMaYata3alakBelmawt.screenRoute,
                          FiBa3dMaYata3alakBelmawt.screenRoute);
                }
              },
            ),
          ],
          title: Text(
            'في بعض مايتعلق بالموت من الاداب والادعية',
            style: TextStyle(
              fontSize: isTablet
                  ? 40
                  : size > 1.0
                      ? 20
                      : 23,
              fontWeight: FontWeight.bold,
            ),
          ),
        ),
        body: ContainerScrollview(
          widget: Column(
            crossAxisAlignment: CrossAxisAlignment.start,
            children: [
              Container(
                child: Column(
                  children: [
                    Center(
                      child: Text(
                        'بسم الله الرحمن الرحيم',
                        style: TextStyle(
                          fontSize: isTablet ? _fontSizeTablet : _fontSize,
                          fontWeight: FontWeight.w900,
                        ),
                      ),
                    ),
                    Center(
                      child: Text(
                        'اللهم صلِّ على محمد وآل محمد',
                        style: TextStyle(
                          fontSize: isTablet ? _fontSizeTablet : _fontSize,
                          fontWeight: FontWeight.w900,
                        ),
                      ),
                    ),
                  ],
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: '',
                  subtitle:
                      'إعلم أنه إذا بان على المر إمارات الموت، فأوّل من عليه أن يهتم لذلك هو نفسه حيث أنّه يستقبل سفراً لايؤوب منه، هو السفر إلى دار الاخرة ويحتاج فيه من الزاد إلى مايناسب السفر فأول ما يجب عليه هو الاقرار بالذّنب، والاعتراف بالتقصير والندامة عمّا سلف والتوبة الكاملة، والبكاء والتضرّع إلى جناب قدس الله، كي يغفر له ماسلف من ذنوبه، ولا يكله إلى نفسه ولا إلى غيره، فيما يستقبله من الاحوال والاهوال ثم ليلتفت إلى الوصية، فيؤدي بنفسه مافي ذمّته من حقوق الله أو حقوق خلقه، ولايتوكل على غيره فالمال سيخرج من يده فيرنو إليه متحسّراً، وشياطين الجن والانس يوسوسون في صدر الوارثين صادين عن إبراء ذمّته، وليس له من حيلة فيقول: أرجعوني لعلي أعمل صالحا فيما تركت فلا يسمع منه ذلك ولاتنفعه الحسرة والندامة ثم ليوص بثلث ماله لاقاربه، وللصدقات والخيرات مما يناسب حاله فليس له أكثر من الثلث ثم ليستبري إخوانه المؤمنين ويستحلّ ممّن اغتابه أو أهانه أو اَّذاه إذا كان حاضراً، ويلتمس إخوانه المؤمنين أن يستحلّوا له ويستبرئوا لذمّته إذا لم يحضر، ثم يعيّن قيّمه على أولاده الصغار، ويكل إلى من يأتمنه أمور أطفاله وعياله، بعد التوكل على جناب قدس الله ، ثم يهيّ كفنه ويطلب أن يكتب عليه بتربة الحسين (عليه السلام) مالم تسعه هذه الرسالة من الاذكار والادعية والايات الواردة في الكتب المبسوطة هذا إذا كان قد اغفل من قبل فلم يعد الكفن، فالمؤمن عليه ان يكون كفنه حاضراً لديه دائماً، كما روي عن الصادق (عليه السلام) قال :\n\n'
                      'من كان كفنه في بيته لم يكتب من الغافلين، وكان مأجوراً كلّما نظر إليه، وينبغي أن لايفكّر بعد في عياله وأولاده وأمواله وأن يلتفت الى جناب قدس الله فيجعله على ذكر منه وليفكر في أنّ الامور الفانية هذه هي مما لا تنفعه نفعاً ولايغنيه في دنياه وآخرته سوى لطف الله ورحمته فإذا اتكل على الله جرت شؤون أهل بيته في أحسن مجاريها.\n\n'
                      'وليعلم أنه نفسه لو ظلَّ حيا فلا يستطيع أن ينفعهم نفعا، أو يدفع عنهم ضرراً إِلاّ أن يشاء الله وأن الله الذي خلقهم هو أرأف بهم منه، وعليه أن يكون راجيا آملاً يرجو رحمة ربّه رجاءا ويأمل في شفاعة النبي (صلّى الله عليه وآله وسلم) والأئمة المعصومين (عليه السلام) أملاً عظيماً وينتظر قدومهم وليعلم أنهم أجمعين يحضرون عند الموت ويبشرون شيعتهم بالبشائر، ويوصون ملك الموت بالوصايا.\n\n'
                      'وقال الشيخ الطوسي في (مصباح المتهجد) : يستحب للانسان الوصية وأن لا يخلّ بها إنسان، فإنّه روي أنّه ينبغي أن لا يبيت الانسان إِلاّ ووصيّته تحت رأسه، ويتأكد ذلك في حال المرض ويحسّن وصيته ويخلّص نفسه فيما بينه وبين الله تعالى من حقوقه ومظالم العباد. فقد روي عن النبي (صلّى الله عليه وآله وسلم) أنه قال من لم يحسن الوصيّة عند موته كان ذلك نقصا في عقله ومروّته، قالوا: يارسول الله (صلّى الله عليه وآله وسلم) وكيف الوصية ؟ قال: إذا حضرته الوفاة واجتمع الناس إليه قال:\n\n'
                      'اللّهُمَّ فاطِرَ السَّماواتِ وَالارْضِ عالِمَ الغَيْبِ وَالشَّهادَةِ الرَّحْمنَ الرَّحِيمَ، إنِّي أعْهَدُ إلَيْكَ أنِّي أشْهَدُ أنْ لا إلهَ إِلاّ الله وَحْدَهُ لاشَريكَ لَهُ، وَأنَّ مُحَمَّداً صَلّى الله عَلَيْهِ وَآلِهِ عَبْدُهُ وَرَسُولُهُ ، وَأنَّ السَّاعَةَ آتِيَةٌ لارَيْبَ فِيها، وَأنَّ الله يَبْعَثُ مَنْ فِي القُبُورِ، وَأنَّ الحِسابَ حَقُّ وَأنَّ الجَنَّةَ حَقُّ وَأنَّ ما وُعِدَ فِيها مِنَ النَّعيمِ مِنَ المَأْكَلِ وَالْمَشْرَبِ وَالنِّكاحِ حَقُّ وَأنَّ النَّارَ حَقُّ وَأنَّ الايْمانَ حَقُّ، وَأنَّ الدِّينَ كَما وَصَفَ وَأنَّ الاسْلامَ كَما شَرَعَ وَأنَّ القَوْلَ كَما قالَ وَأنَّ القُرْآنَ كَما أُنْزِلَ وَأنَّ الله هُوَ الحَقُّ المُبِينُ، وَأَنِّي أعْهَدُ إلَيْكَ فِي دارِ الدُّنْيا أنِّي رَضِيتُ بِكَ رَبَّا وَبِالاسْلامِ دِينا وَبِمُحَمَّدٍ صَلّى الله عَلَيْهِ وَآلِهِ نَبِيَّا وَبِعَلِيٍّ وَلَيَّا وَبِالقُرْآنِ كِتابا، وَأنَّ أهْلَ بَيْتِ نَبِيِّكَ عَلَيْهِ وَعَلَيْهِمْ السَّلامُ أَئِمَتِي. اللّهُمَّ أنْتَ ثِقَتِي عِنْدَ شِدَّتِي وَرَجائِي عِنْدَ كُرْبَتي وَعِدَّتِي عِنْدَ الاُمُورِ الَّتي تَنْزِلُ بِي وَأنْتَ وَلِيِّي فِي نِعْمَتي وَالهي وَإلهُ آبائِي صَلِّ عَلَى مُحَمَّدٍ وَآلِهِ وَلا تَكِلْني إِلى نَفْسِي طَرْفَةَ عَيْنٍ أَبَداً وَاَّنِسْ فِي قَبْرِي وَحْشَتِي وَاجْعَلْ لِي عِنْدَكَ عَهْداً يَوْمَ ألْقاكَ مَنْشُوراً.\n\n'
                      'فهذا عهد الميت يوم يوصي بحاجته، والوصيّة حق على كل مسلم. قال الصادق (صلوات الله وسلامه عليه) : وتصديق هذا في سورة مريم قول الله تبارك وتعالى: لايَمْلِكُونَ الشَّفاعَةَ إِلاّ مَنِ اتَّخَذَ عِنْدَ الرَّحْمنِ عَهْداً.\n\n'
                      'وقال النبي (صلّى الله عليه وآله وسلم) لعلي (عليه السلام): تعلّمها أنت وعلّمها أهل بيتك وشيعتك قال: وقال النبي (صلّى الله عليه وآله وسلم): علّمنيها جبرائيل (عليه السلام)، ثم قال الشيخ: نسخة الكتاب الذي يوضع عند الجريدة مع الميت يقول قبل أن يكتب:\n\n'
                      'بِسْمِ الله الرَّحْمنِ الرَّحيمِ\n\n'
                      'أشْهَدُ أنْ لا إلهَ إِلاّ الله وَحْدَهُ لاشَريكَ لَهُ وَأشْهَدُ أنَّ محمَّداً عَبْدُهُ وَرَسُولُهُ صَلّى الله عَلَيْهِ وَآلِهِ، وَأنَّ الجَنَّةَ حَقُّ وَأنَّ النَّارَ حَقُّ وَأنَّ السَّاعَةَ آتِيَةٌ لارَيْبَ فِيها وَأنَّ الله يَبْعَثُ مَنْ فِي القُبُورِ.\n\n'
                      'ثم يكتب : بِسْمِ الله الرَّحْمنِ الرَّحيمِ شَهِدَ الشُّهُودُ المُسَمَّونَ فِي هذا الكِتابِ أنَّ أخاهُمْ فِي الله عَزَّ وَجَلْ (فلان بن فلان) ويذكر اسم الرجل: أشْهَدَهُمْ وَاسْتَوْدَعَهُمْ وَأقَرَّ عِنْدَهُمْ أَنَّهُ يَشْهَدُ أنْ لا إلهَ إِلاّ الله وَحْدَهُ لاشَريكَ لَهُ وَأَنَّ مُحَمَّداً صَلّى الله عَلَيْهِ وَآلِهِ عَبْدُهُ وَرَسُولُهُ، وَأَنَّهُ مُقِرُّ بِجَميعِ الأَنْبِياءِ وَالرُّسُلِ عَلَيْهِمْ السَّلامُ، وَأَنَّ عَلِيَّاً وَلِيُّ الله وَإمامُهُ وَأنَّ الأَئِمَّةِ مِنْ وِلْدِهِ أَئِمَّتُهُ وَأنَّ أوَّلَهُمُ الحَسَنُ وَالحُسَيْنُ وَعَلِيُّ بْنُ الحُسَيْنِ وَمُحَمَّدُ بْنُ عَلِيٍّ وَجَعْفَرُ بْنُ مُحَمَّدٍ وَمُوسى بْنُ جَعْفَرٍ وَعَلِيُّ بْنُ مُوسَى وَمُحَمَّدُ بْنُ عَلِيٍّ وَعَلِيُّ بْنُ مُحَمَّدٍ وَالحَسَنُ بْنُ عَلِيٍّ وَالقائِمُ الحُجَّةُ عَلَيْهِمُ السَّلامُ، وَأنَّ الجَنَّةَ حَقُّ وَالنَّارَ حَقُّ وَالسَّاعَةَ آتِيَةٌ لاَ رَيْبَ فِيها وَأنَّ الله يَبْعَثُ مَنْ فِي القُبُورِ، وَأنَّ مُحَمَّداً صَلّى الله عَلَيْهِ وَآلِهِ عَبْدُهُ وَرَسُولُهُ جاءَ بِالحَقِّ، وَأنَّ عَلِيَّا وَلِيُّ الله وَالخَلِيفَةُ مِنْ بَعْدِ رَسُولِ الله صَلّى الله عَلَيْهِ وَآلِهِ وَمُسْتَخْلَفُهُ فِي أمَّتِهِ مُؤَدِّيا لامِرِ رَبِّهِ تَبارَكَ وَتَعالى، وَأنَّ فاطِمَةَ بِنْتُ رَسُولِ الله وَابْنَيْها الحَسَنَ وَالحُسَيْن ابْنا رَسُولِ الله وَسِبْطاهُ وَإماما الهُدى وَقائِداً الرَّحْمَةِ، وَأنَّ عَلِيَّاً وَمُحَمَّداً وَجَعْفَراً وَمُوسَى وَعَلِيَّاً وَمُحَمَّداً وَعَلِيَّاً وَحَسَناً وَالحُجَّةَ عَلَيْهِمُ السَّلامُ أئِمَّةٌ وَقادَةٌ وَدُعاةٌ إِلى الله جَلَّ وَعَلا وَحُجَّةٌ عَلَى عِبادِهِ.\n\n'
                      'ثم يقول : ياشهود فلان بن فلان المسمّمين في هذا الكتاب اثبتوا لي هذه الشهادة عندكم حتى تلقوني بها على الحوض.\n\n'
                      'ثم يقول الشهود : يافُلانُ نَسْتَودِعُكَ الله ، وَالشَّهادَةُ وَالاقْرارُ وَالاخاءُ مَوْدُوَعَةٌ عِنْدَ رَسُولِ الله صَلّى اللّهُ عَلَيْهِ وَآلِهِ، وَنَقْرَأ عَلَيْكَ السَّلامَ وَرَحْمَةُ الله وَبَرَكاتُهُ.\n\n'
                      'ثم تطوي الصحيفة وتطبع ولتختم بخاتم الشهود وخاتم الميّت وتوضع على يمين الميت مع الجريدة وتكتب الصحيفة بكافور وعلى عود جهته غير مطيّب، وينبغي إذا حضره الموت أن يستقبل بباطن قدميه القبلة ويكون عنده من يقرأ من القرآن سورة يَّس والصافات ويذكر الله تعالى ويلقَّن الميت بالشهادتين والاقرار بالأئمة (عليهم السلام) واحداً واحداً ويلقّن كلمات الفرج وهي :\n\n'
                      'لا إلهَ إِلاّ الله الحَلِيمُ الكَريمُ لا إلهَ إِلاّ الله العَلِيُّ العَظيمُ، سُبْحانَ الله رَبِّ السَّماواتِ السَبْعِ وَرَبِّ الارَضِينَ السَّبْعِ وَمافِيهِنَّ وَمابَيْنَهُنَّ وَماتَحْتَهُنَّ وَرَبِّ العَرْشِ العَظِيم، وَالحَمْدُ لله رَبِّ العالَمين وَالصَّلاةُ عَلى مُحَمَّدٍ وَآلِهِ الطَّيِّبِينَ.\n\n'
                      'ولا يحضره جنب ولا حائض فإذا قضى نحبه غمضت عيناه ومُدّت يداه ويطبق فوه، وتمدّ ساقاه، ويشدّ لحياه ويؤخذ في تحصيل أكفانه، فيحصل له من الاكفان المفروضة ثلاث قطع: مئزر وقميص وإزار ويستحب أن يضاف إلى ذلك حبرة يمنيّة (وهي ثوب يستورد من اليمن) أو إزار آخر وخرقة خامسة يشدّ بها فخذاه ووركه ويستحبّ أن تجعل له عمامه زائدة على ذلك ويحصل له شي من الكافور الذي لم تمسّه النار وأفضله ثلاثة عشر دراهما وثلث درهم وأوسطه أربعة مثاقيل، وأقلّه درهم، فإن تعذّر فما سهل وينبغي أن يكتب على الاكفان كلها، أي كل واحد منها :\n\n'
                      'فُلانُ يَشْهَدُ أنْ لا إلهَ إِلاّ الله وَحْدَهُ لاشَرِيكَ لَهُ وَأَنَّ مُحَمَّداً رَسُولُ الله وَأنَّ عَلِيّاً أميرُ المُؤْمِنِينَ وَالأَئِمَّةِ مِنْ وُلْدِهِ، ويكتب أسماء الأئمة كلها ثم يكتب: أئمته أئمة الهُدى الابرار، ويكتب ذلك بتربة الحسين (عليه السلام) أو بالاصبع ولا يكتب بالسواد. ويغسّل الميث ثلاثة أغسال أوّلها بماء السّدر، والثاني بماء الكافور، والثالث بماء القراح. وكيفية غسله مثل غسل الجنابة سواء، يبدأ أولاً فيغسل يدي الميت ثلاث مرات ثم ينجيه بقليل من الاشنان ثلاث مرات، ثم يغسل رأسه برغوة السّدر ثلاث مرات، ثم جانبه الايمن ثم الايسر مثل ذلك، ويمرّ يده على جميع جسده، كل ذلك بماء السّدر، ثم يغسل الاواني ويطرح ماء آخر ويطرح فيه قليلاً من الكافور، ثم يغسله بماء الكافور، ومثل ذلك على السواء ويقلّب بقيّة الماء ويغسل الاواني، ثم يطرح الماء القراح ويغسله الغسلة الثالثة مثل ذلك سواء ويقف الغاسل على جانبه الايمن، يقول كلما غسل منه شَيْئاً : عفوا عفوا، فاذا فرغ نشفه بثوب نظيف ويغتسل الغاسل فرضا، إما في الحال، أو فيما بعد، ويستحب تقديم الوضؤ على الغسلات. ثم يكفنه فيعمد الخرقة التي هي الخامسة فيبسطها ويضع عليها شَيْئاً من القطن وينثر عليها شَيْئاً من الذّريرة ويضعه على فرجيه قبله ودبره، ويحشي دبره بشي من القطن، ثم يستوثق بالخرقة إليتيه وفخذيه شداً وثيقا، ثم يؤزره من سرته إلى حيث يبلغ المئزر، ويلبسه القميص وفوق القميص الازار، وفوق الازار الحبرة، أو ما يقوم مقامها، ويضع معه جريدتين من النخل أو من شجر غيره، ولتكونا رطبتين، ومقدارهما مقدار عظم‌الذراع، يضع واحدة منهما من الجانب الايمن، يلصقها بجلده من عند حقوه، والاخر من الجانب الايسر بين القميص والازار، ويضع الكافور على مساجده، جبهته وباطن كفيه وركبتيه وأطراف أصابع رجليه، فإن فضل منه شي جعله على صدره، ويرد عليه اللّفافة ويعقدها من ناحية رأسه ورجليه إلى أن يدفنه فإذا دفنه حلّ عنه عقد أكفانه ثم يحمل على سريره إلى المصلّى ثم يصلّي عليه.\n\n'
                      'وقال العلامة المجلسي رض في (زاد المعاد) في باب صلاة الميت ماملخصه : إنّ صلاة الميت فرض على كل مسلم علم بموت أحد فإذا قام بها احد المسلمين سقط عن الباقين وتجب الصلاة على كل شيعي إثنى عشري بالغ بلا خلاف، والاشهر الاقوى أنّها تجب أيضاً على غير البالغ، إذا تم الست سنين من العمر والظاهر كفاية قصد القربة فيها والصلاة على الطفل الذي لم يبلغ الستّة أشهر إذا كان قد ولد حيّا مسنونة لدى البعض وبدعة عند البعض والاحوط‍ ترك الصلاة عليه وأحق الناس بالصلاة على الميت أولاهم بميراثه على المشهور والزوج أحقّ بالصلاة على زوجته ويجب أن يستقبل المصلّي القبلة ويكون رأس الميت إلى جانبه الايمن، وأن يكون الميّت مستلقيا على قفاه ولا يشترط في هذه الصلاة الطهارة من الحدث وتصح من الجنب والحائض وغير المتوضي ويستحب أن يكون متوضئاً فإن لم يتيسر الماء أو كان يمنعه عن استعماله مانع أو ضاق الوقت عن استعماله فالمسنون التيمّم وظاهر بعض الاحاديث استحباب التيمّم من دون عذر عن الوضؤ والمسنون أن يقف المصلي عند وسط الرجل وصدر المرأة على المشهور وأن ينزع المصلّي حذاءه ويجب أن ينوي صلاة الميت فيكبّر خمس تكبيرات ومن المسنون أن يرفع عند كل تكبيرة يديه إلى حذاء أذنيه ويقول على المشهور بعد التكبيرة الأولى :\n\n'
                      'أشْهَدُ أنْ لا إلهَ إِلاّ الله وَأشْهَدُ أنَّ مُحَمَّداً رَسُولُ اللّه. وبعد التكبيرة الثانية : اللّهُمَّ صَلِّ عَلى مُحَمَّدٍ وَآلِ مُحَمَّدٍ. وبعد التكبيرة الثالثة : اللّهُمَّ اغْفِرْ لِلْمُؤْمِنِينَ وَالمُؤْمِناتِ. وبعد التكبيرة الرابعة : اللّهُمَّ اغْفِرْ لِهذا المَيِّتِ. ثم يكبر الخامسة وينصرف والصلاة بهذه الصفة مجزية.\n\n'
                      'والافضل على المشهور أن يقول بعد مانوى :\n\n'
                      'الله أكْبَرُ أشْهَدُ أنْ لا إلهَ إِلاّ الله وَحْدَهُ لاشَريكَ لَهُ وَأشْهَدُ أنَّ مُحَمَّداً عَبْدُهُ وَرَسُولُهُ أرْسَلَهُ بِالحَقِّ بَشيراً وَنَذيراً بَيْنَ يَدَي السَّاعَةِ.\n\n'
                      'ثم يقول: الله أكْبَرُ اللّهُمَّ صَلِّ عَلى مُحَمَّدٍ وَآلِ مُحَمَّدٍ وَبارِكْ عَلى مُحَمَّدٍ وَآلِ مُحَمَّدٍ وَارْحَمْ مُحَمَّداً وَآلَ مُحَمَّدٍ كَأَفْضَلِ ماصَلَّيْتَ وَبارَكْتَ وَتَرَحَّمْتَ عَلى إبْراهِيمَ وَآلِ إبْراهِيمَ إنَّكَ حَميدٌ مَجِيدٌ، وَصَلِّ عَلى جَمِيعِ الأَنْبِياءِ وَالمُرْسَلينَ.\n\n'
                      'ثم يقول : الله أكْبَرُ اللّهُمَّ اغْفِرْ لِلْمُؤْمِنِينَ وَالمُؤْمِناتِ وَالمُسْلِمِينَ وَالمُسْلِماتِ الاحْياءِ مِنْهُمْ وَالامْواتِ، وَتَابِعِ اللّهُمَّ بَيْنَنا وَبَيْنَهُمْ بِالخَيْراتِ إنَّكَ مُجِيبُ الدَّعَواتِ إنَّكَ عَلى كُلِّ شَيٍ قَديرٌ.\n\n'
                      'ثم يقول : الله أكْبَرُ اللّهُمَّ إنَّ هذا عَبْدُكَ وَابْنُ عَبْدِكَ وَابْنُ أمَتِكَ نَزَلَ بِكَ وَأنْتَ خَيْرُ مَنْزُولٍ بِهِ اللّهُمَّ إنَّا لانَعْلَمُ مِنْهُ إِلاّ خَيْراً وَأنْتَ أعْلَمُ بِهِ مِنَّا، اللّهُمَّ إنْ كانَ مُحْسِناً فَزِدْ فِي إحْسانِهِ، وَإنْ كانَ مُسيئا فَتَجاوَزْ عَنْهُ وَاغْفِرْ لَهُ، اللّهُمَّ اجْعَلْهُ عِنْدَكَ فِي أعْلَى عِلِّيِّينَ وَاخْلُفْ عَلى أهْلِهِ فِي الغابِرِينَ وَارْحَمْهُ بِرَحْمَتِكَ ياأرْحَمَ الرَّاحِمينَ. ثم يقول: الله أكْبَرُ وينصرف.\n\n'
                      'وإذا كان الميّت انثى قال المصلي : اللّهُمَّ إنَّ هذِهِ أمَتُكَ وَابْنَةُ عَبْدِكَ وَابْنَةُ أمَتِكَ نَزَلَتْ بِكَ وَأنْتَ خَيْرُ مَنْزُولٍ بِهِ ؛ اللّهُمَّ إنَّا لانَعْلَمُ مِنْها إِلاّ خَيْراً وَأنْتَ أعْلَمُ بِها مِنَّا، اللّهُمَّ إنْ كانَتْ مُحْسِنَةٍ فَزِدْ فِي إحْسانِها وَإنْ كانَتْ مُسَيئةً فَتَجاوَزْ عَنْها وَاغْفِرْ لَها، اللّهُمَّ اجْعَلْها عِنْدَكَ فِي أعْلَى عِلِّيِّينَ وَاخْلُفْ عَلى أهْلِها فِي الغابِرِينَ وَارْحَمْها برَحْمَتِكَ ياارْحَمَ الرَّاحِمِينَ.\n\n'
                      'وإن كان الميت مستضعفا قال : اللّهُمَّ اغْفِرْ لِلَّذِينَ تابُوا وَاتَّبَعُوا سَبِيلَكَ وَقِهِمْ عَذابَ الجَحِيم. وإن كان الميت طفلاً غير بالغ قال: اللّهُمَّ اجْعَلْهُ لاَبَوَيْهِ وَلَنا سَلَفا وَفَرَطا وَأَجْراً. ومن المسنون أن يقف المصلّي لاسيما الإمام في مكانه حتى ترفع الجنازة. وفي الحديث تقول إذا فرغت من الصلاة: رَبَّنا اَّتِنا فِي الدُّنْيا حَسَنَةً وَفِي الاخِرَةِ حَسَنَةً وَقِنا عَذابَ النَّارِ.\n\n'
                      'وروي عن الصادق (صلوات الله وسلامه عليه) أنه يستحب إعلام الاخوان المؤمنين بالموت، ليحضروا جنازته ويصلّوا عليه ويستغفروا له، فيثاب الميت ويثابوا. وفي حديث حسن عن الصادق (عليه السلام) قال: إن المؤمن إذا أدخل قبره ينادى : ألا إنّ أوّل حبائك الجنّة وأوّل حباء من تبعك المغفرة. وقال في حديث آخر : أوّل تحفة المؤمن في قبره أن يغفر لمن تبع جنازته. وقال في حديث آخر: من تبع جنازة مؤمن حتى يدفن وكل الله عليه يوم القيامة سبعين ملكاً يشيعونه ويستغفرون له من القبر الى موقف الحساب، وقال من أخذ بقائمة السرير غفر الله له خمسا وعشرين كبيرة، فإذا ربّع خرج من الذنوب، وينبغي أن يحمل السرير أربعة رجال والافضل للمشيّع أن يبدأ بحمل الميّت من طرف يده اليمنى الواقع إلى يسار السرير، ثم يحمله من جانب الرجل اليمنى، ثم يدور خلف الجنازة فيحمل جانب الرجل اليسرى على العاتق الايسر، ثم جانب اليد اليسرى على العاتق الايسر، فإذا أراد أن يربع ثانيا فليجانب المرور أمام الجنازة بل يدور من خلفها، فيبدأ في التربيع من جانب اليد اليمنى كما صنع أوّلاً، وهذه الطريقة في التربيع معاكسة لمذهب أكثر العلماء، حيث ذهبوا إلى أنّ التربيع يبدأ بحمل الجانب الايمن من مقدّم السرير ثم الايمن من مؤخره ثم الايسر منه ثم الايسر من مقدّمه.\n\n'
                      'والطريقة الأولى هي الموافقة للاحاديث المعتبرة، والأولى العمل بالطريقتين والافضل أن يكون مشي المشيع خلف الجنازة أو إلى أحد جانبيها لا مقدما عليها، وظاهر أكثر الاحاديث أنّه يحسن المشي أمام جنازة المؤمن ولايحسن أمام جنازة المخالف في المذهب، فإن الملك تستقبلها بالعذاب. ويكره التشييع راكبا. وعن النبي (صلّى الله عليه وآله وسلم) أن من رأى جنازة فقال :\n\n'
                      'الله أكْبَرُ هذا ماوَعَدَنا الله وَرَسُولُهُ وَصَدَقَ الله وَرَسُولُهُ، اللّهُمَّ زِدْنا إيْمانا وَتَسْلِيماً الحَمْدُ لله الَّذِي تَعَزَّزَ بِالقُدْرَةِ وَقَهَرَ العِبادَ بِالمَوْتِ، لم يبق في السماء ملك إِلاّ بكى رحمة له. وعن الصادق (عليه السلام) قال: يقول من يحمل الجنازة :\n\n'
                      'بَسْمِ الله وَبِالله اللّهُمَّ صَلِّ عَلى مُحَمَّدٍ وَآلِ مُحَمَّدٍ وَاغْفِرْ لِلْمُؤْمِنِينَ وَالمُؤْمِناتِ.\n\n'
                      'وروي عن الإمام زين العابدين (عليه السلام) أنّه كان إذا رأى جنازة يقول :\n\n'
                      'الحَمْدُ لله الَّذِي لَمْ يَجْعَلْنِي مِنَ السَّوادِ الُمخْتَرَمِ.\n\n'
                      'وليس من المسنون للمرأة أن تشيّع جنازة، ويكره لمن حضر الجنازة أن يضحك أو يتكلم بالباطل. وقال العلامة المجلسي رض أيضاً في كتاب (الحلية) : روي عن النبي (صلّى الله عليه وآله وسلم) قال : من صلّى على ميّت صلّى عليه سبعون ألف ملك، وغفر الله له ماتقدّم من ذنبه وما تأخّر فإن أقام حتّى يدفن ويحثى عليه التراب، كان له بكل قدم نقلها قيراط من الاجر. والقيراط مثل جبل أحد.\n\n'
                      'وقال في حديث آخر : أيّما مؤمن صلّى على جنازة وجبت له الجنة إِلاّ إذا كان منافقاً أو عاقّاً لوالديه. وروي بسند معتبر عن الصادق صلوات الله عليه أنّه إذا مات المؤمن فحضر جنازته أربعون من المؤمنين وقالوا: اللّهُمَّ إنَّا لانَعْلَمُ مِنْهُ إِلاّ خَيْراً وَأنْتَ أعْلَمُ بِهِ مِنَّا قال الله تعالى: قبلت شهادتكم وغفرت له مالم تعلموه وعلمته.\n\n'
                      'وفي حديث معتبر آخر عن النبي (صلّى الله عليه وآله وسلم) قال : أوّل عنوان صحيفة المؤمن بعد موته مايقول الناس فيه: إن خيراً فخيراً وإن شراً فشراً.\n\n'
                      'أقول : قال الشيخ الطوسي في (مصباح المتهجد) ويستحب تربيع الجنازة بأن يأخذ جانبها الايمن، ثم رجلها اليمنى، ثم رجلها اليسرى، ثم منكبها الايسر (يحمل بهذه الكيفية الجوانب الاربع للسرير) يدور خلفها دور الرّحى، فإذا جي بها إلى القبر ترك جنازة الرجل مما يلي رجلي القبر، ويقدم إلى شفير القبر في ثلاث دفعات وإن كانت جنازة امرأة تركت قدّام القبر مما يلي القبلة ثم ينزل إلى القبر وليّ الميت أو من يأمره الولي ويكون نزوله من عند رجلي القبر ويقول: اللّهُمَّ اجْعَلْها رَوْضَةً مِنْ رِياضِ الجَنَّةِ وَلا تَجْعَلْها حُفْرَةً مِنْ حُفَرِ النَّارِ.\n\n'
                      'وينبغي أن ينزل القبر حافيا مكشوف الرأس محلول الأزرار ثم يتناول الميت فيه فيبدأ برأسه فيأخذه وينزل به القبر ويقول: بَسْمِ الله وَبِالله وَفِي سَبيلِ الله وَعَلى مِلَّةِ رَسُولِ الله اللّهُمَّ إيْمانا بِكَ وَتَصْدِيقا بِكِتابِكَ هذا ماوَعَدَنا الله وَرَسُولُهُ وَصَدَقَ الله وَرسُولُهُ اللّهُمَّ زِدْنا إيْمانا وَتَسْلِيماً، ثم يضجعه على جانبه الايمن ويستقبل بوجهه القبلة ويحلّ عقد أكفانه من قبل راسه ورجليه ويضع خدّه على التراب ويستحبّ أن يجعل معه شَيْئاً من تربة الحسين (عليه السلام) ثم يشرج عليه اللبن ويقول من يشرجه: اللّهُمَّ صِلْ وَحْدّتَهُ وَآنِسْ وَحْشَتَهُ وَارْحَمْ غُرْبَتَهُ وَأسْكِنْ إلَيْهِ مِنْ رَحْمَتِكَ رَحْمَةً يَسْتَغْنِي بِها عَنْ رَحْمَةِ مَنْ سِواكَ وَاحْشُرْهُ مَعَ مَنْ كانَ يَتَوَلاهُ مِنَ الائِمَّةِ الطّاهِرينَ، ويستحب أن يلقن الميت الشهادتين، وأسماء الأئمة (عليهم السلام) عند وضعه في القبر قبل تشريج اللبن عليه فيقول الملقن: يافلان بن فلان ويذكر اسم الميت واسم ابيه :\n\n'
                      'اذْكُرِ العَهْدَ الَّذِي خَرَجْتَ عَلَيْهِ مِنْ دارِ الدُّنْيا شَهادَةَ أنْ لا إلهَ إِلاّ الله وَحْدَهُ لاشَريكَ لَهُ، وَأنَّ مُحَمَّداً عَبْدُهُ وَرَسُولُهُ، وَأنَّ عَلَيَّاً أَميرُ المُؤْمِنِينَ وَالحَسَنَ وَالحُسَيْنَ ويذكر الأئمة (عليهم السلام) واحداً واحداً إلى آخرهم أئمَّتُكَ أئمَّةُ الهُدَى الابْرارُ، فإذا فرغ من تشريج اللبن عليه أهال التراب عليه، ويهيل كل من حضر استحبابا بظهور أكفهم ويقولون عند ذلك : إنَّا لله وَإنَّا إلَيْهِ راجِعُونَ هذا ماوَعَدَنا الله وَرَسُولُهُ وَصَدَقَ الله وَرَسُولُهُ، اللّهُمَّ زِدْنا إيْماناً وَتَسْلِيماً،\n\n'
                      'فاذا أراد الخروج من القبر خرج من قبل رجليه ثم يطمّ القبر ويرفع من الارض مقدار أربع أصابع، ولا يطرح فيه غير ترابه ويجعل عند رأسه لبنة أو لوحا ثم يصب الماء على القبر، يبدأ بالصبّ من عند الرأس، ثم يدار من أربع جوانب القبر حتى يعود إلى موضع الرأس، فإن فضل‌ من الماء شيء صبه على‌ وسط القبر، فإذا سوّى‌القبر وضع يده على القبر من أراد ذلك ويفرج أصابعه ويغمرها فيه ويدعو للميّت فيقول: اللّهُمَّ آنِسْ وَحْشَتَهُ وَارْحَمْ غُرْبَتَهُ وَأسْكِنْ (وَآمِنْ) رَوْعَتُهُ وَصِلْ وَحْدَتَهُ وَأسْكِنْ إلَيْهِ مِنْ رَحْمَتِكَ رَحْمَةً يَسْتَغْنِي بِها عَنْ رَحْمَةِ مَنْ سِواكَ وَاحْشُرْهُ مَعَ مَنْ كانَ يَتَوَلاّ هُ. فإذا انصرف الناس عن القبر تأخر أولى الناس بالميّت ويترحم عليه وينادي بأعلى صوته إن لم يكن في موضع تقيّة: يافلان بن فلان يذكر اسم الميت واسم ابيه: الله رَبُّكَ وَمُحَمَّدٌ نَبِيُّكَ وَالقُرْآنُ كِتابُكَ وَالكَعْبَةُ قِبْلَتُكَ وَعَلِيُّ إمامُكَ وَالحَسَنُ وَالحُسَيْنُ ويذكر الأئمة واحداً واحداً أئمَّتُكَ أئمَّةُ الهُدَى الابْرارُ.',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title:
                      'أقول : يستحب تلقين الميت في ما عداً حال الاحتضار في موضعين :\n\n'
                      'الاول :',
                  subtitle:
                      'عندما يوضع في القبر والافضل أن يقبض على منكبه الايمن باليد اليمنى وعلى الايسر باليسرى فيحرّكه ويلقنه.',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: 'الثاني :',
                  subtitle:
                      'بعد الدفن، فيستحب أن يجلس الوليّ أي أقرب الناس إليه عند رأسه بعد انصراف الناس فيلقنه برفيع صوته ويحسن أن يضع راحتيه على القبر ويقرب فاه منه ولابأس بأن يستنيب الوليّ للتلقين.\n\n'
                      'وفي الاحاديث أنّ الميّت إذا لُقّن هذا التلقين قال منكر ونكير: قد لقنوه فلا حاجة إلى سؤاله فلننصرف، فينصرفان عنه ولا يسألانه.\n\n'
                      'قال العلامة المجلسي رض: التلقين الجامع هو أن يقول المُلقِّن : إسْمَعْ إفْهَمْ يافُلانُ بْنُ فُلانٍ وليذكر اسمه واسم ابيه هَلْ أنْتَ عَلى العَهْدِ الَّذِي فارَقْتَنا عَلَيْهِ مِنْ شَهادَةِ أنْ لا إلهَ إِلاّ الله وَحْدَهُ لاشَريكَ لَهُ، وَأنَّ مُحَمَّداً صَلّى الله عَلَيْهِ وَآلِهِ عَبْدُهُ وَرَسُولُهُ وَسَيِّدُ النَّبِيِّينَ وَخاتَمُ المُرْسَلِينَ، وَأنَّ عَلَيَّاً أمِيرُ المُؤْمِنِينَ وَسَيِّدُ الوَصِيِّينَ وَإمامٌ افْتَرَضَ الله طاعَتَهُ عَلى العالَمِينَ، وَأنَّ الحَسَنَ وَالحُسَيْنَ وَعلِيَّ بْنَ الحُسَيْن وَمُحَمَّدَ بْنَ عَلِيٍّ وَجَعْفَرَ بْنَ مُحَمَّدٍ وَمُوسَى بْنَ جَعْفَرٍ وَعَلِيَّ بْنَ مُوسَى وَمُحَمَّدَ بْنَ عَلِيٍّ وَعَلِىَّ بْنَ مُحَمَّدٍ وَالحَسَنَ بْنَ عَلِيٍّ وَالقائِمَ الحُجَّةَ المَهْدِيَّ صَلَواتُ الله عَلَيْهِمْ أئِمَّةُ المُؤْمِنِينَ وَحُجَجُ الله عَلى الخَلْقِ أجْمَعِينَ، وَأئِمَّتُكَ أئِمَّةُ هُدى أبْرارٌ.\n\n'
                      '(يافُلانَ بْنَ فُلانٍ) إذا أتاكَ المَلَكانِ المُقَرَّبانِ رَسُولَيْنِ مِنْ عِنْدِ الله تَبارَكَ وَتَعالى وَسَألاكَ عَنْ رَبِّكَ وَعَنْ نَبِيِّكَ وَعَنْ دِينِكَ وَعَنْ كِتابِكَ وَعَنْ قِبْلَتِكَ وَعَنْ أئِمَّتِكَ فَلا تَخَفْ وَقُلْ فِي جَوابِهِما: الله جَلَّ جَلالُهُ رَبِّي، وَمُحَمَّدٌ صَلّى الله عَلَيْهِ وَآلِهِ نَبِيِّي، وَالاسْلامُ دِينِي، وَالقُرْآنُ كِتابِي، وَالكَعْبَةُ قِبْلَتِي، وَأميرُ المُؤْمِنِينَ عَلِيُّ بْنُ أبِي طالِبٍ إمامِي، وَالحَسَنُ بْنُ عَلِيٍّ الُمجْتَبى إمامِي، وَالحُسَيْنُ بْنُ عَلِيٍّ الشَهِيدُ بِكَرْبَلاَء إمامِي، وَعَلِيُّ زَيْنُ العابِدِينَ إمامِي، وَمُحَمَّدٌ باقِرُ عِلْمِ النَّبِيِّينَ إمامِي، وَجَعْفَرٌ الصادِقُ إمامِي، وَمُوسَى الكاظِمُ إمامِي، وَعَلِيُّ الرِّضا إمامِي، وَمُحَمَّدٌ الجَوادُ إمامِي، وَعَلِيُّ الهادِي إمامِي، وَالحَسَنُ العَسْكَرِيُ إمامِي، وَالحُجَّةُ المُنْتَظَرُ إمامِي ؛ هؤُلاِ صَلَواتُ الله عَلَيْهِمْ أجْمَعينَ أئِمَّتِي وَسادَتِي وَقادَتِي وَشُفَعائِي، بِهِمْ أتَوَلّى وَمِنْ أعْدائِهِمْ أتَبَرَّأُ فِي الدُّنْيا وَالاخِرَةِ. ثُمَّ إعْلَمْ يافُلانَ بْنَ فُلانٍ أَنَّ الله تَبارَكَ وَتَعالى نِعْمَ الرَّبُ، وَأنَّ مُحَمَّداً صَلّى الله عَلَيْهِ وَآلِهِ نِعْمَ الرَّسُولُ، وَأنَّ أميرَ المُؤْمِنِينَ عَلِيَّ بْنَ أبَي طالبِ وَأوَلادَهُ الائِمَّةَ الاحَدَ عَشَرَ نِعْمَ الائِمَّةَ، وَأنَّ ماجاءَ بِهِ مُحَمَّدٌ صَلّى الله عَلَيْهِ وَآلِهِ حَقُّ، وَأنَّ المَوتُ حَقٌّ وَسُؤالَ مُنْكَرٍ وَنَكيرٍ فِي القَبْرِ حَقُّ وَالبَعْثَ حَقُّ وَالنُشُورَ حَقُّ وَالصِّراطَ حَقُّ وَالمِيزانَ حَقُّ وَتَطايُرَ الكُتُبِ حَقُّ وَالجَنَّةَ حَقُّ وَالنَّارَ حَقُّ، وَأنَّ السَّاعَةَ آتِيَةٌ لارَيْبَ فِيها، وَأنَّ الله يَبْعَثُ مَنْ فِي القُبُورِ.\n\n'
                      'ثم يقول : أفَهِمْتَ يافُلانُ. وفي الحديث أنّ الميّت يجيب بلى فهمت. ثم يقول: ثَبَّتَكَ الله بِالقَوْلِ الثَّابِتِ هَدَاكَ الله إِلى صِراطٍ مُسْتَقِيمٍ عَرَّفَ الله بيْنَنا وَبَيْنَكَ وَبَيْنَ أوْلِيائِكَ فِي مُسْتَقَرٍّ مِنْ رَحْمَتِهِ. ثم يقول: اللّهُمَّ جافِ الارْضَ عَنْ جَنْبَيْهِ وَاصْعَدْ بِرُوَحِهِ إلَيْكَ وَلَقِّهِ مِنْكَ بُرْهانا، اللّهُمَّ عَفْوَكَ عَفْوَكَ.\n\n'
                      'جعلت الختام كلمة العفو الشريفة والرجاء الواثق هو شمول العفو الربوبي لي أنا الذي سوّدت وجهي الذنوب ولمن جرى على هذه الرسالة. وكان ذلك في آخر يوم جمعة التاسع عشر من شهر محرم الحرام سنة 1345 ألف وثلاثمائة وخمس وأربعين في جوار إمامنا المسموم مولانا الغريب المظلوم أبي الحسن علي بن موسى الرضا عليه وعلى آبائه السلام من الحي القيوم والحمد لله أولاً وآخراً وصلى الله على محمد وآله.\n\n'
                      'كتبه بيمناه الوازرة عباس بن محمد رضا القمّي عفي عنهما.',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
            ],
          ),
        ),
        bottomNavigationBar: AddCustomBottomNavigationBar(
          pushNext: Dou3a2AlsajadFiZikrAltawba.screenRoute,
          pushBack: FiAsarBa3dSowarWalayat.screenRoute,
          soud: '',
          onTap: (double fontSize) {
            // تحديث حجم الخط
            setState(() {
              isTablet ? _fontSizeTablet = fontSize : _fontSize = fontSize;
            });
            print('fontSize: $fontSize');
            // إغلاق Dialog
            Navigator.of(context).pop();
          },
          onLongPress: () {
            final snackBar = SnackBar(
              content: Center(
                child: Text(
                  '${isTablet ? _fontSizeTablet.toInt() : _fontSize.toInt()}',
                  style: TextStyle(
                    color: Colors.white,
                    fontSize: 16,
                  ),
                ),
              ),
              width: 60,
              behavior: SnackBarBehavior.floating,
              backgroundColor: Colors.blue,
              duration: Duration(seconds: 2),
              shape: ShapeBorder.lerp(
                RoundedRectangleBorder(
                  borderRadius: BorderRadius.circular(50),
                ),
                RoundedRectangleBorder(
                  borderRadius: BorderRadius.circular(50),
                ),
                1,
              ),
            );
            ScaffoldMessenger.of(context).showSnackBar(snackBar);
          },
        ),
      ),
    );
  }
}
