import 'package:flutter/material.dart';
import 'package:provider/provider.dart';
import 'package:shared_preferences/shared_preferences.dart';

import '../../../widgets/add_custom_bottom_navigation_bar.dart';
import '../../../widgets/container_scrollview.dart';
import '../../../widgets/list_of_nine_verses.dart';
import '../../favorites_provider.dart';
import '../../favorites_screen.dart';
import '../al2a3mal_al5asa.dart';
import 'zyarat_amir_mo2minin.dart';
import 'zyarat_sa7ib_alzaman.dart';

class A3malAllaylaAlsalisaWal3ishrin extends StatefulWidget {
  static String screenRoute = 'a3mal_allayla_alsalisa_wal3ishrin_screen';
  const A3malAllaylaAlsalisaWal3ishrin({super.key});

  @override
  State<A3malAllaylaAlsalisaWal3ishrin> createState() =>
      _A3malAllaylaAlsalisaWal3ishrinState();
}

double _fontSize = 18;
double _fontSizeTablet = 30;

class _A3malAllaylaAlsalisaWal3ishrinState
    extends State<A3malAllaylaAlsalisaWal3ishrin> {
  bool isIcon = true;
  @override
  void initState() {
    super.initState();
    _loadFavoriteState();
  }

  Future<void> _loadFavoriteState() async {
    final prefs = await SharedPreferences.getInstance();
    bool? savedState =
        prefs.getBool('isFavorite_a3mal_allayla_alsalisa_wal3ishrin_screen');
    setState(() {
      isIcon = savedState ?? true;
    });
  }

  Future<void> _saveFavoriteState(bool value) async {
    final prefs = await SharedPreferences.getInstance();
    await prefs.setBool(
        'isFavorite_a3mal_allayla_alsalisa_wal3ishrin_screen', value);
  }

    Future<bool> _onWillPop() async {
    final args =
        ModalRoute.of(context)!.settings.arguments as Map<String, dynamic>?;
    final previousPage = args?['previousPage'];
    if (previousPage == 'favorite_screen') {
      Navigator.of(context).pushReplacementNamed(FavoritesScreen.screenRoute);
      return false;
    } else {
      Navigator.of(context).pushReplacementNamed(Al2a3malAl5asa.screenRoute);
      return false;
    }
  }

  @override
  Widget build(BuildContext context) {
    double size = MediaQuery.of(context).textScaleFactor;
    final screenWidth = MediaQuery.of(context).size.width;
    final isTablet = screenWidth >= 600;
    return WillPopScope(
      onWillPop: _onWillPop,
      child: Scaffold(
        appBar: AppBar(
          toolbarHeight: isTablet ? 100 : 50,
          centerTitle: true,
          leading: IconButton(
            onPressed: _onWillPop,
            icon: Icon(
              Icons.arrow_back,
              size: isTablet ? 50 : 25,
            ),
          ),
          actions: [
            IconButton(
              padding: EdgeInsets.only(left: isTablet ? 50 : 30),
              icon: Icon(
                isIcon ? Icons.favorite_border : Icons.favorite_rounded,
                size: isTablet ? 40 : 25,
                color: isIcon ? Colors.black : Colors.red,
              ),
              onPressed: () async {
                setState(() {
                  isIcon = !isIcon;
                });
                await _saveFavoriteState(isIcon);
      
                if (!isIcon) {
                  Provider.of<FavoritesProvider>(context, listen: false)
                      .addFavorite('اعمال الليلة الثالثة والعشرين',
                          A3malAllaylaAlsalisaWal3ishrin.screenRoute);
                } else {
                  Provider.of<FavoritesProvider>(context, listen: false)
                      .removeFavorite(
                          'اعمال الليلة الثالثة والعشرين',
                          A3malAllaylaAlsalisaWal3ishrin.screenRoute,
                          A3malAllaylaAlsalisaWal3ishrin.screenRoute);
                }
              },
            ),
          ],
          title: Text(
            'اعمال الليلة الثالثة والعشرين',
            style: TextStyle(
              fontSize: isTablet
                  ? 40
                  : size > 1.0
                      ? 20
                      : 23,
              fontWeight: FontWeight.bold,
            ),
          ),
        ),
        body: ContainerScrollview(
          widget: Column(
            crossAxisAlignment: CrossAxisAlignment.start,
            children: [
              Center(
                child: Text(
                  'بسم الله الرحمن الرحيم',
                  style: TextStyle(
                    fontSize: isTablet ? _fontSizeTablet + 10 : _fontSize,
                    fontWeight: FontWeight.w900,
                  ),
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: '',
                  subtitle:
                      'وهي أفضل من الليلتين السابقتين. ويستفاد من أحاديث كثيرة أنها هي ليلة القدر، وهي ليلة فيها يُقدرّ كل أمرٍ حكيم. ولهذه الليلة عدّة أعمال خاصة سوى الأعمال العامة التي تشارك فيها الليلتين الماضيتين.الأول: أنه يستحب فيها غسلان مؤكدان في أول الليل وآخره.والثاني: قراءة سورتي "العنكبوت" و"الروم". وقد روي عن الإمام الصادق عليه السلام: "من قرأ سورتي العنكبوت والروم في شهر رمضان ليلة ثلاث وعشرين، فهو والله، يا أبا محمد، من أهل الجنة..." .والثالث: قراءة سورة "الدخان". والرابع: قراءة سورة "القدر" ألف مرّة.والخامس: أن تكرر في هذه الليلة، بل في جميع الأوقات دعاء: اللّهُمَّ، كن لوليّك الحجّة ابن الحسن، صلواتك عليه وعلى آبائه، في هذه الساعةِ وفي كلّ ساعةٍ، وليّاً وحافظاً، وقائداً وناصراً، ودليلاً وعيناً، حتى تُسكنه أرضك طوعاً، وتمتّعه فيها طويلاً.السادس: قراءة هذا الدُّعاء:يا رَبَّ لَيْلَةِ الْقَدْرِ وَجاعِلَها خَيْراً مِنْ أَلْفِ شَهْرٍ، وَرَبَّ اللَّيْلِ وَالنَّهارِ، وَالْجِبالِ وَالْبِحارِ، وَالظُّلَمِ وَالْأَنْوارِ، وَالْأَرْضِ وَالسَّماءِ. يا بَارِىءُ يا مُصَوِّرُ، يا حَنَّانُ يا مَنَّانُ، يا اللهُ يا رَحْمنُ، يا اللهُ يا قَيُّومُ، يا اللهُ يا بَدِيعُ، يا اللهُ يا اللهُ يا اللهُ، لَكَ الْأَسْماءُ الْحُسْنَى، وَالْأَمْثالُ الْعُلْيا، وَالْكِبْرِياءُ وَالآلاءُ، أَسْأَلُكَ أَنْ تُصَلِّيَ عَلَى مُحَمَّدٍ وَآلِ مُحَمَّدٍ، وَأَنْ تَجْعَلَ اسْمِي فِي هذِهِ اللَّيْلَةِ فِي السُّعَداءِ، وَرُوحِي مَعَ الشُّهَداءِ، وَإِحْسانِي فِي عَلِّيِّينَ، وَإِسَاءَتِي مَغْفُورَةً، وَأَنْ تَهَبَ لِي يَقِيناً تُباشِرُ بِهِ قَلْبِي، وَإِيْماناً يُذْهِبُ الشَّكَّ عَنِّي، وَتُرْضِيَنِي بِما قَسَمْتَ لِي، وَاتِنا فِي الدُّنْيا حَسَنَةً، وَفِي الآخِرَةِ حَسَنَةً، وَقِنا عَذابَ النَّارِ الْحَرِيقِ، وَارْزُقْنِي فِيها ذِكْرَكَ وَشُكْرَكَ، وَالرَّغْبَةَ إِلَيْكَ، وَالْإِنابَةَ وَالتَّوْبَةَ، وَالتَّوْفِيقَ لِما وَفَّقْتَ لَهُ مُحَمَّداً وَآلَ مُحَمَّدٍ عَلَيْهِمُ السَّلامُ.ثمّ تقول: اللّهُمَّ، امْدُدْ لِي فِي عُمْرِي، وَأَوْسِعْ لِي فِي رِزْقِي، وَأَصِحَّ لِي جِسْمِي، وَبَلِّغْنِي أَمَلِي. وَإِنْ كُنْتُ مِنَ الْأَشْقِياءِ فَامْحُنِي مِنَ الْأَشْقِياءِ، وَاكْتُبْنِي مِنَ السُّعَداءِ، فَإِنَّكَ قُلْتَ فِي كِتابِكَ الْمُنْزَلِ عَلَى نَبِيِّكَ الْمُرْسَلِ، صَلَواتُكَ عَلَيْهِ وَآلِهِ: يَمْحُو الله ما يَشاءُ وَيُثْبِتُ وَعِنْدَهُ أُمُّ الْكِتابِ.الدعاء المروي عن النبي صلى الله عليه وآله وسلمسُبُّوحٌ قُدُّوسٌ رَبُّ الْمَلائِكَةِ وَالرُّوحِ، سُبُّوحٌ قُدُّوسٌ رَبُّ الرُّوحِ (الملائِكَةِ) وَالْعَرْشِ، سُبُّوحٌ قُدُّوسٌ رَبُّ السَّمواتِ وَالأرَضِيْنَ، سُبُّوحٌ قُدُّوسٌ رَبُّ البِحارِ وَالْجِبالِ، سُبُّوحٌ قُدُّوسٌ يُسبِّحُ لَهُ الْحِيتانُ، وَالْهَوامُّ، وَالسِّباعُ في الآكامِ، سُبُّوحٌ قُدُّوسٌ سَبَّحَتْ لَهُ الْمَلائِكَةُ الْمُقَرَّبُونَ، سُبُّوحٌ قُدُّوسٌ عَلا فَقَهَرَ، وَخَلَقَ فَقَدَّرَ. سُبُّوحٌ، سُبُّوحٌ، سُبُّوحٌ، سُبُّوحٌ، سُبُّوحٌ، سُبُّوحٌ، سُبُّوحٌ، سُبُّوحٌ. قُدُّوسٌ، قُدُّوسٌ، قُدُّوسٌ، قُدُّوسٌ، قُدُّوسٌ، قُدُّوسٌ، قُدُّوسٌ. (أسْألُكَ أنْ تُصَلِي عَلى مُحَمَدٍ وآلِهِ، وأنْ تَغْفِرَ لِي وتَرْحَمَنِي، فإنّكَ أنْتَ الأحَدُ الصَمَدُ).ويقرأ هذا الدُّعاء، أيضاً، فيها: اللّهُمَّ، إيَّاكَ (إليك) تَعَمَّدْتُ اللّيْلَةَ بِحاجَتِي، وَبِكَ أنْزَلْتُ فَقْرِي وَمَسْكَنَتِي (ومسألتي). تَسَعُنِي اللّيْلَةَ رَحْمَتُكَ وَعَفْوُكَ، فَأنَا لِرَحْمَتِكَ أرْجى مِنّي لِعَمَلي، وَرَحْمَتُكَ وَمَغْفِرَتُكَ أوْسَعُ مِنْ ذُنُوبي. وَاقْضِ لي كُلَّ حاجَةٍ هِيَ لي بِقُدْرَتِكَ عَلى ذلِكَ، وَتَيْسيرِهِ عَلَيْكَ، فَإنِّي لَمْ أُصِبْ خَيْراً إلّا مِنْكَ، وَلَمْ يَصْرِفْ عَنّي أحَدٌ سُوْءاً قَطُّ غَيْرُكَ، وَلَيْسَ لي رَجاءٌ لِدِيني وَدُنْيايَ وَلا لآخِرَتي وَلا لِيَوْمِ فَقْرِي، يَوْمَ أُدْلى في حُفْرَتي، وَيُفْرِدُنِي النَّاسُ بِعَمَلي، غَيْرَكَ يا رَبَّ الْعالمينَ.ويقرأ فيها هذا الدُّعاء: اللّهُمَّ، اجْعَلْني مِنْ أوْفَرِ عِبادِكَ نَصيباً مِنْ كُلِّ خَيْرٍ أنْزَلْتَهُ، في هذِهِ اللّيْلَةِ، أوْ أنْتَ مُنْزِلُهُ، مِنْ نُورٍ تَهْدِي بِهِ، أوْ رَحْمَةٍ تَنْشُرُها، أوْ رِزْقٍ تَقْسِمُهُ، أوْ بَلاءٍ تَدْفَعُهُ، أوْ ضُرٍّ تَكْشِفُهُ. وَاكْتُبْ لي ما كَتَبْتَ لأوْلِيائِكَ الصّالِحيْنَ، الّذِيْنَ اسْتَوْجَبُوا مِنْكَ الثَّوابَ، وَأمِنوا بِرِضاكَ عَنْهُمْ مِنْكَ الْعِقابَ، يا كَرِيمُ يا كَرِيْمُ، صَلِّ عَلى مُحَمَّدٍ وَآلِ مُحَمَّدٍ، وَافْعَلْ بي ذلِكَ، بِرَحْمَتِكَ يا أرْحَمَ الرَّاحِميْنَ.وفيها هذا الدعاء: اللهُمَّ اجْعَلْني مِنْ أوْفَرِ عِبادِكَ نَصيباً مِنْ كُلِّ خَيْرٍ أنْزَلْتَهُ في هذِهِ اللّيْلَةِ أوْ أنْتَ مُنْزِلُهُ مِنْ نُورٍ تَهْدِي بِهِ أوْ رَحْمَةٍ تَنْشُرُها أوْ رِزْقٍ تَقْسِمُهُ أوْ بَلاءٍ تَدْفَعُهُ أوْ ضُرٍّ تَكْشِفُهُ وَاكْتُبْ لي ما كَتَبْتَ لأوْلِيائِكَ الصّالِحيْنَ الّذِيْنَ اسْتَوْجَبُوا مِنْكَ الثَّوابَ وَأمِنوا بِرِضاكَ عَنْهُمْ مِنْكَ الْعِقابَ يا كَرِيمُ يا كَرِيْمُ صَلِّ عَلى مُحَمَّدٍ وَآلِ مُحَمَّدٍ وَافْعَلْ بي ذلِكَ بِرَحْمَتِكَ يا أرْحَمَ الرَّاحِميْنَ.ويقرأ فيها هذا الدُّعاء، أيضاً:اللهُمَّ إن كانَ الشَّكُّ في أنَّ لَيْلَةَ الْقَدْرِ فيها أوْ فِيما تَقَدَّمَها وَاقِعٌ فَإنَّهُ فيكَ وَفي وَحْدانِيّتِكَ وَتَزْكِيَتِكَ الأعْمالَ زائِلٌ وَفي أيِّ اللَّيالي تَقَرَّبَ مِنْكَ الْعَبْدُ لَمْ تُبْعِدْهُ وَقَبِلْتَهُ وَأَخْلَصَ في سُؤَالِكَ لَم تَرُدَّهُ وَأجَبْتَهُ وَعَمِلَ الصَّالحاتِ شَكَرْتَهُ وَرَفَعَ إلَيْكَ ما يُرْضيكَ ذَخَرْتَهُ اللهُمَّ فَأمِدَّني فيها بِالْعَوْنِ عَلى ما يُزْلِفُ لَدَيْكَ وَخُذْ بِناصِيَتِي إلى ما فيهِ الْقُرْبى إلَيْكَ وَأسْبِغْ مِنَ الْعَمَلِ في الدَّارَيْنِ سَعْيي وَرَقِّ لي مِنْ جُودِكَ بِخَيْراتِها عَطِيَّتي وَابْتُرْ عَيْلَتي مِنْ ذُنُوبِي بالتَّوْبَةِ وَمِنْ خَطايايَ بِسَعَةِ الرَّحْمَةِ وَاغْفِرْ لي في هذِهِ اللَّيْلَةِ وَلِوالِدَيَّ وَلِجَميعِ الْمُؤمِنينَ وَالْمُؤْمِناتِ، غُفْرانَ مُتَنَزِّهٍ عَنْ عُقُوْبَةِ الضُّعَفاءِ، رَحِيمٍ بِذَوِي الْفاقَةِ وَالْفُقَراءِ، جادٍ عَلى عَبِيدِهِ، شَفِيْقٍ بِخُضُوعِهِمْ وَذِلّتِهِمْ، رَفِيقٍ لا تَنْقُصُهُ الصَّدَقَةُ عَلَيْهِمْ، وَلا يُفْقِرُهُ ما يُغْنِيهِمْ منْ صَنيعِهِ (إليهِمْ).اللّهُمَّ، اقْضِ دَيْنِي وَدَيْنَ كُلِّ مَدْيُونٍ، وَفَرِّجْ عَنّي وَعَنْ كُلِّ مَكْرُوبٍ، وَأصْلِحْنِي وَأهْلِي وَوَلَدِي، وَأصْلِحْ كُلَّ فاسِدٍ، وَانْفَعْ مِنّي، وَاجْعَلْ في الْحَلالِ الطَّيِّبِ الْهَنِيءِ الْكَثِيرِ السَّائِغِ مِنْ رِزْقِكَ عَيْشي، وَمِنْهُ لِباسي، وَفيهِ مُنْقَلَبي، وَاقْبِضْ عَنِ الْمَحارِمِ يَدي مِنْ غَيْرِ قَطْعٍ وَلا شَلٍّ، وَلِسانِي مِنْ غَيْرِ خَرَسٍ، وَأُذُني مِنْ غَيْرِ صَمَمٍ، وَعَيْني مِنْ غَيْرِ عَمىً، وَرِجْلي مِنْ غَيْرِ زَمانَةٍ، وَفَرْجي مِنْ غَيْرِ إِحِبَالٍ، وَبَطْني مِنْ غَيْرِ وَجَعٍ، وَسائِرَ أعْضائِي مِنْ غَيْرِ خَلَلٍ. وَأَوْرِدْنِي عَلَيْكَ يَوْمَ وُقُوفي بَيْنَ يَدَيْكَ، خالِصاً مِنَ الذّنُوبِ، نَقِيّاً مِنَ الْعُيُوبِ، لا أسْتَحْيي مِنْكَ بِكُفْرانِ نِعْمَةٍ، وَلا إقْرارٍ بِشَرِيكٍ لَكَ في الْقُدْرَةِ، وَلا بِإرْهاجٍ في فِتْنَةٍ، وَلا تَوَرُّطٍ في دِماءٍ مُحَرَّمَةٍ، وَلا بَيْعَةٍ أُطَوِّقُها عُنُقي لأحَدٍ مِمَّنْ فَضَّلْتَهُ بِفَضِيلَةٍ، وَلا وُقُوفٍ تَحْتَ رايَةِ غَدْرَةٍ، وَلَا اسْوِداد الْوَجْهِ بِالأيْمانِ الْفاجِرَةِ، وَالْعُهُودِ الخائِنَةِ، وَأنِلْني مِنْ تَوْفيقِكَ وَهُداكَ ما نَسْلُكَ بِهِ سُبُلَ طاعَتِكَ وَرِضاكَ، يا أرْحَمَ الرَّاحِمينَ.ويقرأ فيها هذا الدُّعاء: اللّهُمَّ، إنّي أسْألُكَ مَسْألَةَ الْمِسْكِينِ الْمُسْتَكِينِ، وَأبْتَهِلُ إلَيْكَ ابْتهالَ الْمُذْنِبِ البَائِسِ الذَّلِيلِ، مَسْألَةَ مَنْ خَضَعَتْ لَكَ ناصِيَتُهُ، وَاعْتَرَفَ بِخَطِيئَتِهِ، وَفاضَتْ (ففاضت) لَكَ عَبْرَتُهُ، وَهَمَلَتْ لَكَ دُمُوعُهُ، وَضَلّتْ حِيْلَتُهُ، وَانْقَطَعَتْ حُجَّتُهُ، أنْ تُعْطِيَني في لَيْلَتي هذِهِ مَغْفِرَةَ ما مَضى مِنْ ذُنُوبي، وَاعْصِمْني فيما بَقِيَ مِنْ عُمْري، وَارْزُقْنِي الْحَجَّ وَالْعُمْرَةَ في عامي هذا، وَاجْعَلْها حَجَّةً مَبْرُوْرَةً خالِصَةً لِوَجْهِكَ، وَارْزُقْنِيهِ أبَداً ما أبْقَيْتَنِي، وَلا تُخْلِنِي مِنْ زِيارَتِكَ وَزِيارَةِ قَبْرِ نَبِيِّكَ (مُحَمَدٍ) صَلَواتُكَ عَلَيْهِ وَآلِهِ.إلهي، وَأسْألُكَ أنْ تَكْفِيَني مَؤُنَةَ خَلْقِكَ مِنَ الْجِنِّ وَالإنْسِ وَالْعَرَبِ وَالْعَجَمِ وَمِنْ كُلِّ دابَّةٍ أنْتَ آخِذٌ بِناصِيَتِها إنَّكَ عَلى صِراطٍ مُسْتَقِيمٍ اللّهُمَّ، اجْعَلْ لي فيما تَقْضي وَتُقَدِّرُ مِنَ الأمْرِ الْمَحْتُومِ وَمِمَّا تَفْرُقُ مِنَ الأمْرِ الْحَكِيمِ في هذِهِ اللَّيْلَةِ في الْقَضاءِ الّذِي لا يُرَدُّ وَلا يُبَدَّلُ أنْ تَكْتُبَنِي مِنْ حُجَّاجِ بَيْتِكَ الْحَرامِ في عامِيْ هذَا الْمَبْرُورِ حَجُّهُمُ الْمَشْكُورِ سَعْيُهُمُ الْمَغْفُوْرِ ذُنُوبُهُمُ الْمُكَفَّرِ عَنْهُمْ سَيِّئاتُهُمْ وَأنْ تُطيلَ عُمْري وَأنْ تُوَسِّعَ لي في رِزْقي وَارْزُقْني وَلَداً بارّاً إنَّكَ عَلى كُلِّ شَيْءٍ قَديرٌ وَبِكُلِّ شَيْءٍ مُحِيطٌ.ويقرأ فيها هذا الدُّعاء:اللّهُمَّ، إنّي أسْألُكَ سُؤالَ الْمِسْكِينِ الْمُسْتَكِينِ، وَأبْتَغِي إلَيْكَ ابتغاءَ الْبائِسِ الْفَقِيرِ، وَأتَضَرَّعُ إلَيْكَ تَضَرُّعَ الضّعِيْفِ الضَّرِيْرِ، وَأبْتَهِلُ إلَيْكَ ابْتِهالَ الْمُذْنِبِ الذَّلِيْلِ. وَأسْألُكَ مَسْألَةَ من خضعت لَكَ نَفْسُهُ، وَرَغِمَ لَكَ أنْفُهُ، وَعَفَّرَ لَكَ وَجْهَهُ، وَخَضَعَتْ لَكَ ناصِيَتُهُ، وَاعْتَرَفَ بِخَطِيْئَتِهِ، وَفاضَتْ لَكَ عَبْرَتُهُ، وَانْهَمَلَتْ لَكَ دُمُوعُهُ، وَضَلَّتْ عَنْهُ حِيْلَتُهُ، وَانْقَطَعَتْ عَنْهُ حُجَّتُهُ، بِحَقِّ مُحَمَّدٍ وَآلِ مُحَمَّدٍ عَلَيْكَ، وَبِحَقِّكَ الْعَظِيمِ عَلَيْهِمْ، أنْ تُصَلِّيَ عَلَيْهِمْ كَما أنْتَ أهْلُهُ، وَأنْ تُصَلِّيَ عَلى نَبِيِّكَ وَآلِ نَبِيّكَ، وَأنْ تُعْطِيَني أفْضَلَ ما أعْطَيْتَ السَّائِلينَ مِنْ عِبادِكَ الْماضيْنَ مِنَ الْمُؤْمِنينَ، وَأفْضَلَ ما تُعْطِي الْباقِينَ مِنَ المُؤْمِنِينَ، وَأفْضَلَ ما تُعْطِي مَنْ تَخْلُقُهُ مِنْ أوْلِيائكَ إلى يَوْمِ الدِّينِ، مِمَّنْ جَعَلْتَ لَهُ خَيْرَ الدُّنْيا وَخَيْرَ الآخِرَةِ، يا كَرِيمُ يا كَرِيمُ يا كَرِيمُ. وَأعْطِني في مَجْلِسي هذا مَغْفِرَةَ ما مَضى مِنْ ذُنُوبِي، وَاعْصِمْني فيما بَقِيَ مِنْ عُمْرِي، وَارْزُقْنِي الحَجّ والعُمْرَةَ في عاميْ هذا، مُتَقَبَّلاً مَبْرُوراً خالِصاً لِوَجْهِكَ يا كَرِيمُ، وارْزُقْنِيهِ أبَداً ما أبْقَيْتَني، يا كَرِيمُ يا كَرِيمُ يا كَرِيمُ، وَاكْفِنِي مَؤُنَةَ نَفْسِي، وَاكْفِنِي مَؤُنَةَ عِيالي، وَاكفِني مُؤْنَةَ خَلْقِكَ، وَاكْفِنِي شَرَّ فَسَقَةِ الْعَرَبِ وَالْعَجَمِ، وَاكْفِني شَرَّ فَسَقَةِ الجِنِّ وَالإنْسِ، وَاكْفِني شَرَّ كُلِّ دابَّةٍ أنْتَ آخِذٌ بِناصِيَتِها، إنَّ رَبّي عَلى صِراطٍ مُسْتَقِيمٍ.ويستحب فيها قراءة هذا الدُّعاء أيضاً المروي عن الإمام الكاظم عليه السلام:اللّهُمَّ، اجْعَلْ فيما تَقْضي، وَفِيما تُقَدِّرُ مِنَ الأمْرِ الْمَحْتُومِ، وَفِيما تَفْرُقُ مِنَ الأمْرِ الْحَكِيمِ في لَيْلَةِ الْقَدْرِ، مِنَ الْقَضاءِ الّذي لا يُرَدُّ وَلا يُبَدَّلُ، أنْ تَكْتُبَني مِنْ حُجَّاجِ بَيْتِكَ الْحَرامِ، في عاميْ هذا، الْمَبْرُورِ حَجُّهُمُ، الْمَشْكُورِ سَعْيُهُمُ، الْمَغْفُوْرِ ذُنُوبُهُمُ، الْمُكَفَّرِ عَنْهُمْ سَيِّئاتُهُمْ. وَاجْعَل فِيما تَقْضي، وَفِيما تُقَدِّرُ، أن تُطِيْلَ عُمْرِي، وَتُوَسِّعَ لي في رِزْقي.',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
            ],
          ),
        ),
        bottomNavigationBar: AddCustomBottomNavigationBar(
          pushNext: ZyaratSa7ibAlzaman.screenRoute,
          pushBack: ZyaratAmirMo2minin.screenRoute,
          soud: 'https://cdn.jsdelivr.net/gh/SounaDiab/image_audio@master/audio/اعمال الليلة الثالثة والعشرين.mp3',
          onTap: (double fontSize) {
            // تحديث حجم الخط
            setState(() {
              isTablet ? _fontSizeTablet = fontSize : _fontSize = fontSize;
            });
            print('fontSize: $fontSize');
            // إغلاق Dialog
            Navigator.of(context).pop();
          },
          onLongPress: () {
            final snackBar = SnackBar(
              content: Center(
                child: Text(
                  '${isTablet ? _fontSizeTablet.toInt() : _fontSize.toInt()}',
                  style: TextStyle(
                    color: Colors.white,
                    fontSize: 16,
                  ),
                ),
              ),
              width: 60,
              behavior: SnackBarBehavior.floating,
              backgroundColor: Colors.blue,
              duration: Duration(seconds: 2),
              shape: ShapeBorder.lerp(
                RoundedRectangleBorder(
                  borderRadius: BorderRadius.circular(50),
                ),
                RoundedRectangleBorder(
                  borderRadius: BorderRadius.circular(50),
                ),
                1,
              ),
            );
            ScaffoldMessenger.of(context).showSnackBar(snackBar);
          },
        ),
      ),
    );
  }
}
