import 'package:flutter/material.dart';
import 'package:maktabat_almoslim/widgets/container_scrollview.dart';
import 'package:provider/provider.dart';
import 'package:shared_preferences/shared_preferences.dart';

import '../../../../widgets/add_custom_bottom_navigation_bar.dart';
import '../../../../widgets/list_of_nine_verses.dart';
import '../../../favorites_provider.dart';
import '../../../favorites_screen.dart';
import '../sha3ban.dart';
import 'a3mal_ma_bakya_men_alshaher.dart';
import 'allayla_al2oula_sha3ban.dart';

class FiFadlShaherSha3ban extends StatefulWidget {
  static String screenRoute = 'fi_fadl_shaher_sha3ban_screen';
  const FiFadlShaherSha3ban({super.key});

  @override
  State<FiFadlShaherSha3ban> createState() => _FiFadlShaherSha3banState();
}

double _fontSize = 18;
double _fontSizeTablet = 30;

class _FiFadlShaherSha3banState extends State<FiFadlShaherSha3ban> {
  bool isIcon = true;
  @override
  void initState() {
    super.initState();
    _loadFavoriteState();
  }

  Future<void> _loadFavoriteState() async {
    final prefs = await SharedPreferences.getInstance();
    bool? savedState =
        prefs.getBool('isFavorite_fi_fadl_shaher_sha3ban_screen');
    setState(() {
      isIcon = savedState ?? true;
    });
  }

  Future<void> _saveFavoriteState(bool value) async {
    final prefs = await SharedPreferences.getInstance();
    await prefs.setBool('isFavorite_fi_fadl_shaher_sha3ban_screen', value);
  }

  Future<bool> _onWillPop() async {
    final args =
        ModalRoute.of(context)!.settings.arguments as Map<String, dynamic>?;
    final previousPage = args?['previousPage'];
    if (previousPage == 'favorite_screen') {
      Navigator.of(context).pushReplacementNamed(FavoritesScreen.screenRoute);
      return false;
    } else {
      Navigator.of(context).pushReplacementNamed(Sha3ban.screenRoute);
      return false;
    }
  }

  @override
  Widget build(BuildContext context) {
    double size = MediaQuery.of(context).textScaleFactor;
    final screenWidth = MediaQuery.of(context).size.width;
    final isTablet = screenWidth >= 600;
    return WillPopScope(
      onWillPop: _onWillPop,
      child: Scaffold(
        appBar: AppBar(
          toolbarHeight: isTablet ? 100 : 50,
          centerTitle: true,
          leading: IconButton(
            onPressed: _onWillPop,
            icon: Icon(
              Icons.arrow_back,
              size: isTablet ? 50 : 25,
            ),
          ),
          actions: [
            IconButton(
              padding: EdgeInsets.only(left: isTablet ? 50 : 30),
              icon: Icon(
                isIcon ? Icons.favorite_border : Icons.favorite_rounded,
                size: isTablet ? 40 : 25,
                color: isIcon ? Colors.black : Colors.red,
              ),
              onPressed: () async {
                setState(() {
                  isIcon = !isIcon;
                });
                await _saveFavoriteState(isIcon);

                if (!isIcon) {
                  Provider.of<FavoritesProvider>(context, listen: false)
                      .addFavorite('في فضل شهر شعبان والأعمال الواردة فيه',
                          FiFadlShaherSha3ban.screenRoute);
                } else {
                  Provider.of<FavoritesProvider>(context, listen: false)
                      .removeFavorite(
                          'في فضل شهر شعبان والأعمال الواردة فيه',
                          FiFadlShaherSha3ban.screenRoute,
                          FiFadlShaherSha3ban.screenRoute);
                }
              },
            ),
          ],
          title: Text(
            'في فضل شهر شعبان والأعمال الواردة فيه',
            style: TextStyle(
              fontSize: isTablet
                  ? 40
                  : size > 1.0
                      ? 20
                      : 23,
              fontWeight: FontWeight.bold,
            ),
          ),
        ),
        body: ContainerScrollview(
          widget: Column(
            crossAxisAlignment: CrossAxisAlignment.start,
            children: [
              Container(
                child: Column(
                  children: [
                    Center(
                      child: Text(
                        'بسم الله الرحمن الرحيم',
                        style: TextStyle(
                          fontSize: isTablet ? _fontSizeTablet : _fontSize,
                          fontWeight: FontWeight.w900,
                        ),
                      ),
                    ),
                    Center(
                      child: Text(
                        'اللهم صلِّ على محمد وآل محمد',
                        style: TextStyle(
                          fontSize: isTablet ? _fontSizeTablet : _fontSize,
                          fontWeight: FontWeight.w900,
                        ),
                      ),
                    ),
                  ],
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: '',
                  subtitle:
                      'اعلم انّ شهر شعبان شهر شريف وهو منسوب الى رسول الله (صلى الله عليه وآله وسلم) وكان (صلى الله عليه وآله وسلم) يصوم هذا الشّهر ويوصل صيامه بشهر رمضان، وكان (صلى الله عليه وآله وسلم) يقول : شعبان شهري من صامَ يوماً من شهري وجبت له الجنّة ، وروى عن الصّادق (عليه السلام) انّه قال : كان السّجاد (عليه السلام) اذا دخل شعبان جمع أصحابه وقال (عليه السلام): يا أصحابي أتدرون ما هذا الشّهر، هذا شهر شعبان وكان النّبي (صلى الله عليه وآله وسلم) يقول : شعبان شهري، فصوموا هذا الشّهر حُبّاً لنبيّكم وتقرّباً الى ربّكم، أقسم بمن نفسي بيده لقد سمعت أبي الحسين (عليه السلام) يقول : سمعت أمير المؤمنين (عليه السلام) يقول : من صام شعبان حُبّاً لرسول الله (صلى الله عليه وآله وسلم) وتقرّباً الى الله أحبّه الله وقرّبه الى كرامته يوم القيامة وأوجب له الجنّة.\n\n'
                      'وروى الشّيخ عن صفوان الجمّال قال : قال لي الصّادق (عليه السلام) حُثّ من في ناحيتك على صوم شعبان، فقلت : جعلت فداك ترى فيه شيئاً ، فقال : نعم انّ رسول الله (صلى الله عليه وآله وسلم) كان اذا رأى هلال شعبان أمر منادياً ينادي في المدينة : يا أهل يثرب انّي رسول رسول الله (صلى الله عليه وآله وسلم)اليكم ألا انّ شعبان شهري فرحم الله من أعانني على شهري . ثمّ قال انّ أمير المؤمنين (عليه السلام) كان يقول : ما فاتني صوم شعبان منذ سمعت منادي رسول الله (عليه السلام) ينادي في شعبان، ولن يفوتني أيّام حياتي صوم شعبان ان شاء الله تعالى ، ثمّ كان (عليه السلام) يقول : صوم شهرين متتابعين توبة من الله.\n\n'
                      'وروى اسماعيل بن عبد الخالق قال : كنت عند الصّادق (عليه السلام)فجرى ذكر صوم شعبان فقال الصّادق (عليه السلام): انّ في فضل صوم شعبان كذا وكذا حتّى انّ الرّجل ليرتكب الدّم الحرام فيغفر له، واعلم انّ ما ورد في هذا الشّهر الشّريف من الاعمال نوعان : أعمال عامّة تؤتى في جميع الشّهر، وأعمال خاصّة تخصّ أيّاماً أو ليالي خاصّة منه، والاعمال العامّة هي ما يلي :',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: 'الاوّل :',
                  subtitle:
                      'أن يقول في كلّ يوم سبعين مرّة: اَسْتَغْفِر اللهَ وَاَسْأَلُهُ التَّوْبَةَ.',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: 'الثّاني :',
                  subtitle:
                      'أن يستغفر كلّ يوم سبعين مرّة قائلاً: اَسْتَغْفِر اللهَ الّذي لا اِلـهَ اِلاَّ هُوَ الرَّحْمنُ الرَّحيمُ الْحَيُّ الْقَيُّومُ وَاَتُوبُ اِلَيْهِ ووردت كلمة (الحي القيّوم) في بعض الرّوايات قبل كلمة (الرَّحْمنُ الرَّحيمُ) وبأيّ الروايتين عمل فقد أحسن الاستغفار، كما يستفاد من الرّوايات أفضل الادعية والاذكار في هذا الشّهر، ومن استغفر في كلّ يوم من هذا الشّهر سبعين مرّة كان كمن استغفر الله سبعين ألف مرّة في سائر الشّهور.',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: 'الثّالث :',
                  subtitle:
                      'أن يتصدّق في هذا الشّهر ولو بنصف تمرة ليحرم الله تعالى جسده على النّار، وعن الصّادق (عليه السلام) انّه سئل عن صوم رجب ، فقال : أين أنتم عن صوم شعبان ، فقال له  الراوي : ياابن رسول الله (صلى الله عليه وآله وسلم) ما ثواب من صام يوماً من شعبان ؟ فقال : الجنّة والله ، فقال الراوي : ما أفضل ما يفعل فيه ، قال: الصّدقة والاستغفار، ومن تصدّق بصدقة في شعبان رباها الله تعالى كما يربى أحدكم فصيله حتّى يوافى يوم القيامة وقد صار مثل أُحد.',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: 'الرّابع :',
                  subtitle:
                      'أن يقول في شعبان ألف مرّة: لا اِلـهَ إلاَّ اللهُ وَلا نَعْبُدُ إِلاّ اِيّاهُ مُخلِصينَ لَهُ الدّينَ وَلَوْ كَرِهَ الْمُشْرِكُونَ ولهذا العمل الشّريف أجر عظيم، ويكتب لمن أتى به عبادة ألف سنة.',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: 'الخامس :',
                  subtitle:
                      'أن يصلّي في كلّ خميس من شعبان ركعتين يقرء في كلّ ركعة فاتحة الكتاب مرّة وقل هو الله احد مائة مرّة فاذا سلّم صلّى على النّبي وآله مائة مرّة، ليقضي الله له كلّ حاجة من أمور دينه ودنياه، ويستحبّ صيامه ايضاً ففي الحديث تتزيّن السّماوات في كلّ خميس من شعبان فتقول الملائكة : الهنا اغفر لصائمه وأجب دعاءه . وفي النبوي : من صام يوم الاثنين والخميس من شعبان قضى الله له عشرين حاجة من حوائج الدّنيا وعشرين حاجة من حوائج الاخرة.',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: 'السّادس :',
                  subtitle: 'الاكثار في هذا الشّهر من الصّلاة على محمّد وآله.',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: 'السّابع :',
                  subtitle:
                      'أن يصلّي عند كلّ زوال من ايّام شعبان وفي ليلة النّصف منه بهذه الصّلوات المرويّة عن السّجاد (عليه السلام) :\n\n'
                      'اَللّـهُمَّ صَلِّ عَلى مُحَمَّد وَآلِ مُحَمَّد، شَجَرَةِ النُّبُوَّةِ، وَمَوْضِعِ الرِّسالَةِ، وَمُخْتَلَفِ الْمَلائِكَةِ، وَمَعْدِنِ الْعِلْمِ، وَاَهْلِ بَيْتِ الْوَحْىِ، اَللّـهُمَّ صَلِّ عَلى مُحَمَّد وَآلِ مُحَمَّد الْفُلْكِ الْجارِيَةِ فِي اللُّجَجِ الْغامِرَةِ، يَأْمَنُ مَنْ رَكِبَها، وَيَغْرَقُ مَنْ تَرَكَهَا، الْمُتَقَدِّمُ لَهُمْ مارِقٌ، وَالْمُتَاَخِّرُ عَنْهُمْ زاهِقٌ، وَاللاّزِمُ لَهُمْ لاحِقٌ، اَللّـهُمَّ صَلِّ عَلى مُحَمَّد وَآلِ مُحَمَّد، الْكَهْفِ الْحَصينِ، وَغِياثِ الْمُضْطَرِّ الْمُسْتَكينِ، وَمَلْجَأِ الْهارِبينَ، وَعِصْمَةِ الْمُعْتَصِمينَ، اَللّـهُمَّ صَلِّ عَلى مُحَمَّد وَآلِ مُحَمَّد صَلاةً كَثيرَةً، تَكُونُ لَهُمْ رِضاً وَلِحَقِّ مُحَمَّد وَآلِ مُحَمَّد اَداءً وَقَضاءً، بِحَوْل مِنْكَ وَقُوَّة يا رَبَّ الْعالَمينَ، اَللّـهُمَّ صَلِّ عَلى مُحَمَّد وَآلِ مُحَمَّد، الطَّيِّبينَ الاَْبْرارِ الاَْخْيارِ، الَّذينَ اَوْجَبْتَ حُقُوقَهُمْ، وَفَرَضْتَ طاعَتَهُمْ وَوِلايَتَهُمْ، اَللّـهُمَّ صَلِّ عَلى مُحَمَّد وَآلِ مُحَمَّد، وَاعْمُرْ قَلْبي بِطاعَتِكَ، وَلا تُخْزِني بِمَعْصِيَتِكَ، وَارْزُقْني مُواساةَ مَنْ قَتَّرْتَ عَلَيْهِ مِنْ رِزْقِكَ بِما وَسَّعْتَ عَلَيَّ مِنْ فَضْلِكَ، وَنَشَرْتَ عَلَيَّ مِنْ عَدْلِكَ، وَاَحْيَيْتَني تَحْتَ ظِلِّكَ، وَهذا شَهْرُ نَبِيِّكَ سَيِّدِ رُسُلِكَ، شَعْبانُ الَّذي حَفَفْتَهُ مِنْكَ بِالرَّحْمَةِ وَالرِّضْوانِ، الَّذي كانَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَآلِه وَسَلَّمَ يَدْاَبُ في صِيامِه وَقِيامِه في لَياليهِ وَاَيّامِه بُخُوعاً لَكَ في اِكْرامِه وَاِعْظامِه اِلى مَحَلِّ حِمامِهِ، اَللّـهُمَّ فَاَعِنّا عَلَى الاْسْتِنانِ بِسُنَّتِه فيهِ، وَنَيْلِ الشَّفاعَةِ لَدَيْهِ، اَللّـهُمَّ وَاجْعَلْهُ لي شَفيعاً مُشَفَّعاً وَطَريقاً اِلَيْكَ مَهيعاً، وَاجْعَلْني لَهُ مُتَّبِعاً حَتّى اَلْقاكَ يَوْمَ الْقِيامَةِ عَنّي راضِياً، وَ عَنْ ذُنُوبي غاضِياً، قَدْ اَوْجَبْتَ لي مِنْكَ الرَّحْمَةَ وَالرِّضْوانَ، وَاَنْزَلْتَني دارَ الْقَرارِ وَمَحَلَّ الاَْخْيارِ.',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: 'الثّامن :',
                  subtitle:
                      'أن يقرأ هذه المناجاة التي رواها ابن خالويه وقال انّها مناجاة أمير المؤمنين والائمة من ولده (عليهم السلام) كانوا يدعون بها في شهر شعبان :\n\n'
                      'اَللّـهُمَّ صَلِّ عَلى مُحَمَّد وَآلِ مُحَمَّد، وَاسْمَعْ دُعائي اِذا دَعَوْتُكَ، وَاْسمَعْ نِدائي اِذا نادَيْتُكَ، وَاَقْبِلْ عَليَّ اِذا ناجَيْتُكَ، فَقَدْ هَرَبْتُ اِلَيْكَ، وَوَقَفْتُ بَيْنَ يَدَيكَ  مُسْتَكيناً، لَكَ مُتَضرِّعاً اِلَيْكَ، راجِياً لِما لَدَيْكَ ثَوابي، وَتَعْلَمُ ما في نَفْسي، وَتَخْبُرُ حاجَتي، وَتَعْرِفُ ضَميري، وَلا يَخْفى عَلَيْكَ اَمْرُ مُنْقَلَبي وَمَثْوايَ، وَما اُريدُ اَنْ اُبْدِيَ بِهِ مِنْ مَنْطِقي، واَتَفَوَّهُ بِهِ مِنْ طَلِبَتي، وَاَرْجُوهُ لِعاقِبَتي، وَقَدْ جَرَتْ مَقاديرُكَ عَليَّ يا سَيِّدي فيما يَكُونُ مِنّي اِلى آخِرِ عُمْري مِنْ سَريرَتي وَعَلانِيَتي، وَبِيَدِكَ لا بِيَدِ غَيْرِكَ زِيادَتي وَنَقْصي وَنَفْعي وَضرّي، اِلـهي اِنْ حَرَمْتَني فَمَنْ ذَا الَّذي يَرْزُقُني، وَاِنْ خَذَلْتَني فَمَنْ ذَا الَّذي يَنْصُرُني، اِلـهي اَعُوذُ بِكَ مِنَ غَضَبِكَ وَحُلُولِ سَخَطِكَ، اِلـهي اِنْ كُنْتُ غَيْرَ مُسْتاْهِل لِرَحْمَتِكَ فَاَنْتَ اَهْلٌ اَنْ تَجُودَ عَليَّ بِفَضْلِ سَعَتِكَ، اِلـهي كَأَنّي بِنَفْسي واقِفَةٌ بَيْنَ يَدَيْكَ وَقَدْ اَظَلَّها حُسْنُ تَوَكُّلي عَلَيْكَ، فَقُلْتَ ما اَنْتَ اَهْلُهُ وَتَغَمَّدْتَني بِعَفْوِكَ، اِلـهي اِنْ عَفَوْتَ فَمَنْ اَوْلى مِنْكَ بِذلِكَ، وَاِنْ كانَ قَدْ دَنا اَجَلي وَلَمْ يُدْنِني مِنْكَ عَمَلي فَقَدْ جَعَلْتُ الاِقْرارَ بِالذَّنْبِ اِلَيْكَ وَسيلَتي، اِلـهي قَدْ جُرْتُ عَلى نَفْسي في النَّظَرِ لَها، فَلَها الْوَيْلُ اِنْ لَمْ تَغْفِرْ لَها، اِلـهي لَمْ يَزَلْ بِرُّكَ عَلَيَّ اَيّامَ حَياتي فَلا تَقْطَعْ بِرَّكَ عَنّي في مَماتي، اِلـهي كَيْفَ آيَسُ مِنْ حُسْنِ نَظَرِكَ لي بَعْدَ مَماتي، وَاَنْتَ لَمْ تُوَلِّني إلاّالْجَميلَ في حَياتي، اِلـهي تَوَلَّ مِنْ اَمْري ما اَنْتَ اَهْلُهُ، وَعُدْ عَلَيَّ بِفَضْلِكَ عَلى مُذْنِب قَدْ غَمَرَهُ جَهْلُهُ، اِلـهي قَدْ سَتَرْتَ عَلَيَّ ذُنُوباً في الدُّنْيا وَاَنَا اَحْوَجُ اِلى سَتْرِها عَلَيَّ مِنْكَ في الاُْخْرى، اِذْ لَمْ تُظْهِرْها لاَِحَد مِنْ عِبادِكَ الصّالِحينَ، فَلاتَفْضَحْني يَوْمَ الْقِيامَةِ عَلى رُؤُوسِ الاَْشْهادِ، اِلـهي جُودُكَ بَسَطَ اَمَلي، وَعفْوُكَ اَفْضَلُ مِنْ عَمَلي، اِلـهي فَسُرَّني بِلِقائِكَ يَوْمَ تَقْضي فيهِ بَيْنَ عِبادِكَ، اِلـهىِ اعْتِذاري اِلَيْكَ اعْتِذارُ مَنْ لَمْ يَسْتَغْنِ عَنْ قَبُولِ عُذْرِهِ، فَاقْبَلْ عُذْري يا اَكْرَمَ مَنِ اعْتَذَرَ اِلَيْهِ الْمُسيئُونَ، اِلـهي لا تَرُدَّ حاجَتي، وَلا تُخَيِّبْ طَمَعي، وَلا تَقْطَعْ مِنْكَ رَجائي وَاَمَلي، اِلـهي لَوْ اَرَدْتَ هَواني لَمْ تَهْدِني، وَلَوْ اَرَدْتَ فَضيحَتي لَمْ تُعافِني، اِلـهي ما اَظُنُّكَ تَرُدُّني في حاجَة قَدْ اَفْنَيْتُ عُمْري في طَلَبَها مِنْكَ، اِلـهي فَلَكَ الْحَمْدُ اَبَداً اَبَداً دائِماً سَرْمَداً، يَزيدُ وَلا يَبيدُ كَما تُحِبُّ وَتَرْضى، اِلـهي اِنْ اَخَذْتَني بِجُرْمي اَخَذْتُكَ بِعَفْوِكَ، وَاِنْ اَخَذْتَني بِذُنُوبي اَخَذْتُكَ بِمَغْفِرَتِكَ، وَاِنْ اَدْخَلْتَني النّارَ اَعْلَمْتُ اَهْلَها اَنّي اُحِبُّكَ، اِلـهي اِنْ كانَ صَغُرَ في جَنْبِ طاعَتِكَ عَمَلي فَقَدْ كَبُرَ في جَنْبِ رَجائِكَ اَمَلي، اِلـهي كيف اَنْقَلِبُ مِنْ عِنْدِكَ بِالَخْيبَةِ مَحْروماً، وَقَدْ كانَ حُسْنُ ظَنّي بِجُودِكَ اَنْ تَقْلِبَني بِالنَّجاةِ مَرْحُوماً، اِلـهي وَقَدْ اَفْنَيْتُ عُمْري في شِرَّةِ السَّهْوِ عَنْكَ، وَاَبْلَيْتُ شَبابي في سَكْرَةِ التَّباعُدِ مِنْكَ، اِلـهي فلَمْ اَسْتَيْقِظْ اَيّامَ اغْتِراري بِكَ وَرُكُوني اِلى سَبيلِ سَخَطِكَ، اِلـهي وَاَنَا عَبْدُكَ وَابْنُ عَبْدِكَ قائِمٌ بَيْنَ يَدَيْكَ، مُتَوَسِّلٌ بِكَرَمِكَ اِلَيْكَ، اِلـهي اَنَا عَبْدٌ اَتَنَصَّلُ اِلَيْكَ، مِمَّا كُنْتُ اُواجِهُكَ بِهِ مِنْ قِلَّةِ اسْتِحْيائي مِنْ نَظَرِكَ، وَاَطْلُبُ الْعَفْوَ مِنْكَ اِذِ الْعَفْوُ نَعْتٌ لِكَرَمِكَ، اِلـهي لَمْ يَكُنْ لي حَوْلٌ فَانْتَقِلَ بِهِ عَنْ مَعْصِيَتِكَ إِلاّ في وَقْت اَيْقَظْتَني لَِمحَبَّتِكَ، وَكَما اَرَدْتَ اَنْ اَكُونَ كُنْتُ، فَشَكَرْتُكَ بِاِدْخالي في كَرَمِكَ، وَلِتَطْهيرِ قَلْبي مِنْ اَوْساخِ الْغَفْلَةِ عَنْكَ، اِلـهي اُنْظُرْ اِلَيَّ نَظَرَ مَنْ نادَيْتَهُ فَاَجابَكَ، وَاْستَعْمَلتُهُ بِمَعونَتِكَ فَاَطاعَكَ، يا قَريباً لا يَبْعُدُ عَنِ المُغْتَرِّ بِهِ، وَيا جَواداً لايَبْخَلُ عَمَّنْ رَجا ثَوابَهُ، اِلـهي هَبْ لي قَلْباً يُدْنيهِ مِنْكَ شَوْقُهُ وَلِساناً يُرْفَعُ اِلَيْكَ صِدْقُهُ، وَنَظَراً يُقَرِّبُهُ مِنْكَ حَقُّهُ، اِلـهي إنَّ مَنْ تَعَرَّفَ بِكَ غَيْرُ مَجْهُول وَمَنْ لاذَ بِكَ غَيْرُ مَخْذُول، وَمَنْ اَقْبَلْتَ عَلَيْهِ غَيْرُ مَمْلُول، اِلـهي اِنَّ مَن انْتَهَجَ بِكَ لَمُسْتَنيرٌ وِاِنَّ مَنِ اعْتَصَمَ بِكَ لَمُسْتَجيرٌ، وَقَدْ لُذْتُ بِكَ يا اِلـهي فَلا تُخَيِّبْ ظَنّي مِنْ رَحْمَتِكَ، وَلا تَحْجُبْني عَنْ رَأفَتِكَ، اِلـهي اَقِمْني في اَهْلِ وِلايَتِكَ مُقامَ مَنْ رَجَا الزِّيادَةَ مِنْ مَحَبَّتِكَ، اِلـهي وَاَلْهِمْني وَلَهاً بِذِكْرِكَ اِلى ذِكْرِكَ وَهَمَّتي في رَوْحِ نَجاحِ اَسْمائِكَ وَمَحَلِّ قُدْسِكَ، اِلـهي بِكَ عَلَيْكَ إلاّ اَلْحَقْتَني بِمَحَلِّ اَهْلِ طاعَتِكَ وَالْمَثْوىَ الصّالِحِ مِنْ مَرْضاتِكَ، فَاِنّي لا اَقْدِرُ لِنَفْسي دَفْعاً، وَلا اَمْلِكُ لَها نَفْعاً، اِلـهي اَنَا عَبْدُكَ الضَّعيفُ الْمُذْنِبُ، وَمَمْلُوكُكَ الْمُنيبُ، فَلا تَجْعَلْني مِمَّنْ صَرَفتَ عَنْهُ وَجْهَكَ، وَحَجَبَهُ سَهْوُهُ عَنْ عَفْوِكَ، اِلـهي هَبْ لي كَمالَ الانْقِطاعِ اِلَيْكَ، وَاَنِرْ اَبْصارَ قُلُوبِنا بِضِياءِ نَظَرِها اِلَيْكَ، حَتّى تَخْرِقَ اَبْصارُ الْقُلُوبِ حُجُبَ النُّورِ فَتَصِلَ اِلى مَعْدِنِ الْعَظَمَةِ، وَتَصيرَ اَرْواحُنا مُعَلَّقَةً بِعِزِّ قُدْسِكَ، اِلـهي وَاْجَعَلْني مِمَّنْ نادَيْتَهُ فَاَجابَكَ، وَلاحَظْتَهُ فَصَعِقَ لِجَلالِكَ، فَناجَيْتَهُ سِرّاً وَعَمِلَ لَكَ جَهْراً، اِلـهي لَمْ اُسَلِّطْ عَلى حُسْنِ ظَنّي قُنُوطَ الاِْياسِ، وَلاَ انْقَطَعَ رَجائي مِنْ جَميلِ كَرَمِكَ، اِلـهي اِنْ كانَتِ الْخَطايا قَدْ اَسْقَطَتْني لَدَيْكَ، فَاصْفَحْ عَنّي بِحُسْنِ تَوَكُّلي عَلَيْكَ، اِلـهي اِنْ حَطَّتْني الذُّنوبُ مِنْ مَكارِمِ لُطْفِكَ، فَقَدْ نَبَّهَني الْيَقينُ اِلى كَرَمِ عَطْفِكَ، اِلـهي اِنْ اَنَامَتْنِى الْغَفْلَةُ عَنِ الاسْتْعِدادِ لِلِقائِكَ، فَقَدْ نَبَّهَني، الْمَعْرِفَةُ بِكَرَمِ آلائِكَ، اِلـهي اِنْ دَعاني اِلى النّارِ عَظيْمُ عِقابِكَ، فَقَدْ دَعاني اِلَى الْجَنَّةِ جَزيلُ ثَوابِكَ اِلـهي فَلَكَ اَسْأَلُ وَاِلَيْكَ اَبْتَهِلُ وَاَرْغَبُ، وَاَساَلُكَ اَنْ تُصَلِّيَ عَلى مُحَمَّد وَآلِ مُحَمَّد، وَاَنْ تَجْعَلَني مِمَّنْ يُديمُ ذِكَرَكَ، وَلا يَنْقُضُ عَهْدَكَ، وَلايَغْفُلُ عَنْ شُكْرِكَ، وَلا يَسْتَخِفُّ بِاَمْرِكَ، اِلـهي وَاَلْحِقْني بِنُورِ عِزِّكَ الاَْبْهَجِ، فَاَكُونَ لَكَ عارِفاً، وَعَنْ سِواكَ مُنْحَرِفاً، وَمِنْكَ خائِفاً مُراقِباً، يا ذَالْجَلالِ وَالاِكْرامِ، وَصَلَّى اللهُ عَلى مُحَمَّد رَسُولِهِ وَآلِهِ الطّاهِرينَ وَسَلَّمَ تَسْليماً كَثيراً.\n\n'
                      'وهذه مناجاة جليلة القدر مَنسُوبة الى أئمتنا (عليهم السلام) مشتملة على مضامين عالية ويحسن أن يدعى بها عند حضور القلب متى ما كان.',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: '',
                  subtitle: '',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
            ],
          ),
        ),
        bottomNavigationBar: AddCustomBottomNavigationBar(
        pushNext: AllaylaAl2oulaSha3ban.screenRoute,
        pushBack: A3malMaBakyaMenAlshaher.screenRoute,
        soud: '',
        onTap: (double fontSize) {
          // تحديث حجم الخط
          setState(() {
            isTablet ? _fontSizeTablet = fontSize : _fontSize = fontSize;
          });
          print('fontSize: $fontSize');
          // إغلاق Dialog
          Navigator.of(context).pop();
        },
        onLongPress: () {
          final snackBar = SnackBar(
            content: Center(
              child: Text(
                '${isTablet ? _fontSizeTablet.toInt() : _fontSize.toInt()}',
                style: TextStyle(
                  color: Colors.white,
                  fontSize: 16,
                ),
              ),
            ),
            width: 60,
            behavior: SnackBarBehavior.floating,
            backgroundColor: Colors.blue,
            duration: Duration(seconds: 2),
            shape: ShapeBorder.lerp(
              RoundedRectangleBorder(
                borderRadius: BorderRadius.circular(50),
              ),
              RoundedRectangleBorder(
                borderRadius: BorderRadius.circular(50),
              ),
              1,
            ),
          );
          ScaffoldMessenger.of(context).showSnackBar(snackBar);
        },
      ),
      ),
    );
  }
}
