import 'package:flutter/material.dart';
import 'package:maktabat_almoslim/widgets/container_scrollview.dart';
import 'package:provider/provider.dart';
import 'package:shared_preferences/shared_preferences.dart';

import '../../../../widgets/add_custom_bottom_navigation_bar.dart';
import '../../../../widgets/list_of_nine_verses.dart';
import '../../../favorites_provider.dart';
import '../../../favorites_screen.dart';
import '../sha3ban.dart';
import 'allayla_alsalisa_3ashara_sha3ban.dart';
import 'yawm_alnisf_men_sha3ben.dart';

class LaylatAlnisfMenSha3ben extends StatefulWidget {
  static String screenRoute = 'lailat_alnisf_men_sha3ban_screen';
  const LaylatAlnisfMenSha3ben({super.key});

  @override
  State<LaylatAlnisfMenSha3ben> createState() => _LaylatAlnisfMenSha3benState();
}

double _fontSize = 18;
double _fontSizeTablet = 30;

class _LaylatAlnisfMenSha3benState extends State<LaylatAlnisfMenSha3ben> {
  bool isIcon = true;
  @override
  void initState() {
    super.initState();
    _loadFavoriteState();
  }

  Future<void> _loadFavoriteState() async {
    final prefs = await SharedPreferences.getInstance();
    bool? savedState =
        prefs.getBool('isFavorite_lailat_alnisf_men_sha3ban_screen');
    setState(() {
      isIcon = savedState ?? true;
    });
  }

  Future<void> _saveFavoriteState(bool value) async {
    final prefs = await SharedPreferences.getInstance();
    await prefs.setBool('isFavorite_lailat_alnisf_men_sha3ban_screen', value);
  }

  Future<bool> _onWillPop() async {
    final args =
        ModalRoute.of(context)!.settings.arguments as Map<String, dynamic>?;
    final previousPage = args?['previousPage'];
    if (previousPage == 'favorite_screen') {
      Navigator.of(context).pushReplacementNamed(FavoritesScreen.screenRoute);
      return false;
    } else {
      Navigator.of(context).pushReplacementNamed(Sha3ban.screenRoute);
      return false;
    }
  }

  @override
  Widget build(BuildContext context) {
    double size = MediaQuery.of(context).textScaleFactor;
    final screenWidth = MediaQuery.of(context).size.width;
    final isTablet = screenWidth >= 600;
    return WillPopScope(
      onWillPop: _onWillPop,
      child: Scaffold(
        appBar: AppBar(
          toolbarHeight: isTablet ? 100 : 50,
          centerTitle: true,
          leading: IconButton(
            onPressed: _onWillPop,
            icon: Icon(
              Icons.arrow_back,
              size: isTablet ? 50 : 25,
            ),
          ),
          actions: [
            IconButton(
              padding: EdgeInsets.only(left: isTablet ? 50 : 30),
              icon: Icon(
                isIcon ? Icons.favorite_border : Icons.favorite_rounded,
                size: isTablet ? 40 : 25,
                color: isIcon ? Colors.black : Colors.red,
              ),
              onPressed: () async {
                setState(() {
                  isIcon = !isIcon;
                });
                await _saveFavoriteState(isIcon);

                if (!isIcon) {
                  Provider.of<FavoritesProvider>(context, listen: false)
                      .addFavorite('ليلة النصف من شعبان',
                          LaylatAlnisfMenSha3ben.screenRoute);
                } else {
                  Provider.of<FavoritesProvider>(context, listen: false)
                      .removeFavorite(
                          'ليلة النصف من شعبان',
                          LaylatAlnisfMenSha3ben.screenRoute,
                          LaylatAlnisfMenSha3ben.screenRoute);
                }
              },
            ),
          ],
          title: Text(
            'ليلة النصف من شعبان',
            style: TextStyle(
              fontSize: isTablet
                  ? 40
                  : size > 1.0
                      ? 20
                      : 23,
              fontWeight: FontWeight.bold,
            ),
          ),
        ),
        body: ContainerScrollview(
          widget: Column(
            crossAxisAlignment: CrossAxisAlignment.start,
            children: [
              Container(
                child: Column(
                  children: [
                    Center(
                      child: Text(
                        'بسم الله الرحمن الرحيم',
                        style: TextStyle(
                          fontSize: isTablet ? _fontSizeTablet : _fontSize,
                          fontWeight: FontWeight.w900,
                        ),
                      ),
                    ),
                    Center(
                      child: Text(
                        'اللهم صلِّ على محمد وآل محمد',
                        style: TextStyle(
                          fontSize: isTablet ? _fontSizeTablet : _fontSize,
                          fontWeight: FontWeight.w900,
                        ),
                      ),
                    ),
                  ],
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: '',
                  subtitle:
                      'وهي ليلة بالغة الشّرف وقد روى عن الصّادق (عليه السلام) قال : سُئل الباقر (عليه السلام) عن فضل ليلة النّصف من شعبان ، فقال (عليه السلام) : هي أفضل اللّيالي بعد ليلة القدر، فيها يمنح الله العباد فضله ويغفر لهم بمنّه، فاجتهدوا في القربة الى الله تعالى فيها فانّها ليلة آلى الله عزوجل على نفسه أن لا يردّ سائلاً فيها ما لم يسأل الله المعصية، وانّها اللّيلة التي جعلها الله لنا أهل البيت بازاء ما جعل ليلة القدر لنبيّنا (عليه السلام)، فاجتهدوا في دعاء الله تعالى والثّناء عليه، الخبر ومن عظيم بركات هذه اللّيلة المباركة انّها ميلاد سلطان العصر وامام الزّمان أرواحنا له الفداء، ولد عند السّحر سنة خمس وخمسين ومائتين في سرّ مَن رأى، وهذا ما يزيد هذه اللّيلة شرفاً وفضلاً وقد ورد فيها أعمال :',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: 'أوّلها :',
                  subtitle: 'الغسل ، فانّه يوجب تخفيف الذّنوب.',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: 'الثّاني :',
                  subtitle:
                      'احياؤها بالصّلاة والدّعاء والاستغفار كما كان يصنع الامام زين العابدين (عليه السلام)، وفي الحديث من أحيا هذه اللّيلة لم يمت قلبه يوم تموت فيه القلوب.',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: 'الثّالث :',
                  subtitle:
                      'زيارة الحسين (عليه السلام) وهي أفضل أعمال هذه اللّيلة، وتوجب غفران الذّنوب، ومن أراد أن يصافحه أرواح مائة وأربعة وعشرين ألف نبيّ فليزره (عليه السلام) في هذه اللّيلة، وأقلّ ما يزار به (عليه السلام) أن يصعد الزائر سطحاً مرتفعاً فينظر يمنة ويسرة ثمّ يرفع رأسه الى السّماء فيزوره (عليه السلام) بهذه الكلمات :\n\n'
                      'اَلسَّلامُ عَلَيْكَ يا اَبا عَبْدِ اللهِ، السَّلامُ عَلَيْكَ وَرَحْمَةُ اللهِ وَبَرَكاتُهُ، ويرجى لمن زار الحسين (عليه السلام)حيثما كان بهذه الزيارة أن يكتب له أجر حجّة وعمرة، ونحن سنذكر في باب الزّيارات ما يختصّ بهذه اللّيلة منها ان شاء الله تعالى.',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: 'الرّابع :',
                  subtitle:
                      'أن يدعو بهذا الدّعاء الذي رواه الشّيخ والسّيد وهو بمثابة زيارة للامام الغائب صلوات الله عليه :\n\n'
                      'اَللّـهُمَّ بِحَقِّ لَيْلَتِنا وَمَوْلُودِها، وَحُجَّتِكَ وَمَوْعُودِها، الَّتي قَرَنْتَ اِلى فَضْلِها، فَضْلاً فَتَمَّتْ كَلِمَتُكَ صِدْقاً وَعَدْلاً لا مُبَدِّلَ لِكَلِماتِكَ، وَلا مُعَقِّبَ لاِياتِكَ، نُورُكَ الْمُتَاَلِّقُ، وَضِياؤُكَ الْمُشْرِقُ، وَالْعَلَمُ النُّورُ في طَخْياءِ الدَّيْجُورِ، الْغائِبُ الْمَسْتُورُ، جَلَّ مَوْلِدُهُ وَكَرمَ مَحْتِدُهُ، وَالْمَلائِكَةُ شُهَّدُهُ، وَاللهُ ناصِرُهُ وَمُؤَيِّدُهُ، اِذا آن ميعادُهُ، وَالْمَلائِكَةُ اَمْدادُهُ، سَيْفُ الله الَّذي لا يَنْبُو، وَنُورُهُ الَّذي لا يَخْبُو، وَذُو الْحِلْمِ الَّذي لا يَصْبُو، مَدارُ الَّدهْرِ، وَنَواميسُ الْعَصْرِ، وَوُلاةُ الاَْمْرِ، وَالْمُنَزَّلُ عَلَيْهِمْ ما يَتَنَزَّلُ في لَيْلَةِ الْقَدْرِ، وَاَصْحابُ الْحَشْرِ وَالنَّشْرِ، تَراجِمَةَ وَحْيِهِ، وَوُلاةُ اَمْرِهِ وَنَهْيِهِ، اَللّـهُمَّ فَصَلِّ عَلى خاتِمِهم وَقائِمِهِمْ الْمَسْتُورِ  عَوالِمِهِمْ، اَللّـهُمَّ وَاَدْرِكَ بِنا أَيّامَهُ وَظُهُورَهُ وَقِيامَهُ، وَاجْعَلْنا مِنْ اَنْصارِهِ، وَاقْرِنْ ثارَنا بِثارِهِ، وَاكْتُبْنا في اَعْوانِهِ وَخُلَصائِهِ، وَاَحْيِنا في دَوْلَتِهِ ناعِمينَ، وَبِصُحْبَتِهِ غانِمينَ وَبِحَقِّهِ قائِمينَ، وَمِنَ السُّوءِ سالِمينَ، يا اَرْحَمَ الرّاحِمينَ، وَالْحَمْدُ للهِ رَبِّ الْعالَمينَ وَصَلَواتُهُ عَلى سَيِّدِنا مُحَمَّد خاتَمِ النَّبِيّينَ وَالْمُرْسَلينَ، وَعَلى اَهْلِ بَيْتِهِ الصّادِقينَ وَعِتْرَتِهَ النّاطِقينَ، وَالْعَنْ جَميعَ الظّالِمينَ، واحْكُمْ بَيْنَنا وَبَيْنَهُمْ يا اَحْكَمَ الْحاكِمينَ.',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: 'الخامس :',
                  subtitle:
                      'روى الشّيخ عن اسماعيل بن فضل الهاشمي قال : علّمني الصّادق (عليه السلام)هذا الدّعاء لادعو به ليلة النّصف من شعبان :\n\n'
                      'اَللّـهُمَّ اَنْتَ الْحَيُّ الْقَيُّومُ، الْعَلِيُّ الْعَظيمُ، الْخالِقُ الرّازِقُ، الُْمحْيِي الْمُميتُ، الْبَديءُ الْبَديعُ، لَكَ الْجَلالُ، وَلَكَ الْفَضْلُ، وَلكَ الْحَمْدُ، وَلَكَ الْمَنُّ، وَلَكَ الْجُودُ، وَلَكَ الْكَرَمُ، وَلَكَ الاَْمْرُ، وَلَكَ الَمجْدُ، وَلَكَ الْشُّكْرُ، وَحْدَكَ لا شَريكَ لَكَ، يا واحِدُ يا اَحَدُ، يا صَمَدُ، يا مَنْ لَمْ يَلِدْ وَلَمْ يُولَدْ وَلَمْ يَكُنْ لَهُ كُفُواً اَحَدٌ، صَلِّ عَلى مُحَمَّد وَآلِ مُحَمَّد، وَاْغفِرْ لي وَارْحَمْني، وَاكْفِني ما اَهَمَّني، وَاقْضِ دَيْني، وَوَسِّعْ عَليَّ في رِزْقي، فَاِنَّكَ في هذِهِ اللَّيْلَةِ كُلَّ اَمْر حَكيم تَفْرُقُ، وَمَنْ تَشاءُ مِنْ خلْقِكَ تَرْزُقُ، فَارْزُقْني وَاَنْتَ خَيْرُ الرّازِقينَ، فَاِنَّكَ قُلْتَ وَاَنْتَ خَيْرُ الْقائِلينَ النّاطِقينَ واسْأَلُو اللهَ مِنْ فَضْلِهِ، فَمِنْ فَضْلِكَ أسْأَلُ، وَاِيّاكَ قَصَدْتُ، وابْنَ نَبِيِّكَ اعْتَمَدْتُ، وَلَكَ رَجَوْتُ، فَارْحَمْني يا اَرْحَمَ الرّاحِمينَ.',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: 'السّادس :',
                  subtitle:
                      'اُدع بهذا الدّعاء الذي كان يدعو به النّبي (صلى الله عليه وآله وسلم) في هذه الليلة :\n\n'
                      'اَللّـهُمَّ اقْسِمْ مِنْ خَشْيَتِكَ ما يَحُولُ بَيْنَنا وَبَيْنَ مَعْصِيَتِكَ، وَمِنْ طْاعَتِكَ ما تُبَلِّغُنا بِهِ رِضْوانَكَ، وَمِنَ الْيَقينِ ما يَهُونُ عَلَيْنا بِهِ مُصيباتُ الدُّنْيا، اَللّـهُمَّ اَمْتِعْنا بِاَسْماعِنا وَاَبْصارِنا وَقُوَّتِنا ما اَحْيَيْتَنا، وَاجْعَلْهُ الْوارِثَ مِنّا، واجْعَلْ ثأرَنا عَلى مَنْ ظَلَمَنا، وَانْصُرنا عَلى مَنْ عادانا، وَلا تَجْعَلْ مُصيبَتَنا في دينِنا، وَلا تَجْعَلِ الدُّنْيا اَكْبَرَ هَمِّنا، وَلا مَبْلَغَ عِلْمِنا، وَلا تُسَلِّطْ عَلَيْنا مَنْ لا يَرْحَمُنا، بِرَحْمَتِكَ يا اَرْحَمَ الرّاحِمينَ.\n\n'
                      'وهذه من الدّعوات الجامعات الكاملات ويغتنم الدّعاء به في سائر الاوقات، وفي كتاب عوالي اللئالي انّ النّبي (صلى الله عليه وآله وسلم) كان يدعو بهذا الدّعاء في كافّة الاوقات.',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: 'السّابع :',
                  subtitle:
                      'أن يقرأ الصّلوات التي يدعى بها عند الزّوال في كلّ يوم.',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: 'الثّامن :',
                  subtitle:
                      'أن يدعو بدعاء كميل الذي اثبتناه في الباب الاوّل من الكتاب، وهو وارد في هذه الليلة.',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: 'التّاسع :',
                  subtitle:
                      'أن يذكر الله بكلّ من هذه الاذكار مائة مرّة، سُبْحانَ اللهِ وَالْحَمْدُ للهِ وَلا اِلـهَ إلاَّ اللهُ واللهُ اَكْبَرُ ليغفر الله له ما سلف من معاصيه، ويقضي له حوائج الدّنيا والاخرة.',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: 'العاشر :',
                  subtitle:
                      'روى الشّيخ في المصباح عن أبي يحيى في حديث في فضل ليلة النّصف من شعبان انّه قال : قلت لمولاي الصّادق (عليه السلام) : ما هو أفضل الادعية في هذه اللّيلة، فقال : اذا صلّيت العشاء فصلّ ركعتين تقرأ في الاُولى الحمد وسورة الجحد وهي سورة «قل يا أيّها الكافرون»، وفي الثّانية الحمد وسورة التّوحيد وهي سورة «قُلْ هُوَ اللهُ أحَدٌ»، فاذا سلّمت قلت: «سُبْحانَ اللهِ» ثلاثاً وثلاثين مرّة، و«الْحَمْدُ للهِ» ثلاثاً وثلاثين مرّة، و «اللهُ اَكْبَرُ» أربعاً وثلاثين مرّة، ثمّ قل :\n\n'
                      'يا مَنْ اِلَيْهِ مَلْجَأُ الْعِبادِ في الْمُهِمّاتِ، وَاِلَيْهَ يَفْزَعُ الْخَلْقُ فىِ الْمُلِمّاتِ، يا عالِمَ الْجَهْرِ وَالْخَفِيّاتِ، يا مَنْ لا تَخْفى عَلَيْهِ خَواطِرُ الاَْوْهامِ وَتَصَرُّفُ الْخَطَراتِ، يا رَبَّ الْخَلايِقِ وَالْبَرِيّاتِ، يا مَنْ بِيَدِهِ مَلَكُوتُ الاَْرَضينَ وَالسَّماواتِ، اَنْتَ اللهُ لا اِلـهَ إِلاّ اَنْتَ، اَمُتُّ اِلَيْكَ بِلا اِلـهَ إِلاّ اَنْتَ، فَيا لا اِلـهَ اِلاّ اَنْتَ اجْعَلْني في هِذِهِ اللَّيْلَةِ مِمَّنْ نَظَرْتَ اِلَيْهِ فَرَحِمْتَهُ وَسَمِعْتَ دُعاءَهُ فَاَجَبْتَهُ، وَعَلِمْتَ اسْتِقالَتَهُ فَاَقَلْتَهُ، وَتَجاوَزْتَ عَنْ سالِفِ خَطيئَتِهِ وَعَظيمِ جَريرَتِهِ، فَقَدِ اسْتَجَرْتُ بِكَ مِنْ ذُنُوبي، وَلَجَأتُ اِلَيْكَ في سَتْرِ عُيُوبي، اَللّـهُمَّ فَجُدْ عَلَيَّ بِكَرَمِكَ وَفَضْلِكَ، وَاحْطُطْ خَطايايَ بِحِلْمِكَ وَعَفْوِكَ، وَتَغَمَّدْني في هذِهِ اللَّيْلَةِ بِسابِغِ كَرامَتِكَ، وَاجْعَلْني فيها مِنْ اَوْلِيائِكَ الَّذينَ اجْتَبَيْتَهُمْ لِطاعَتِكَ، واخْتَرْتَهُمْ لِعِبادَتِكَ، وَجَعَلْتَهُمْ خالِصَتَكَ وَصِفْوَتَكَ، اَللّـهُمَّ اجْعَلْني مِمَّنْ سَعَدَ جَدُّهُ، وَتَوَفَّرَ مِنَ الْخَيْراتِ حَظُّهُ، وَاجْعَلْني مِمَّنْ سَلِمَ فَنَعِمَ، وَفازَ فَغَنِمَ، وَاكْفِني شَرَّ ما اَسْلَفْتُ، وَاعْصِمْني مِنَ الاْزدِيادِ في مَعْصِيَتِكَ، وَحَبِّبْ اِلَيَّ طاعَتَكَ وَما يُقَرِّبُني مِنْكَ وَيُزْلِفُني عِنْدَكَ، سَيِّدي اِلَيْكَ يَلْجَأُ الْهارِبُ، وَمِنْكَ يَلْتَمِسُ الطّالِبُ، وَعَلى كَرَمِكَ يُعَوِّلُ الْمُسْتَقْيِلُ التّائِبُ، اَدَّبْتَ عِبادَكَ بالتَّكَرُّمِ، وَاَنْتَ اَكْرَمُ الاَْكْرَمينَ، وَاَمَرْتَ بِالْعَفْوِ عِبادَكَ وَاَنْتَ الْغَفُورُ الَّرحيمُ، اَللّـهُمَّ فَلاتَحْرِمْني ما رَجَوْتُ مِنْ كَرَمِكَ، وَلا تُؤْيِسْني مِنْ سابِغِ نِعَمِكَ، وَلا تُخَيِّبْني مِنْ جَزيلِ قِسْمِكَ في هذِهِ اللَّيْلَةِ لاَِهْلِ طاعَتِكَ، وَاجْعَلْني في جُنَّة مِنْ شِرارِ بَرِيَّتِكَ، رَبِّ اِنْ لَمْ اَكُنْ مِنْ اَهْلِ ذلِكَ فَاَنْتَ اَهْلُ الْكَرَمِ وَالْعَفْوِ وَالْمَغْفِرَةِ، وَجُدْ عَلَيَّ بِما اَنْتَ اَهْلُهُ لا بِما اَسْتَحِقُّهُ، فَقَدْ حَسُنَ ظَنّي بِكَ، وَتَحَقَّقَ رَجائي لَكَ، وَعَلِقَتْ نَفْسي بِكَرَمِكَ، فَاَنْتَ اَرْحَمُ الرّاحِمينَ وَاَكْرَمُ الاَْكْرَمينَ، اَللّـهُمَّ واخْصُصْني مِنْ كَرمِكَ بِجَزيلِ قِسْمِكَ، وَاَعُوذُ بِعَفْوِكَ مِنْ عُقُوبَتِكَ، وَاغْفِر لِيَ الَّذنْبَ الَّذي يَحْبِسُ عَلَيَّ الْخُلُقَ، وَيُضَيِّقُ عَليَّ الرِّزْقَ، حَتى اَقُومَ بِصالِحِ رِضاكَ، وَاَنْعَمَ بِجَزيلِ عَطائِكَ، وَاَسْعَدَ بِسابِغِ نَعْمائِكَ، فَقَدْ لُذْتُ بِحَرَمِكَ، وَتَعَرَّضْتُ لِكَرَمِكَ، واَسْتَعَذْتُ بِعَفْوِكَ مِنْ عُقُوبَتِكَ، وَبِحِلْمِكَ مِنْ غَضَبِكَ، فَجُدْ بِما سَأَلْتُكَ وَاَنِلْ مَا الَْتمَسْتُ مِنْكَ، اَساَلُكَ بِكَ لا بِشَيء هُوَ اَعْظَمُ مِنْكَ.\n\n'
                      'ثمّ تسجد وتقول : «يا رَبُّ» عشرين مرّة، «يا اَللهُ» سبع مرّات، «لا حَوْلَ وَلا قُوَّةَ إِلاّ بِاللهِ» سبع مرّات، «مآ شاءَ اللهُ» عشر مرّات، «لا قُوّةَ إِلاّ بِاللهِ» عشر مرّات، ثمّ تصلّي على النّبي (صلى الله عليه وآله وسلم) وآله وتسأل حاجتك فو الله لو سألت بها بعدد القطر لبلّغك الله عزوجل ايّاها بكرمه وفضله.',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: 'الحادي عشر :',
                  subtitle:
                      'اِلـهي تَعَرَّضَ لَكَ في هذَ اللَّيْلِ الْمُتَعَرِّضُونَ، وَقَصَدَكَ الْقاصِدُونَ، وَاَمَّلَ فَضْلَكَ وَمَعْرُوفَكَ الطّالِبُونَ، وَلَكَ في هذَا اللّيْلِ نَفَحاتٌ وَجَوائِزُ وَعَطايا وَمَواهِبُ تَمُنُّ بِها عَلى  مَنْ تَشاءُ مِنْ عِبادِكَ، وَتَمْنَعُها مَنْ لَمْ تَسْبِقْ لَهُ الْعِنايَةُ مِنْكَ، وَها اَنَا ذا عُبَيْدُكَ الْفَقيرُ اِلَيْكَ، الْمُؤَمِّلُ فَضْلَكَ وَمَعْرُوفَكَ، فَاِنْ كُنْتَ يا مَولايَ تَفَضَّلْتَ في هذِهِ اللَّيْلَةِ عَلى اَحَد مِنْ خَلْقِكَ، وَعُدْتَ عَلَيْهِ بِعائِدَة مِنْ عَطْفِكَ، فَصَلِّ عَلى مُحَمَّد وَآلِ مُحَمَّد الطَّيِّبينَ الطّاهِرينَ، الْخَيِّرينَ الْفاضِلينَ، وَجُدْ عَلَيَّ بِطَولِكَ وَمَعْرُوفِكَ يا رَبَّ الْعالَمينَ، وَصَلَّى اللهُ عَلى مُحَمَّد خاتَمِ النَّبيّينَ وَآلِهِ الطّاهِرينَ وَسَلَّمَ تَسْليماً، اِنَّ اللهَ حَميدٌ مَجيدٌ، اَللّـهُمَّ اِنّي اَدْعُوكَ كَما اَمَرْتَ فَاسْتَجِبْ لي كَما وَعَدْتَ اِنَّكَ لا تُخْلِف الْميعادَ.\n\n'
                      'وهذا دعاء يدعى به في الاسحار عقيب صلاة الشّفع.',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: 'الثّاني عشر :',
                  subtitle:
                      'أن يدعو بعد كلّ ركعتين من صلاة اللّيل وبعد الشّفع والوتر بما رواه الشّيخ والسّيد.',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: 'الثّالث عشر :',
                  subtitle:
                      'أن يسجد السّجدات ويدعو بالدّعوات المأثورة عن النّبي (صلى الله عليه وآله وسلم)منها رواه الشّيخ، عن حماد بن عيسى، عن أبان بن تغلب قال : قال الصّادق صلوات الله وسلامه عليه : كان ليلة النّصف من شعبان وكان رسول الله (صلى الله عليه وآله وسلم)عند عايشة، فلمّا انتصف اللّيل قام رسول الله (صلى الله عليه وآله وسلم) عن فراشه، فلمّا انتبهت وجدت رسول الله (صلى الله عليه وآله وسلم)قد قام عن فراشها فداخلها ما يدخل النّساء أي الغيرة، وظنّت انّه قد قام الى بعض نسائه، فقامت وتلفّفت بشملتها وايم الله ما كانت قزّاً ولا كتاناً ولا قطناً ولكن سداه شعراً ولحمته أوبار الابل، فقامت تطلب رسول الله (صلى الله عليه وآله وسلم) في حجر نسائه حجرة حجرة فبينا هي كذلك اذ نظرت الى رسول الله (صلى الله عليه وآله وسلم) ساجداً كثوب متلبّد بوجه الارض فدنت منه قريباً فسمعته يقول في سجوده :\n\n'
                      'سَجَدَ لَكَ سَوادي وَخَيالي، وَآمَنَ بِكَ فؤادي، هذِهِ يَدايَ وَماجَنَيْتُهُ عَلى نَفْسي، يا عَظيمُ تُرْجى لِكُلِّ عَظيم، اِغْفِرْ لِيَ الْعَظيمَ فَاِنَّهُ لايَغْفِرُ الذَّنْبَ الْعَظيمَ إِلاّ الرَّبُّ الْعَظيم . ثمّ رفع رأسه وأهوى ثانياً الى السّجود وسمعته عايشة يقول :\n\n'
                      'اَعُوذُ بُنُورِ وَجْهِكَ الَّذي اَضاءَتْ لَهُ السَّماواتُ وَالاَْرَضُونَ، وانْكَشَفَتْ لَهُ الظُّلُماتُ، وَصَلَحَ عَلْيْهِ اَمرُ الاَْوَّلينَ وَالاْخِرينَ، مِنْ فُجْأَةِ نِقْمَتِكَ، وَمِنْ تَحْويلِ عافِيَتِكَ، وَمِنْ زَوالِ نِعْمَتِكَ، اَللّـهُمَّ ارْزُقْني قَلْباً تَقِيّاً نَقِيّاً، وَمِنَ الشِّرْكِ بَرياً لا كافِراً وَلا شَقِياً . ثمّ عفّر خدّيه في التّراب وقال : عَفَّرْتُ وَجْهي فِي التُرابِ وَحُقَّ لي اَنْ اَسْجُدَ لَكَ، فلمّا همّ رسول الله (صلى الله عليه وآله وسلم) بالانصراف هرولت الى فراشها وأتى النبي (صلى الله عليه وآله وسلم) الى الفراش وسمعها تتنفّس أنفاساً عالية، فقال لها رسول الله (صلى الله عليه وآله وسلم): ما هذا النّفس العال تعلمين أي ليلة هذه، ليلة النّصف من شعبان، فيها تقسم الارزاق، وفيها تكتب الاجال، وفيها يكتب وفد الحاج، وانّ الله تعالى ليغفر في هذه اللّيلة من خلقه اكثر من شعر معزي قبيلة كلب، وينزل الله ملائكة من السّماء الى الارض بمكّة.',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: 'الرّابع عشر :',
                  subtitle:
                      'أن يصلّي صلاة جعفر كما رواه الشّيخ عن الرّضا صلوات الله عليه.',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: 'الخامس عشر :',
                  subtitle:
                      'أن يأتي بما ورد في هذه اللّيلة من الصّلوات وهي كثيرة منها ما رواها أبو يحيى الصّنعاني عن الباقر والصّادق (عليهما السلام) ورواها عنهما ايضاً ثلاثون نفر ممّن يوثق بهم ويعتمد عليهم قالوا : قالا (عليهما السلام) : اذا كانت ليلة النّصف من شعبان فصلّ أربع ركعات تقرأ في كلّ ركعة الحمد وقُلْ هُوَ اللهُ أحَدٌ مرّة فاذا فرغت فقُل :\n\n'
                      'اَللّـهُمَّ اِنّي اِلَيْكَ فَقيرٌ، وَمِنْ عَذاِبكَ خائِفٌ مُسْتَجيرٌ، اَللّـهُمَّ لا تُبَدِّلِ اسمي، وَلا تُغَيِّرْ جِسْمي، وَلاتَجْهَدْ بَلائي، وَلاتُشْمِتْ بي اَعْدائي، اَعُوذُ بِعَفْوِكَ مِنْ عِقابِكَ، وَاَعُوذُ بِرَحْمَتِكَ مِنْ عَذابِكَ، وَاَعُوذُ بِرِضاكَ مِنْ سَخَطِكَ، وَاعُوذُ بِكَ مِنْكَ، جَلَّ ثَناؤُكَ، اَنْتَ كَما اَثْنَيْتَ عَلى نَفْسِكَ وَفَوقَ مايَقُولُ الْقائِلُونَ.\n\n'
                      'واعلم انّه قد ورد في الحديث فضل كثير لصلاة مائة ركعة في هذه اللّيلة تقرأ في كلّ ركعة الحمد مرّة والتّوحيد عشر مرّات وقد مرّ في أعمال شهر رجب صفة الصّلاة ستّ ركعات في هذه اللّيلة يقرأ فيها سورة الحمد ويس وتبارك والتّوحيد.',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
            ],
          ),
        ),
        bottomNavigationBar: AddCustomBottomNavigationBar(
        pushNext: YawmAlnisfMenSha3ben.screenRoute,
        pushBack: AllaylaAlsalisa3asharaSha3ban.screenRoute,
        soud: '',
        onTap: (double fontSize) {
          // تحديث حجم الخط
          setState(() {
            isTablet ? _fontSizeTablet = fontSize : _fontSize = fontSize;
          });
          print('fontSize: $fontSize');
          // إغلاق Dialog
          Navigator.of(context).pop();
        },
        onLongPress: () {
          final snackBar = SnackBar(
            content: Center(
              child: Text(
                '${isTablet ? _fontSizeTablet.toInt() : _fontSize.toInt()}',
                style: TextStyle(
                  color: Colors.white,
                  fontSize: 16,
                ),
              ),
            ),
            width: 60,
            behavior: SnackBarBehavior.floating,
            backgroundColor: Colors.blue,
            duration: Duration(seconds: 2),
            shape: ShapeBorder.lerp(
              RoundedRectangleBorder(
                borderRadius: BorderRadius.circular(50),
              ),
              RoundedRectangleBorder(
                borderRadius: BorderRadius.circular(50),
              ),
              1,
            ),
          );
          ScaffoldMessenger.of(context).showSnackBar(snackBar);
        },
      ),
      ),
    );
  }
}
