import 'package:flutter/material.dart';
import 'package:maktabat_almoslim/screens/mafatih%20aljinan%20pages/a3mal%20ashor%20alsana/moharam.dart';
import 'package:maktabat_almoslim/widgets/container_scrollview.dart';
import 'package:maktabat_almoslim/widgets/she3er.dart';
import 'package:provider/provider.dart';
import 'package:shared_preferences/shared_preferences.dart';

import '../../../../widgets/add_custom_bottom_navigation_bar.dart';
import '../../../../widgets/list_of_nine_verses.dart';
import '../../../favorites_provider.dart';
import '../../../favorites_screen.dart';
import 'allayla_al3ashira.dart';
import 'alyawm_al5ames_wal_3eshroun.dart';

class AlyawmAl3asher extends StatefulWidget {
  static String screenRoute = 'alyawm_al3asher_screen';
  const AlyawmAl3asher({super.key});

  @override
  State<AlyawmAl3asher> createState() => _AlyawmAl3asherState();
}

double _fontSize = 18;
double _fontSizeTablet = 30;

class _AlyawmAl3asherState extends State<AlyawmAl3asher> {
  bool isIcon = true;
  @override
  void initState() {
    super.initState();
    _loadFavoriteState();
  }

  Future<void> _loadFavoriteState() async {
    final prefs = await SharedPreferences.getInstance();
    bool? savedState = prefs.getBool('isFavorite_alyawm_al3asher_screen');
    setState(() {
      isIcon = savedState ?? true;
    });
  }

  Future<void> _saveFavoriteState(bool value) async {
    final prefs = await SharedPreferences.getInstance();
    await prefs.setBool('isFavorite_alyawm_al3asher_screen', value);
  }

  Future<bool> _onWillPop() async {
    final args =
        ModalRoute.of(context)!.settings.arguments as Map<String, dynamic>?;
    final previousPage = args?['previousPage'];
    if (previousPage == 'favorite_screen') {
      Navigator.of(context).pushReplacementNamed(FavoritesScreen.screenRoute);
      return false;
    } else {
      Navigator.of(context).pushReplacementNamed(Moharam.screenRoute);
      return false;
    }
  }

  @override
  Widget build(BuildContext context) {
    double size = MediaQuery.of(context).textScaleFactor;
    final screenWidth = MediaQuery.of(context).size.width;
    final isTablet = screenWidth >= 600;
    return WillPopScope(
      onWillPop: _onWillPop,
      child: Scaffold(
        appBar: AppBar(
          toolbarHeight: isTablet ? 100 : 50,
          centerTitle: true,
          leading: IconButton(
            onPressed: _onWillPop,
            icon: Icon(
              Icons.arrow_back,
              size: isTablet ? 50 : 25,
            ),
          ),
          actions: [
            IconButton(
              padding: EdgeInsets.only(left: isTablet ? 50 : 30),
              icon: Icon(
                isIcon ? Icons.favorite_border : Icons.favorite_rounded,
                size: isTablet ? 40 : 25,
                color: isIcon ? Colors.black : Colors.red,
              ),
              onPressed: () async {
                setState(() {
                  isIcon = !isIcon;
                });
                await _saveFavoriteState(isIcon);

                if (!isIcon) {
                  Provider.of<FavoritesProvider>(context, listen: false)
                      .addFavorite('اليوم العاشر', AlyawmAl3asher.screenRoute);
                } else {
                  Provider.of<FavoritesProvider>(context, listen: false)
                      .removeFavorite(
                          'اليوم العاشر',
                          AlyawmAl3asher.screenRoute,
                          AlyawmAl3asher.screenRoute);
                }
              },
            ),
          ],
          title: Text(
            'اليوم العاشر',
            style: TextStyle(
              fontSize: isTablet
                  ? 40
                  : size > 1.0
                      ? 20
                      : 23,
              fontWeight: FontWeight.bold,
            ),
          ),
        ),
        body: ContainerScrollview(
          widget: Column(
            crossAxisAlignment: CrossAxisAlignment.start,
            children: [
              Container(
                child: Column(
                  children: [
                    Center(
                      child: Text(
                        'بسم الله الرحمن الرحيم',
                        style: TextStyle(
                          fontSize: isTablet ? _fontSizeTablet : _fontSize,
                          fontWeight: FontWeight.w900,
                        ),
                      ),
                    ),
                    Center(
                      child: Text(
                        'اللهم صلِّ على محمد وآل محمد',
                        style: TextStyle(
                          fontSize: isTablet ? _fontSizeTablet : _fontSize,
                          fontWeight: FontWeight.w900,
                        ),
                      ),
                    ),
                  ],
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: '',
                  subtitle:
                      'يوم استشهد فيه الحسين (عليه السلام) وهو يوم المُصيبة والحُزن للائمة (عليهم السلام) وشيعتهم وينبغي للشّيعة أن يمسكوا فيه عن السّعي في حوائج دُنياهم وأن لا يدّخروا فيه شيئاً لمنازلهم وأن يتفرّغوا فيه للبكاء والنّياح وذكر المصائب وأن يقيمُوا ماتم الحسين (عليه السلام) كمنا يقيمُونه لاعزّ أولادهم وأقاربهم وأن يزوروه بزيارة عاشوراء الاتية ان شاء الله تعالى وأن يجتهدوا في سبّ قاتليه ولعنهم وليعزّ بعضهم بعضاً قائلاً اَعْظَمَ اللهُ اُجُورَنا بِمُصابِنا بِالْحُسَيْنِ عَلَيْهَ السَّلامُ وَجَعَلْنا وَاِيّاكُمْ مِنَ الطّالِبينَ بِثارِهِ مَعَ وَلِيِّهِ الاِمامِ الْمَهْدىِّ مِنْ آلِ مُحَمَّد عَلَيْهِمُ السَّلامُ وينبغي أن يتذاكروا فيه مقتل الحسين (عليه السلام) فيستبكي بعضهم بعضاً.\n\n'
                      'وروى انّه لمّا أمر موسى (عليه السلام) بلقاء خضر (عليه السلام) والتّعلّم منه كان أوّل ما تذاكروا فيه هو انّ العالم حدّث موسى (عليه السلام) بمصائب آل محمّد (عليهم السلام) فبكيا واشتدّ بكاؤهما وعن ابن عبّاس قال : حضرت في ذيقار عند أمير المؤمنين (عليه السلام) فأخرج صحيفة بخطّه واملاء النّبي (صلى الله عليه وآله وسلم) وقرأ في من تلك الصّحيفة وكان فيها مقتل الحسين صلوات الله وسلامه عليه وانّه كيف يقتل ومن الذي يقتله ومن ينصره ومن يستشهد معه ثمّ بكى بكاءً شديداً وأبكاني ، فمن شاء فلطيطالع كتب الخاصّة في المقتل وعلى أيّ حال فمن سقى النّار عند قبر الحسين (عليه السلام) في هذا اليوم كان كمن سقى أعوانه (عليه السلام) في كربلاء ولقراءة التّوحيد ألف مرّة في هذا اليوم فضل.\n\n'
                      'وروي انّ الله تعالى ينظر الى من نظر الرّحمة وقد روى السّيد لهذا اليوم دعاء يشابه دعاء العشرات بل الظّاهر انّه نفس الدّعاء على بعض رواياتها وقد روى الشّيخ عن عبد الله بن سنان عن الصّادق (عليه السلام)صلاة ذات ركعات ودعاء يؤدّى غدوة ولم نوردها اختصاراً (من شاء فليطلبها من زاد المعاد) وينبغي ايضاً للشيعة الامساك عن الطعام والشّراب في هذا اليوم من دُون نيّة للصّيام وأن يفطُروا في آخر النّهار بعد العصر بما يقتات به أهل المصائب كاللّبن الخاثر والحليب ونظائرهما لا بالاغذية اللّذيذة وأن يلبسوا ثياباً نظيفة ويحلو الازرار ويكشطوا الاكمام على هيئة اصحاب العزاء وقال العلامة المجلسي في زاد المعاد : والاحسن أن لا يصام اليوم التّاسع والعاشر فانّ بني اميّة كانت تصومها شماتة بالحسين (عليه السلام) وتبرّكاً بقتله وقد افتروا على رسول الله (عليه السلام) احاديث كثيرة وضعوها في فضل هذين اليومين وفضل صيامهما وقد روي من طريق أهل البيت (عليهم السلام) احاديث كثيرة في ذمّ الصّوم فيهما لا سيّما في يوم عاشوراء وكانت أيضاً بنو أميّة لعنة الله عليهم تدّخر في الدّار قُوت سنتها في يوم عاشوراء ولذلك روي عن الامام الرّضا صلوات الله وسلامه عليه ،قال : من ترك السّعي في حوائجه يوم عاشوراء قضى الله له حوائج الدّنيا والاخرة ومن كان يوم عاشوراء يوم مصيبته وحُزنه وبكائه جعل الله يوم القيامة يوم فرحه وسروره وقرّت بنا في الجنّة عينه ومن سمّى يوم عاشوراء يوم بركة وادّخر لمنزله فيه شيئاً لم يبارك له فيما ادّخر وحشر يوم القيامة مع يزيد وعبيد الله بن زياد وعمر بن سعد لعنهم الله فينبغي أن يكفّ المرء فيه عن أعمال دنياه ويتجرّد للبكاء والنّياحة وذكر المصائب ويأمر أهله بأقامة المأتم كما يقام لاعزّ الاولاد والاقارب وأن يمسك في هذا اليوم من الطّعام والشّراب من دون قصد الصّيام ويفطر آخر النّهار بعد العصر ولو بشربة من الماء ولا يصوم فيه الّا اذا أوجب عليه صومه بنذر أو شبهه ولا يدّخر فيه شيئاً لمنزله ولا يضحك ولا يقبل على اللّهو واللّعب ويلعن قاتلي الحسين (عليه السلام) ألف مرّة قائلاً : اَللّـهُمَّ الْعَنْ قَتَلَةَ الْحُسَيْنِ عَلَيْهِ السَّلامُ أقول : يظهر من كلامه الشّريف انّ ما يروى في فضل يوم عاشوراء من الاحاديث مجعولة مفتراة على رسول الله (صلى الله عليه وآله وسلم) وقد بسط القول مؤلّف كتاب شفاء الصّدور عند شرح هذه الفقرة من زيارة عاشوراء اَللّـهُمَّ اِنَّ هذا يَوْمٌ تَبَرَّكَتْ بِهِ بَنُواُمَيَّةَ وملخّص ما قال : انّ بني اميّة كانت تتبرّك بهذا اليوم بصور عديدة:\n\n'
                      'منها : انّها كانت تستن ادّخار القوت فيه وتعتبر ذلك القوت مجلبة للسّعادة وسعة الرّزق ورغد العيش الى العام القادم وقد وردت أحاديث كثيرة عن أهل البيت (عليهم السلام) في النّهي عن ذلك تعرّضاً لهم.\n\n'
                      'ومنها : عدّهم هذا اليوم عيداً والتّأدّب فيه بآداب العيد من التّوسعة على العيال وتجديد الملابس وقصّ الشّارب وتقليم الاظفار والمصافحة وغير ذلك ممّا جرى على طريقة بني اميّة وأتباعهم.\n\n'
                      'ومنها : الالتزام بصيامه وقد وضعوا في ذلك اخباراً كثيرة وهم ملتزمون بالصّوم فيه.\n\n'
                      'الرّابع : من وجوه التّبرّك بيوم عاشوراء ذهابهم الى استحباب الدّعاء والمسألة فيه ولاجل ذلك قد اقتروا مناقب وفضائل لهذا اليوم ضمنوها ادعية لفقوها فعلّموها العصاة من الامة ليلتبس الامر ويشتبه على النّاس وهم يذكرون فيما يخطبون به في هذا اليوم في بلادهم شرفاً ووسيلة لكلّ نبيّ من الانبياء في هذا اليوم كاخماد نار نمرود واقرار سفينة نوح على الجودي واغراق فرعون وانجاء عيسى (عليه السلام) من صليب اليهود كما روى الشّيخ الصّجدوق عن جبلة المكيّة قالت : سمعت ميثماً التّمار قدّس الله روحه يقول : والله لتقتل هذه الامّة ابن نبيّها في المحرّم لعشرة تمضي منه وليتّخذنّ اعداء الله ذلك اليوم يوم بركة وانّ ذلك لكائن قد سبق في علم الله تعالى أعلم ذلك بعهد عهده الى مولاي أمير المؤمنين (عليه السلام) الى أن قالت جبلة : فقلت : يا ميثم وكيف يتّخذ النّاس ذلك اليوم الذي يقتل فيه الحسين (عليه السلام) يوم بركة فبكى ميثم (رضي الله عنه) ثمّ قال : سيزعمون لحديث يضعُونه انّه اليوم الّذي تاب الله فيه على آدم وانّما تاب الله على آدم (عليه السلام) في ذي الحجة ويزعمون انّه اليوم الذي استوت فيه سفينة نوح (عليه السلام) على الجودي وانّما استوت في العاشر من ذي الحجّة ويزعمون انّه اليوم الذي فلق الله فيه البحر لموسى (عليه السلام) وانما كان ذلك في ربيع الاوّل وحديث ميثم هذا كما رأيت قد صرّح فيه تصريحاً وأكّد تأكيداً انّ هذه الاحاديث مجعولة مفتراة على المعصومين (عليهم السلام)  الحديث هو امارة من امارات النبوّة والامامة ودليل من الادلّة على صدق مذهب الشّيعة وطريقتهم فالامام (عليه السلام) قد نبّأ فيه جزماً وقطعاً بما شاهدنا حدوثه حقّاً فيما بعد من الفرية والكذب رأى العين فالعجب أن يلفق مع ذلك دعاء يضمّن هذه الاكاذيب فيورده في كتابه بعض من ليس من ذوي الخبرة والاطّلاع من الغافلين فينشر الكتاب بين العوام من النّاس.\n\n'
                      'وقراءة ذلك الدّعاء لا شكّ انّها بدعة محرّمة والدّعاء هو:\n\n'
                      'سُبْحانَ اللهَ مِلاَْ الْمِيزانِ وَمُنْتَهَى الْعِلْمِ وَمَبْلَغَ الرِّضا وَزِنَةَ الْعَرْشِ وفيه بعد عدّة سطور ثمّ صلّ على محمّد وآله عشر مرّات وقل : يا قابِلَ تَوْبَةَ آدَمَ يَوْمَ عاشُورآءَ يا رافِعَ اِدْريسَ اِلَى السَّمآءِ يَوْمَ عاشُورآءَ يا مُسْكِنَ سَفينَةِ نُوح عَلَى الْجُودِىِّ يَوْمَ عاشُورآءَ يا غِياثَ اِبْرهيمَ مِنَ النّارِ يَوْمَ عاشُورآءَ الخ ولا شكّ انّ هذا الدّعاء قد وضعه بعض نواصب المدينة أو خوارج المسقط أو أمثالهم متمّماً به ظلم بني اميّة.\n\n'
                      'تمّ ملخصّاً ما ذكره مؤلّف شفاء الصّدُور وعلى كلّ حال فجدير أن تذكر في آخر النّهار حال حرم الحسين (عليه السلام)حينئذ وبناته وأطفاله وهُم اُسارى بكربلاء حَزينات باكيات مُصابات بما لم يخطر ببال أحد من الخلق ولا يطيق اليراع شرحه ولقدأجاد من قال:\n\n',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
              Container(
                child: She3er(
                  subtitle: 'فاجِعَةٌ اِنْ اَرَدْتُ اَكْتُبُها\n'
                      'مُجْمَلَةً ذِكْرَةً لِمُدِّكِر\n\n'
                      'جَرَتْ دُمُوعى فِحالَ حامِلُها\n'
                      'ما بَيْنَ لَحْظِ الْجُفُونِ وَالزُّبُرِ\n\n'
                      'وَقالَ قَلْبى بُقْيا عَلَىَّ فَلا\n'
                      'وَاللهِ ما قَدْ طُبِعْتُ مِنْ حَجِر\n\n'
                      'بَكَتْ لَهَا الاَْرْضُ وَالسَّمآءُ وَما\n'
                      'بَيْنَهُما فى مِدامِع حُمُر\n\n'
                      'من از تحرير اين غم ناتوانم\n'
                      'كه تصويرش زده آتش بجانم\n\n'
                      'ترا طاقت نباشد از شنيدن\n'
                      'شنيدن كى بود مانند ديدن\n\n',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: '',
                  subtitle:
                      'ثمّ قُم وسلّم على رسول الله وعليّ المرتضى وفاطمة الزّهرآء والحَسن المجتبى وسائر الائمة من ذُرّيّة سيّد الشّهداء (عليهم السلام) وعزهم على هذه المصائب العظيمة بمهجة حرّى وعين عبرى وزر بهذه الزّيارة:\n\n'
                      'اَلسَّلامُ عَلَيْكَ يا وارِثَ آدَمَ صِفْوَةِ اللهِ اَلسَّلامُ عَلَيْكَ يا وارِثَ نُوح نَبِىِّ اللهِ اَلسَّلامُ عَلَيْكَ يا وارِثَ اِبْراهيمَ خَليلِ اللهِ اَلسَّلامُ عَلَيْكَ يا وارِثَ مُوسى كَليمِ اللهِ اَلسَّلامُ عَلَيْكَ يا وارِثَ عيسى رُوحِ اللهِ اَلسَّلامُ عَلَيْكَ يا وارِثَ مُحَمَّد حَبيبِ اللهِ اَلسَّلامُ عَلَيْكَ يا وارِثَ عَلِىٍّ اَميرِ الْمُؤْمِنينَ وَلِىِّ اللهِ اَلسَّلامُ عَلَيْكَ يا وارِثَ الْحَسَنِ الشَّهيدِ سِبْطِ رَسُولِ اللهِ اَلسَّلامُ عَلَيْكَ يَا بْنَ رَسُولِ اللهِ اَلسَّلامُ عَلَيْكَ يَا بْنَ الْبَشيرِ النَّذيرِ وَابْنَ سَيِّدِ الْوَصِيِّينَ اَلسَّلامُ عَلَيْكَ يَابْنَ فاطِمَةَ سَيِّدَةِ نِسآءِ الْعالَمينَ اَلسَّلامُ عَلَيْكَ يا اَبا عَبْدِ اللهِ اَلسَّلامُ عَلَيْكَ يا خِيَرَةَ اللهِ وَابْنَ خِيَرَتِهِ اَلسَّلامُ عَلَيْكَ يا ثارَ اللهِ وَابْنَ ثارِهِ اَلسَّلامُ عَلَيْكَ اَيُّهَا الْوِتْرَ الْمَوْتُورَ اَلسَّلامُ عَلَيْكَ اَيُّهَا الاِْمامُ الْهادِى الزَّكِىُّ وَعَلى اَرْواح حَلَّتْ بِفِنآئِكَ وَاَقامَتْ فى جِوارِكَ وَوَفَدَتْ مَعَ زُوّارِكَ اَلسَّلامُ عَلَيْكَ مِنِّى ما بَقيتُ وَبَقِىَ اللَّيْلُ وَالنَّهارُ فَلَقَدْ عَظُمَتِ بِكَ الرَّزِيَّةُ وَجَلَّ الْمُصابُ فِى الْمُؤْمِنينَ وَالْمُسْلِمينَ وَفى اَهْلِ السَّمواتِ اَجْمَعينَ وَفى سُكّـانِ الاَْرَضينَ فَاِنّا للهِ وَاِنّا اِلَيْهِ راجِعُونَ وَصَلَواتُ اللهِ وَبَرَكاتُهُ وَتَحِيّاتُهُ عَلَيْكَ وَعَلى آبآئِكَ الطّاهِرينَ الطَّيِّبينَ الْمُنْتَجَبَينَ وَعَلى ذَراريهِمُ الْهُداةِ الْمَهْدِيّينَ اَلسَّلامُ عَلَيْكَ يا مَوْلاىَ وَعَلَيْهِمْ وَعَلى رُوحِكَ وَعَلى اَرْواحِهِمْ وَعَلى تُرْبَتِكَ وَعَلى تُرْبَتِهِمْ اَللّـهُمَّ لَقِّهِمْ رَحْمَةً وَرِضْواناً وَرَوْحاً وَرَيْحاناً اَلسَّلامُ عَلَيْكَ يا مَوْلاىَ يا اَبا عَبْدِاللهِ يَا بْنَ خاتَمِ النَّبِيّينَ وَيَا بْنَ سَيِّدِ الْوَصِيّينَ وَيَا بْنَ سَيِّدَةَ نِسآءِ الْعالَمينَ اَلسَّلامُ عَلَيْكَ يا شَهيدُ يَا بْنَ الشَّهيدِ يا اَخَ الشَّهيدِ يا اَبَا الشُّهَدآءِ اَللّـهُمَّ بَلِّغْهُ عَنّى فى هذِهِ السّاعَةِ وَفى هذَا الْيَوْمِ وَفى هذَا الْوَقْتِ وَفى كُلِّ وَقْت تَحِيَّةً كَثيرَةً وَسَلاماً سَلامُ اللهِ عَلَيْكِ وَرَحْمَةُ اللهِ وَبَرَكاتُهُ يَا بْنَ سَيِّدِ الْعالَمينَ وَعَلَى الْمُسْتَشْهَدينَ مَعَكَ سَلاماً مُتَّصِلاً مَا اتَّصَلَ اللَّيْلُ وَالنَّهارُ السَّلامُ عَلَى الْحُسَيْنِ بْنِ عَلِىّ الشَّهيدِ السَّلامُ عَلى عَلِىِّ بْنِ الْحُسَيْنِ الشَّهيدِ اَلسَّلامُ عَلَى الْعَبّاسِ بْنِ اَميرِ الْمُؤْمِنينَ الشَّهيدِ السَّلامُ عَلَى الشُّهَدآءِ مِنْ وُلْدِ اَمِيرِ الْمُؤْمِنينَ اَلسَّلامُ عَلَى الشُّهَدآءِ مِنْ وُلْدِ الْحَسَنِ اَلسَّلامُ عَلَى الشُّهَدآءِ مِنْ وُلْدِ الْحُسَيْنِ السَّلامُ عَلَى الشُّهَدآءِ مِنْ وُلْدِ جَعْفَر وَعَقِيل اَلسَّلامُ عَلى كُلِّ مُسْتَشْهَد مَعَهُمْ مِنَ الْمُؤْمِنينَ اَللّـهُمَّ صَلِّ عَلى مُحَمَّد وَآلِ مُحَمَّد وَبَلِّغْهُمْ عَنّى تَحِيَّةً كَثيرَةً وَسَلاماً اَلسَّلامُ عَلَيْكَ يا رَسُولَ اللهِ اَحْسَنَ اللهُ لَكَ الْعَزآءَ فى وَلَدِكَ الْحُسَيْنِ اَلسَّلامُ عَلَيْكِ يا فاطِمَةُ اَحْسَنَ اللهُ لَكَ الْعَزآءَ فى وَلَدِكَ الْحُسَيْنِ اَلسَّلامُ عَلَيْكَ يا اَميرَ الْمُؤْمِنينَ اَحْسَنَ اللهُ لَكَ الْعَزآءَ فِى وَلَدِكَ الْحُسَيْنِ اَلسَّلامُ عَلَيْكَ يا اَبا مُحَمَّد الْحَسَنَ اَحْسَنَ اللهُ لَكَ الْعَزآءِ فى اَخيكَ الْحُسَيْنِ يا مَوْلاىَ يا اَبا عَبْدِاللهِ اَنَا َضْيُف اِلله َوضَيْفُكَ وَجارُ اللهِ وَجارُكَ وَلِكُلِّ ضَيْف وَجار قِرىً وَقِراىَ فى هذَا الْوَقْتِ اَنْ تَسْئَلَ اللهَ سُبْحانَهُ وَتَعالى اَنْ يَرْزُقَنى فَكاكَ رَقَبَتى مِنَ النّارِ اِنَّهُ سَميعُ الدُّعآءِ قَريبُ مُجيبُ.',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
            ],
          ),
        ),
        bottomNavigationBar: AddCustomBottomNavigationBar(
        pushNext: AlyawmAl5amesWal3eshroun.screenRoute,
        pushBack: AllaylaAl3ashira.screenRoute,
        soud: '',
        onTap: (double fontSize) {
          // تحديث حجم الخط
          setState(() {
            isTablet ? _fontSizeTablet = fontSize : _fontSize = fontSize;
          });
          print('fontSize: $fontSize');
          // إغلاق Dialog
          Navigator.of(context).pop();
        },
        onLongPress: () {
          final snackBar = SnackBar(
            content: Center(
              child: Text(
                '${isTablet ? _fontSizeTablet.toInt() : _fontSize.toInt()}',
                style: TextStyle(
                  color: Colors.white,
                  fontSize: 16,
                ),
              ),
            ),
            width: 60,
            behavior: SnackBarBehavior.floating,
            backgroundColor: Colors.blue,
            duration: Duration(seconds: 2),
            shape: ShapeBorder.lerp(
              RoundedRectangleBorder(
                borderRadius: BorderRadius.circular(50),
              ),
              RoundedRectangleBorder(
                borderRadius: BorderRadius.circular(50),
              ),
              1,
            ),
          );
          ScaffoldMessenger.of(context).showSnackBar(snackBar);
        },
      ),
      ),
    );
  }
}
