import 'package:flutter/material.dart';
import 'package:maktabat_almoslim/widgets/container_scrollview.dart';
import 'package:provider/provider.dart';
import 'package:shared_preferences/shared_preferences.dart';

import '../../../../widgets/add_custom_bottom_navigation_bar.dart';
import '../../../../widgets/list_of_nine_verses.dart';
import '../../../favorites_provider.dart';
import '../../../favorites_screen.dart';
import '../alziyarat_aljami3a_walsalawat.dart';
import 'fi_ziyarat_kobour_lmo2minin.dart';
import 'hadis_alkisa2.dart';

class FiZiyaratAlabna2Al3ozama2 extends StatefulWidget {
  static String screenRoute = 'fi_ziyarat_alabna2_al3ozama2_screen';
  const FiZiyaratAlabna2Al3ozama2({super.key});

  @override
  State<FiZiyaratAlabna2Al3ozama2> createState() =>
      _FiZiyaratAlabna2Al3ozama2State();
}

double _fontSize = 18;
double _fontSizeTablet = 30;

class _FiZiyaratAlabna2Al3ozama2State extends State<FiZiyaratAlabna2Al3ozama2> {
  bool isIcon = true;
  @override
  void initState() {
    super.initState();
    _loadFavoriteState();
  }

  Future<void> _loadFavoriteState() async {
    final prefs = await SharedPreferences.getInstance();
    bool? savedState =
        prefs.getBool('isFavorite_fi_ziyarat_alabna2_al3ozama2_screen');
    setState(() {
      isIcon = savedState ?? true;
    });
  }

  Future<void> _saveFavoriteState(bool value) async {
    final prefs = await SharedPreferences.getInstance();
    await prefs.setBool(
        'isFavorite_fi_ziyarat_alabna2_al3ozama2_screen', value);
  }

  Future<bool> _onWillPop() async {
    final args =
        ModalRoute.of(context)!.settings.arguments as Map<String, dynamic>?;
    final previousPage = args?['previousPage'];
    if (previousPage == 'favorite_screen') {
      Navigator.of(context).pushReplacementNamed(FavoritesScreen.screenRoute);
      return false;
    } else {
      Navigator.of(context)
          .pushReplacementNamed(AlziyaratAljami3aWalsalawat.screenRoute);
      return false;
    }
  }

  @override
  Widget build(BuildContext context) {
    double size = MediaQuery.of(context).textScaleFactor;
    final screenWidth = MediaQuery.of(context).size.width;
    final isTablet = screenWidth >= 600;
    return WillPopScope(
      onWillPop: _onWillPop,
      child: Scaffold(
        appBar: AppBar(
          toolbarHeight: isTablet ? 100 : 50,
          centerTitle: true,
          leading: IconButton(
            onPressed: _onWillPop,
            icon: Icon(
              Icons.arrow_back,
              size: isTablet ? 50 : 25,
            ),
          ),
          actions: [
            IconButton(
              padding: EdgeInsets.only(left: isTablet ? 50 : 30),
              icon: Icon(
                isIcon ? Icons.favorite_border : Icons.favorite_rounded,
                size: isTablet ? 40 : 25,
                color: isIcon ? Colors.black : Colors.red,
              ),
              onPressed: () async {
                setState(() {
                  isIcon = !isIcon;
                });
                await _saveFavoriteState(isIcon);

                if (!isIcon) {
                  Provider.of<FavoritesProvider>(context, listen: false)
                      .addFavorite(
                          'في زيارة الأبناء العظام للأئمة (عليهم السلام)',
                          FiZiyaratAlabna2Al3ozama2.screenRoute);
                } else {
                  Provider.of<FavoritesProvider>(context, listen: false)
                      .removeFavorite(
                          'في زيارة الأبناء العظام للأئمة (عليهم السلام)',
                          FiZiyaratAlabna2Al3ozama2.screenRoute,
                          FiZiyaratAlabna2Al3ozama2.screenRoute);
                }
              },
            ),
          ],
          title: Text(
            'في زيارة الأبناء العظام للأئمة (عليهم السلام)',
            style: TextStyle(
              fontSize: isTablet
                  ? 40
                  : size > 1.0
                      ? 20
                      : 23,
              fontWeight: FontWeight.bold,
            ),
          ),
        ),
        body: ContainerScrollview(
          widget: Column(
            crossAxisAlignment: CrossAxisAlignment.start,
            children: [
              Container(
                child: Column(
                  children: [
                    Center(
                      child: Text(
                        'بسم الله الرحمن الرحيم',
                        style: TextStyle(
                          fontSize: isTablet ? _fontSizeTablet : _fontSize,
                          fontWeight: FontWeight.w900,
                        ),
                      ),
                    ),
                    Center(
                      child: Text(
                        'اللهم صلِّ على محمد وآل محمد',
                        style: TextStyle(
                          fontSize: isTablet ? _fontSizeTablet : _fontSize,
                          fontWeight: FontWeight.w900,
                        ),
                      ),
                    ),
                  ],
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: '',
                  subtitle:
                      'وهم ابناء الملوك بالحقّ وقبورهم منابع الفيض والبركة ومهابط الرّحمة والعناية الالهيّة والعلماء قد صرّحوا باستحباب زيارة قبورهم وهي والحمد لله منتشرة في غالب بلاد الشّيعة بل وفي القرى والبراري واطراف الجبال والاودية وهي دائماً ملاذ المضطرّين وملجأ البائسين وغياث المظلومين وتسلية للقلوب الذّابلة وستضلّ كذلك الى يوم القيامة، وقد برز من كثير من هذه المراقد الشّريفة كرامات وخوارق للعادات ولكن لا يخفى انّ الزائر اذا شاء أن يشدّ الرّحل الى شيء من هذه المراقد موقناً ببلوغه فيض رحمة الله وبكشف كروبه فينبغي أن يحرز فيه شرطان :',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: 'الاوّل :',
                  subtitle:
                      'جلالة صاحب ذلك المرقد وعظمة شأنه اضافة الى ما حازه من شرافة النّسب وتعرف هذه من كتب الاحاديث والانساب والتّواريخ.',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: 'الثّاني :',
                  subtitle:
                      'التأكّد من صحّة نسبة هذا المرقد اليه، وما حاز كلا الشّرطين من المشاهد قليل جدّاً ونحن قد أشرنا في كتاب هديّة الزّائر الى عدّة مراقد قد اجتمع فيه الشّرطان واشرنا في كتاب نفثة المصدور وكتاب منتهى الامال الى مرقد محسن بن الحسين (عليه السلام) وهذا الكتاب لا يسع التّفصيل فنقتصر على ذكر اثنين منها :',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: ' - الاوّل :',
                  subtitle:
                      'مشهد السّيدة الجليلة العظيمة فاطمة بنت موسى بن جعفر (عليه السلام) وقبرها الشّريف في بلدة قم الطّيبة معروف مشهور وله قبّة شامخة وضريح وصحون وخدم كثيرون وأوقاف وافرة وهو قرّة العين لاهالي قم وملاذ لعامّة الخلق مما يشدّ اليه الرّحال في كلّ سنة خلق كثير من أقاصي البلاد فيتحمّلون متاعب السّفر ابتغاء فضيلة زيارتها وفضلها وجلالها يعرف من كثير من الاخبار.\n\n'
                      'روى الصّدوق بسند كالصّحيح عن سعد بن سعد ، قال : سألت الرّضا (عليه السلام) عن فاطمة بنت موسى بن جعفر (عليهما السلام) ، فقال : من زارها فله الجنّة.\n\n'
                      'وروى بسند معتبر آخر عن محمّد التّقي بن الرّضا (عليهما السلام) قال : من زار قبر عمّتي بقم فله الجنّة.\n\n'
                      'وروى العلامة المجلسي (رحمه الله) عن بعض كتب الزّيارات عن عليّ بن ابراهيم عن أبيه عن سعد الاشعريّ القميّ عن الرّضا صلوات الله عليه ، قال : قال : يا سعد عندكم لنا قبر ، قلت : جعلت فداك قبر فاطمة (عليها السلام)بنت موسى بن جعفر (عليه السلام) ، قال : بلى، من زارها عارفاً بحقّها فله الجنّة، فاذا أتيت القبر فقم عند رأسها مستقبل القبلة وقُل أربعاً وثلاثين مرّة اَللهُ اَكْبَرُ وثلاثاً وثلاثين مرّة سُبْحانَ اللهِ وثلاثاً وثلاثين مرّة اَلْحَمْدُ للهِ ثمّ قُل :\n\n'
                      'اَلسَّلامُ عَلى آدَمَ صَفْوَةِ اللهِ، اَلسَّلامُ عَلى نُوح نَبِىِّ اللهِ، اَلسَّلامُ عَلى اِبْراهيمَ خَليلِ اللهِ، اَلسَّلامُ عَلى مُوسى كَليمِ اللهِ، اَلسَّلامُ عَلى عيسى رُوحِ اللهِ، اَلسَّلامُ عَلَيْكَ يا رَسُولَ اللهِ، اَلسَّلامُ عَلَيْكَ يا خَيْرَ خَلْقِ اللهِ، اَلسَّلامُ عَلَيْكَ يا صَفِىَّ اللهِ، اَلسَّلامُ عَلَيْكَ يا مُحَمَّدَ بْنَ عَبْدِ اللهِ خاتَمَ النَّبِيّينَ، اَلسَّلامُ عَلَيْكَ يا اَميرَ الْمُؤْمِنينَ عَلِىَّ بْنَ اَبى طالِب وَصِىَّ رَسُولِ اللهِ، اَلسَّلامُ عَلَيْكِ يا فاطِمَةُ سَيِّدَةَ نِساءِ الْعالَمينَ، اَلسَّلامُ عَلَيْكُما يا سِبْطَىْ نَبِىِّ الرَّحْمَةِ وَسَيِّدَىْ شَبابِ اَهْلِ الْجَّنَةِ، اَلسَّلامُ عَلَيْكَ يا عَلىَّ بْنَ الْحُسَيْنِ سَيِّدَ الْعابِدينَ وَقُرَّةَ عَيْنِ النّاظِرينَ، اَلسَّلامُ عَلَيْكَ يا مُحَمَّدَ بْنَ عَلِىٍّ باقِرَ الْعِلْمِ بَعْدَ النَّبِىِّ، اَلسَّلامُ عَلَيْكَ يا جَعْفَرَ بْنَ مُحَمَّد الصّادِقَ الْبارَّ الاَْمينَ، اَلسَّلامُ عَلَيْكَ يا مُوسَى بْنَ جَعْفَر الطّاهِرَ الطُّهْرَ، اَلسَّلامُ عَلَيْكَ يا عَلِىَّ بْنَ مُوسَى الرِّضا الْمُرْتَضى، اَلسَّلامُ عَلَيْكَ يا مُحَمَّدَ بْنَ عَلِىٍّ التَّقِىَّ، اَلسَّلامُ '
                      'عَلَيْكَ يا عَلِىَّ بْنَ مُحَمَّد النَّقِىَّ النّاصِحَ الاَْمينَ، اَلسَّلامُ عَلَيْكَ يا حَسَنَ بْنَ عَلِىٍّ، اَلسَّلامُ عَلَى الْوَصىِّ مِنْ بَعْدِهِ، اَللّـهُمَّ صَلِّ عَلى نُورِكَ وَسِراجِكَ وَوَلِىِّ وَلِيِّكَ وَوَصِىِّ وَصِيِّكَ، وَحُجَّتِكَ عَلى خَلْقِكَ، اَلسَّلامُ عَلَيْكِ يا بِنْتَ رَسُولِ اللهِ، اَلسَّلامُ عَلَيْكِ يا بِنْتَ فاطِمَةَ و خَديجَةَ، اَلسَّلامُ عَلَيْكِ يا بِنْتَ اَميرِالْمُؤْمِنينَ، اَلسَّلامُ عَلَيْكِ يا بِنْتَ الْحَسَنِ وَالْحُسَيْنِ، اَلسَّلامُ عَلَيْكِ يا بِنْتَ وَلِىِّ اللهِ اَلسَّلامُ عَلَيْكِ يا اُخْتَ وَلِىِّ اللهِ، اَلسَّلامُ عَلَيْكِ يا عَمَّةَ وَلِىِّ اللهِ، اَلسَّلامُ عَلَيْكِ يا بِنْتَ مُوسَى بْنِ جَعْفَر وَرَحْمَةُ اللهِ وَبَرَكاتُهُ، اَلسَّلامُ عَلَيْكِ عَرَّفَ اللهُ بَيْنَنا وَبَيْنَكُمْ فِى الْجَنَّةِ، وَحَشَرَنا فى زُمْرَتِكُمْ وَاَوْرَدَنا حَوْضَ نَبِيِّكُمْ، وَسَقانا بِكَأسِ جَدِّكُمْ مِنْ يَدِ عَلِىِّ بْنِ اَبى طالِب صَلَواتُ اللهِ عَلَيْكُمْ اَسْأَلُ اللهَ اَنْ يُرِيَنا فيكُمُ السُّرُورَ وَالْفَرَجَ، '
                      'وَاَنْ يَجْمَعَنا وِاِيّاكُمْ فى زُمْرَةِ جَدِّكُمْ مُحَمَّد صَلَّى اللهُ عَلَيْهِ وَآلِهِ، وَاَنْ لا يَسْلُبَنا مَعْرِفَتَكُمْ اِنَّهُ وِلِىٌّ قَديرٌ، اَتَقَرَّبُ اِلَى اللهِ بِحُبِّكُمْ وَالْبَرائَةِ مِنْ اَعْدائِكُمْ، وَالتَّسْليمِ اِلَى اللهِ راضِياً بِهِ غَيْرَ مُنْكِر وَلا مُسْتَكْبِر وَعَلى يَقين ما اَتى بِهِ مُحَمَّدٌ وَبِهِ راض، نَطْلُبُ بِذلِكَ وَجْهَكَ يا سَيِّدى اَللّـهُمَّ وَرِضاكَ وَالدّارَ الاْخِرَةَ، يا فاطِمَةُ اشْفَعى لى فى الْجَنَّةِ فَاِنَّ لَكِ عِنْدَ اللهِ شَأناً مِنَ الشَّأنِ، اَللّـهُمَّ اِنّى اَسْاَلُكَ اَنْ تَخْتِمَ لى بِالسَّعادَةِ فَلا تَسْلُبْ مِنّى ما اَنـَا فيهِ وَلا حَوْلَ وَلا قُوَّةَ اِلاّ بِاللهِ الْعَلِىِّ الْعَظيمِ، اَللّـهُمَّ اسْتَجِبْ لَنا وَتَقَبَّلْهُ بِكَرَمِكَ وَعِزَّتِكَ وَبِرَحْمَتِكَ وَعافِيَتِكَ، وَصَلَّى اللهُ عَلى مُحَمَّد وَآلِهِ اَجْمَعينَ وَسَلَّمَ تَسْليماً يا اَرْحَمَ الرّاحِمينَ.',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: ' - الثّاني :',
                  subtitle:
                      'عبد العظيم ] شاهزاده عبد العظيم [ اللاّزم التعظيم وينتهي نسبه الشّريف بوسائط أربع الى سبط خير الورى الامام الحسن المجتبى (عليه السلام) فهو عبد العظيم بن عبد الله بن علي بن الحسن بن زيد بن الحسن بن عليّ بن أبي طالب (عليهم السلام) ومرقده الشّريف في الرّي معروف مشهور وملاذ ومعاذ لعامّة الخلق وعلوّ مقامه وجلالة شأنه أظهر من الشّمس، فانّه من سُلالة خاتم النّبيين وهو مع ذلك من أكابر المحدّثين وأعاظم العلماء والزّهاد والعبّاد وذوي الورع والتّقوى وهو من اصحاب الجواد والهادي (عليهما السلام) ، '
                      'وكان متوسّلاً بهما أقصى درجات التّوسّل ومنقطعاً اليهما غاية الانقطاع . وقد روى عنهما أحاديث كثيرة وهو المؤلّف لكتاب «خطب أمير المؤمنين (عليه السلام)» وكتاب «اليوم والليلة» وهو الذي عرض دينه على امام زمانه الامام الهاديّ (عليه السلام) فاقره وصدّقه وقال : يا أبا القاسم هذا والله دين الله الّذي ارتضاه فاثبت عليه ثبّتَكَ الله بالقول الثّابت في الدّنيا والاخرة.\n\n'
                      'وقد ألّف الصاحب بن عبّاد رسالة وجيزة في أحواله وشيخنا ثقة الاسلام النّوري قد أورد الوجيزة في خاتمة كتاب المستدرك وروى هناك وفي كتاب الرّجال للنّجاشي انّه خاف من السّلطان فطاف بالبلدان على انّه فيج ] الرّسول [ ثمّ ورد الرّي وسكن بساربانان ، وعلى رواية النّجاشي : سكن سرباً في دار رجل من الشّيعة في سكة المولى وكان يعبد الله في ذلك السرب ويصوم نهاره ويقوم ليله وكان يخرج مستتراً يزور القبر المقابل قبره وبينها الطّريق ويقول : هو رجل من ولد موسى بن جعفر (عليهما السلام) فلم يزل يأوى الى ذلك السّرب ويقع خبره الى الواحد بعد الواحد من شيعة آل محمّد عليه وعليهم السّلام حتّى عرفه أكثرهم فرأى رجل من '
                      'الشّيعة في المنام رسول الله (صلى الله عليه وآله وسلم)قال له : انّ رجلاً من ولدي يحمل من سكة الموالي ويدفن عند شجرة التّفاح في باغ ] بستان [ عبد الجبّار بن عبد الوهّاب وأشار الى المكان الّذي دفن فيه، فذهب الرّجل ليشتري الشّجرة ومكانها من صاحبها ، فقال له : لايّ شيء تطلب الشّجرة ومكانها فأخبره بالرّؤيا ، فذكر صاحب الشّجرة انّه كان رأى مثل هذه الرؤيا وانّه جعل موضع الشّجرة مع جميع الباغ ] البستان [ وقفاً على الشّريف والشّيعة يدفنون فيه، فمرض عبد العظيم ومات (رحمه الله) ، فلمّا جرّد ليغسل وجد في جيبه رقعة فيها ذكر نسبه فاذا فيها أنا أبو القاسم عبد العظيم بن عبد الله بن عليّ بن الحسن بن زيد بن الحسن بن عليّ بن أبي طالب (عليهم السلام).\n\n'
                      'وقال أيضاً الصّاحب بن عبّاد في وصف علم عبد العظيم انّه روى أبو تراب الروياني ، قال : سمعت أبا حماد الرّازي يقول : دخلت على الامام عليّ النّقي (عليه السلام) في سرّ من رأى فسألته عن أشياء من حلالي وحرامي ، فأجابني . فلمّا ودّعته قال لي : يا حماد اذا أشكل عليك شيء من أمور دينك بناحيتك أي في بلدة الرّي فسل عنه عبد العظيم بن عبد الله الحسني واقرأه منّي السّلام.\n\n'
                      'وقال المحقّق الدّاماد في كتاب الرّواشح انّ في فضل زيارة عبد العظيم روايات متظافرة ، وروى : انّ من زار قبره وجبت له الجنّة، وهذا الحديث رواه أيضاً الشّهيد الثّاني (رحمه الله) في حواشي الخلاصة عن بعض النسّابين.\n\n'
                      'وروى ابن بابويه وابن قولويه بسند معتبر عن رجل من أهل الرّي عن الامام عليّ النّقي صلوات الله عليه ، قال : دخلت عليه ، فقال : أين كنت ؟ فقلت : زُرت الحسين (عليه السلام) ، قال : أما لو انّك زرت قبر عبد العظيم (عليه السلام) عندكم لكنت كمن زار الحسين بن عليّ صلوات الله عليهما.'
                      'أقول : لم يذكر العلماء زيارة خاصّة وانّما قال فخر المحقّقين جمال الدّين في مزاره انّ من المناسب أن يُزار هكذا :\n\n'
                      'اَلسَّلامُ عَلى آدَمَ صَفْوَةِ اللهِ، اَلسَّلامُ عَلى نُوح نَبِىِّ اللهِ، اَلسَّلامُ عَلى اِبْراهيَم خَليلِ اللهِ، اَلسَّلامُ عَلى مُوسى كَليمِ اللهِ، اَلسَّلامُ عَلى عيسى رُوحِ اللهِ، اَلسَّلامُ عَلَيْكَ يا رَسُولَ اللهِ، اَلسَّلامُ عَلَيْكَ يا خَيْرَ خَلْقِ اللهِ، اَلسَّلامُ عَلَيْكَ يا صَفِىَّ اللهِ، اَلسَّلامُ عَلَيْكَ يا مُحَمَّدَ بْنَ عَبْدِ اللهِ خاتَمَ النَّبِيّينَ، اَلسَّلامُ عَلَيْكَ يا اَميرَ الْمُؤْمِنينَ عَلِىَّ بْنَ اَبى طالِب وَصِىَّ رَسُولِ اللهِ، اَلسَّلامُ عَلَيْكِ يا فاطِمَةُ سَيِّدَةَ نِساءِ الْعالَمينَ، اَلسَّلامُ عَلَيْكُما يا سِبْطَىِ الرَّحْمَةِ وَسَيَّدَىْ شَبابِ اَهْلِ الْجَنَّةِ، اَلسَّلامُ عَلَيْكَ يا عَلِىَّ بْنَ الْحُسَيْنِ سَيِّدَ الْعابِدينَ وَقُرَّةَ عَيْنِ النّاظِرينَ، اَلسَّلامُ عَلَيْكَ يا مُحَمَّدَ بْنَ عَلِىٍّ باقِرَ الْعِلْمِ بَعْدَ النَّبِىِّ، اَلسَّلامُ عَلَيْكَ يا جَعْفَرَ بْنَ مُحَمَّد الصّادِقَ الْبارَّ الاَْمينَ، اَلسَّلامُ عَلَيْكَ يا مُوسَى بْنَ جَعْفَر الطّاهِرِ الْطُّهْرِ اَلسَّلامُ عَلَيْكَ يا عَلِىَّ بْنَ مُوسَى الرِّضَا الْمُرْتَضى، اَلسَّلامُ عَلَيْكَ يا مُحَمَّدَ بْنَ عَلِىٍّ التَّقِىَّ، اَلسَّلامُ عَلَيْكَ يا عَلِىَّ بْنَ '
                      'مُحَمَّد النِّقِىَّ النّاصِحَ الاَْمينَ، اَلسَّلامُ عَلَيْكَ يا حَسَنَ بْنَ عَلِىٍّ، اَلسَّلامُ عَلَى الْوَصِىِّ مِنْ بَعْدِهِ، اَللّـهُمَّ صَلِّ عَلى نُورِكَ وَسِراجِكَ وَوَلِىِّ وَلِيِّكَ وَوَصِىِّ وَصِيِّكَ وَحُجَّتِكَ عَلى خَلْقِكَ، اَلسَّلامُ عَلَيْكَ اَيُّهَا السَّيِّدُ الزَّكِىُّ وَالطّاهِرُ الصَّفِىُّ، اَلسَّلامُ عَلَيْكَ يَا بْنَ السّادَةِ الاَْطْهارِ، اَلسَّلامُ عَلَيْكَ يَا بْنَ الْمُصْطَفِيْنَ الاَْخْيارِ، اَلسَّلامُ عَلى رَسُولِ اللهِ و عَلى ذُرِّيَّةِ رَسُولِ اللهِ وَرَحْمَةُ اللهِ و بَرَكاتُهُ، اَلسَّلامُ عَلَى الْعَبْدِ الصّالِحِ الْمُطيعِ للهِ رَبِّ الْعالَمينَ وَلِرَسُولِهِ وَلاَِميرِ الْمُؤْمِنينَ، اَلسَّلامُ عَلَيْكَ يا اَبَا الْقاسِمِ ابْنَ السِّبْطِ الْمُنْتَجَبِ، الُْمجْتَبى السَّلامُ عَلَيْكَ يا مَنْ بِزِيارَتِهِ ثَوابُ زِيارَةِ سَيِّدِ الْشُّهَداءِ يُرْتَجى، اَلسَّلامُ عَلَيْكَ عَرَّفَ اللهُ بَيْنَنا وَبَيْنَكُمْ فى الْجَنَّةِ وَحَشَرَنا فى زُمْرَتِكُمْ، وَاَوْرَدَنا حَوْضَ نَبِيِّكُمْ وَسَقانا بِكَأسِ جَدِّكُمْ مِنْ يَدِ عَلِىِّ بْنِ اَبى طالِب صَلَواتُ اللهِ عَلَيكُمْ اَسْأَلُ اللهَ اَنْ يُرِيَنا فيكُمُ السُّرُورَ وَالْفَرَجَ، وَاَنْ يَجْمَعَنا وَاِيّاكُمْ فى زُمْرَةِ جَدِّكُمْ مُحَمَّد صَلَّى اللهُ عَلَيْهِ وَآلِهِ، وَاَنْ لا يَسْلُبَنا مَعْرِفَتَكُمْ اِنَّهُ وَلِىٌّ قَديرٌ، اَتَقَرَّبُ اِلَى اللهِ بِحُبِّكُمْ وَالْبَراءَةِ مِنْ اَعْدآئِكُمْ، وَالتَّسْليمِ اِلَى اللهِ راضِياً '
                      'بِهِ غَيْرَ مُنْكِر وَلا مُسْتَكْبِر، وَعَلى يَقين مااَتى بِهِ مُحَمَّدٌ نَطْلُبُ بِذلِكَ وَجْهَكَ يا سَيِّدى اَللّـهُمَّ وَرِضاكَ وَالدّارَ الاْخِرَةِ يا سَيِّدى وَابْنَ سَيِّدى اِشْفَعْ لِى فِى الْجَنَّةِ فَاِنَّ لَكَ عِنْدَ اللهِ شَأناً مِنَ الشَّأنِ اَللّـهُمَّ اِنّى اَسْاَلُكَ اَنْ تَخْتِمَ لى بِالسَّعادَةِ فَلا تَسْلُبْ مِنّى ما اَنَا فيهِ وَلا حَوْلَ وَلا قُوَّةَ اِلاّ بِاللهِ الْعَلِىِّ الْعَظيمِ اَللّـهُمَّ اسْتَجِبْ لَنا وَتَقَبَّلْهُ بِكَرَمِكَ وَعِزَّتِكَ وَبِرَحْمَتِكَ وَعافِيَتِكَ وَصَلَّى اللهُ عَلى مُحَمَّد وَآلِهِ اَجْمَعينَ وَسَلَّمَ تَسْليماً يا اَرْحَمَ الرّاحِمينَ.\n\n'
                      'ثمّ قال المحقّق المذكور : ورد في بعض الاحاديث انّ عبد العظيم كان يخرج عند اقامته بالرّي مستتراً يزور القبر المقابل لقبره وبينهما الطّريق ويقول : هو رجل من ولد موسى بن جعفر (عليهما السلام) ونجد هناك في عصرنا قبراً ينسب الى حمزة بن الامام موسى (عليه السلام) ، والظاهر انّه القبر الذي كان يزوره عبد العظيم وينبغي زيارته ايضاً ان شاء الله ولا بأس بأن يزار بهذه الزّيارة الاّ انّه يحذف منها الجملة : اَلسَّلامُ عَلَيْكَ يا اَبَا الْقاسِمِ والجملة الّتي تليها ، انتهى.'
                      'لا يخفى عليك انّ قبر الشّيخ الجليل السّعيد قدوة المفسّرين جمال الدّين أبي الفتوح حسين بن علي الخزاعي (رحمه الله)صاحب التّفسير المعروف واقع في صحن حمزة (عليه السلام) وينبغي زيارته ، والشّيخ الصّدوق رئيس المحدّثين المعروف بابن بابويه قبره بقرب بلدة شاهزاده عبد العظيم فلا تغفل عن زيارته ايضاً.',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
            ],
          ),
        ),
        bottomNavigationBar: AddCustomBottomNavigationBar(
          pushNext: FiZiyaratKobourLmo2minin.screenRoute,
          pushBack: HadisAlkisa2.screenRoute,
          soud: 'https://cdn.jsdelivr.net/gh/SounaDiab/image_audio@master/audio/في زيارة الابناء العظماء.mp3',
          onTap: (double fontSize) {
            // تحديث حجم الخط
            setState(() {
              isTablet ? _fontSizeTablet = fontSize : _fontSize = fontSize;
            });
            print('fontSize: $fontSize');
            // إغلاق Dialog
            Navigator.of(context).pop();
          },
          onLongPress: () {
            final snackBar = SnackBar(
              content: Center(
                child: Text(
                  '${isTablet ? _fontSizeTablet.toInt() : _fontSize.toInt()}',
                  style: TextStyle(
                    color: Colors.white,
                    fontSize: 16,
                  ),
                ),
              ),
              width: 60,
              behavior: SnackBarBehavior.floating,
              backgroundColor: Colors.blue,
              duration: Duration(seconds: 2),
              shape: ShapeBorder.lerp(
                RoundedRectangleBorder(
                  borderRadius: BorderRadius.circular(50),
                ),
                RoundedRectangleBorder(
                  borderRadius: BorderRadius.circular(50),
                ),
                1,
              ),
            );
            ScaffoldMessenger.of(context).showSnackBar(snackBar);
          },
        ),
      ),
    );
  }
}
