import 'package:flutter/material.dart';
import 'package:maktabat_almoslim/widgets/container_scrollview.dart';
import 'package:provider/provider.dart';
import 'package:shared_preferences/shared_preferences.dart';

import '../../../../widgets/add_custom_bottom_navigation_bar.dart';
import '../../../../widgets/list_of_nine_verses.dart';
import '../../../favorites_provider.dart';
import '../../../favorites_screen.dart';
import '../alziyarat_aljami3a_walsalawat.dart';
import 'aakib_ziyarat_al2a2ima.dart';
import 'fi_ziyarat_l2abiya2_l3izam.dart';

class MaYozarKol2imam extends StatefulWidget {
  static String screenRoute = 'ma_yozar_kol_2imam_screen';
  const MaYozarKol2imam({super.key});

  @override
  State<MaYozarKol2imam> createState() => _MaYozarKol2imamState();
}

double _fontSize = 18;
double _fontSizeTablet = 30;

class _MaYozarKol2imamState extends State<MaYozarKol2imam> {
  bool isIcon = true;
  @override
  void initState() {
    super.initState();
    _loadFavoriteState();
  }

  Future<void> _loadFavoriteState() async {
    final prefs = await SharedPreferences.getInstance();
    bool? savedState = prefs.getBool('isFavorite_ma_yozar_kol_2imam_screen');
    setState(() {
      isIcon = savedState ?? true;
    });
  }

  Future<void> _saveFavoriteState(bool value) async {
    final prefs = await SharedPreferences.getInstance();
    await prefs.setBool('isFavorite_ma_yozar_kol_2imam_screen', value);
  }

  Future<bool> _onWillPop() async {
    final args =
        ModalRoute.of(context)!.settings.arguments as Map<String, dynamic>?;
    final previousPage = args?['previousPage'];
    if (previousPage == 'favorite_screen') {
      Navigator.of(context).pushReplacementNamed(FavoritesScreen.screenRoute);
      return false;
    } else {
      Navigator.of(context)
          .pushReplacementNamed(AlziyaratAljami3aWalsalawat.screenRoute);
      return false;
    }
  }

  @override
  Widget build(BuildContext context) {
    double size = MediaQuery.of(context).textScaleFactor;
    final screenWidth = MediaQuery.of(context).size.width;
    final isTablet = screenWidth >= 600;
    return WillPopScope(
      onWillPop: _onWillPop,
      child: Scaffold(
        appBar: AppBar(
          toolbarHeight: isTablet ? 100 : 50,
          centerTitle: true,
          leading: IconButton(
            onPressed: _onWillPop,
            icon: Icon(
              Icons.arrow_back,
              size: isTablet ? 50 : 25,
            ),
          ),
          actions: [
            IconButton(
              padding: EdgeInsets.only(left: isTablet ? 50 : 30),
              icon: Icon(
                isIcon ? Icons.favorite_border : Icons.favorite_rounded,
                size: isTablet ? 40 : 25,
                color: isIcon ? Colors.black : Colors.red,
              ),
              onPressed: () async {
                setState(() {
                  isIcon = !isIcon;
                });
                await _saveFavoriteState(isIcon);

                if (!isIcon) {
                  Provider.of<FavoritesProvider>(context, listen: false)
                      .addFavorite(
                          'في الزيارات الجامعة: وهي ما يزار كل إمام من الأئمة (عليهم السلام)',
                          MaYozarKol2imam.screenRoute);
                } else {
                  Provider.of<FavoritesProvider>(context, listen: false)
                      .removeFavorite(
                          'في الزيارات الجامعة: وهي ما يزار كل إمام من الأئمة (عليهم السلام)',
                          MaYozarKol2imam.screenRoute,
                          MaYozarKol2imam.screenRoute);
                }
              },
            ),
          ],
          title: Text(
            'في الزيارات الجامعة: وهي ما يزار كل إمام من الأئمة (عليهم السلام)',
            style: TextStyle(
              fontSize: isTablet
                  ? 40
                  : size > 1.0
                      ? 20
                      : 23,
              fontWeight: FontWeight.bold,
            ),
          ),
        ),
        body: ContainerScrollview(
          widget: Column(
            crossAxisAlignment: CrossAxisAlignment.start,
            children: [
              Container(
                child: Column(
                  children: [
                    Center(
                      child: Text(
                        'بسم الله الرحمن الرحيم',
                        style: TextStyle(
                          fontSize: isTablet ? _fontSizeTablet : _fontSize,
                          fontWeight: FontWeight.w900,
                        ),
                      ),
                    ),
                    Center(
                      child: Text(
                        'اللهم صلِّ على محمد وآل محمد',
                        style: TextStyle(
                          fontSize: isTablet ? _fontSizeTablet : _fontSize,
                          fontWeight: FontWeight.w900,
                        ),
                      ),
                    ),
                  ],
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: 'الزّيارة الأولى :',
                  subtitle:
                      'روى الصّدوق في كتاب من لا يحضره الفقيه أنّه سئل الرّضا (عليه السلام) عن إتيان أبي الحسن موسى (عليه السلام) قال : صلّوا في المساجد حوله ويجزي في المواضِع كلّها (أي يجزي في زيارة كلّ من الأئمة أو في مطلق المزارات الشّريفة المقدّسة كمراقد الأنبياء وسائر الأوصياء (عليهم السلام) كما هو الظّاهر) أن تقول :\n\n'
                      'اَلسَّلامُ عَلى اَوْلِياءَ اللهِ وَاَصْفِيائِهِ، اَلسَّلامُ عَلى اُمَناءِ اللهِ وَاَحِبّائِهِ، اَلسَّلامُ عَلى اَنْصارِ اللهِ وَخُلَفائِهِ، اَلسَّلامُ عَلى مَحالِّ مَعْرِفَةِ اللهِ، اَلسَّلامُ عَلى مَساكِنِ ذِكْرِ اللهِ، اَلسَّلامُ عَلى مُظْهِرى اَمْرِ اللهِ وَنَهْيِهِ، اَلسَّلامُ عَلَى الدُّعاةِ اِلَى اللهِ، اَلسَّلامُ عَلَى الْمُسْتَقِرّينَ فى مَرْضاتِ اللهِ، اَلسَّلامُ عَلَى الُْمخْلِصينَ فى طاعَةِ اللهِ، اَلسَّلامُ عَلَى الاَْدِلاّءِ عَلَى اللهِ، اَلسَّلامُ عَلَى الَّذينَ مَنْ والاهُمْ فَقَدْ والَى اللهَ، وَمَنْ عاداهُمْ فَقَدْ عادَى اللهِ، وَمَنْ عَرَفَهُمْ فَقَدْ عَرَفَ اللهَ، وَمَنْ جَهِلَهُمْ فَقَدْ جَهِلَ اللهَ، وَمَنِ اعْتَصَمَ بِهِمْ فَقَدِ اعْتَصَمَ بِاللهِ، وَمَنْ تَخَلّى مِنْهُمْ فَقَدْ تَخَلّى مِنَ اللهِ عَزَّوَجَلَّ، وَاُشْهِدُ اللهَ اَنّى سِلْمٌ لِمَنْ سالَمْتُمْ، وَحَرْبٌ لِمَنْ حارَبْتُمْ، مُؤْمِنٌ بِسِرِّكُمْ وَعَلانِيَتِكُمْ، مُفَوِّضٌ فى ذلِكَ كُلِّهِ اِلَيْكُمْ، لَعَنَ اللهُ عَدُوَّ آلِ مُحَمَّدٍ مِنَ الْجِنِّ وَالاِْنْسِ وَاَبْرَأُ اِلَى اللهِ مِنْهُمْ، وَصَلَّى اللهُ عَلى مُحَمَّدٍ وَآلِهِ.\n\n'
                      'وهذه الزّيارة موجودة في الكافي والتّهذيب وكامل الزّيارة، وقد ورد بعد هذه الزّيارة في جميع مصادرها.\n\n'
                      'إنّ هذا (أي القول والمراد به هذه الزّيارة) يجزي في الزّيارات كلّها، وتكثر من الصّلاة على محمّدٍ وآله وتسمّي واحداً واحداً بأسمائهم وتبرأ من أعدائهم ، وتخيّر ما شئت من الدّعاء لنفسك والمؤمنين والمؤمنات.\n\n'
                      'أقول : هذه التتمّة على الظّاهر جزء الرّواية ومن كلام المعصوم (عليه السلام) ولكن حتّى لو فرضناها خارجة عن الرّواية وقلنا انّها من كلام بعض المحدّثين فنحن مطمئنّون بأنّ الزّيارة جامعة، فالأعاظم من مشايخ الحديث قد ارتأوا طبقاً لما يدلّ عليه مفتتح الحديث انّها تجزي في كافّة المشاهد فرووها في باب الزّيارات الجامعة، والتّعابير الواردة في الزّيارة هي أيضاً كافّة من الصّفات الجامعة التي لا تخصّ بعضاً دون بعض ، فمن المناسب أن يُزار بها في جميع المشاهد حتّى مشاهد الأنبياء والأوصياء (عليهم السلام) كما أوردها جمع من العلماء لمشهد يونس (عليه السلام) وقد أمر في ذيل الرّواية بالصّلاة على محمّدٍ وآله واحداً واحداً ، فمن المناسب لذلك جدّاً قراءة الصّلاة المنسوبة الى أبي الحسن الضّرّاب التي مضت في أعمال يوم الجمعة.',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: 'الزّيارة الثّانية :',
                  subtitle:
                      'روى الصّدوق أيضاً في الفقيه والعيون عن موسى بن عبد الله النّخعي انّه قال للإمام عليّ النّقي (عليه السلام) : علّمني يا ابن رسول الله (صلى الله عليه وآله وسلم) قولاً أقوله بليغاً كاملاً إذا زُرت واحداً منكم ، فقال : إذا صرت الى الباب فقف واشهد الشّهادتين أي قُل : اَشْهَدُ اَنْ لا اِلـهَ اِلاَّ اللهُ وَحْدَهُ لا شَريكَ لَهُ، وَاَشْهَدُ اَنَّ مُحَمَّداً صَلَّى اللهُ عَلَيْهِ وَآلِهِ عَبْدُهُ وَرَسُولُهُ وأنت على غُسل ، فاذا دخلت ورأيت القبر فقف وقُل : اَللهُ اَكْبَرُ ثلاثين مرّة ، ثمّ امشِ قليلاً وعليك السّكينة والوقار وقارب بين خطاك ثمّ قف وكبّر الله عزّ وجلّ ثلاثين مرّة ، ثمّ ادنُ من القبر وكبّر الله أربعين مرّة تمام مائة تكبيرة ، ولعلّ الوجه في الامر بهذه التّكبيرات هو الاحتراز عمّا قد تورثه أمثال هذه العباير الواردة في الزّيارة من الغُلوّ أو الغفلة عن عظمة الله سبحانه وتعالى فالطّباع مائلة الى الغلوّ أو غير ذلك من الوجوه ، ثمّ قُل :\n\n'
                      'اَلسَّلامُ عَلَيْكُمْ يا اَهْلَ بَيْتِ النُّبُوَّةِ، وَمَوْضِعَ الرِّسالَةِ، وَمُخْتَلَفَ الْمَلائِكَةِ، وَمَهْبِطَ الْوَحْىِ، وَمَعْدِنَ الرَّحْمَةِ، وَخُزّانَ الْعِلْمِ، وَمُنْتَهَى الْحِلْمِ، وَاُصُولَ الْكَرَمِ، وَقادَةَ الاُْمَمِ، وَاَوْلِياءَ النِّعَمِ، وَعَناصِرَ الاَْبْرارِ، وَدَعائِمَ الاَْخْيارِ، وَساسَةَ الْعِبادِ، وَاَرْكانَ الْبِلادِ، وَاَبْوابَ الاْيمانِ، وَاُمَناءَ الرَّحْمنِ، وَسُلالَةَ النَّبِيّينَ، وَصَفْوَةَ الْمُرْسَلينَ، وَعِتْرَةَ خِيَرَةِ رَبِّ الْعالَمينَ وَرَحْمَةُ اللهِ وَبَرَكاتُهُ، اَلسَّلامُ عَلى اَئِمَّةِ الْهُدى، وَمَصابيحِ الدُّجى، وَاَعْلامِ التُّقى، وَذَوِى النُّهى، وَاُولِى الْحِجى، وَكَهْفِ الْوَرى، وَوَرَثَةِ الاَْنْبِياءِ، وَالْمَثَلِ الاَْعْلى، وَالدَّعْوَةِ الْحُسْنى، '
                      'وَحُجَجِ اللهِ عَلى اَهْلِ الدُّنْيا وَالاْخِرَةِ وَالاُْولى وَرَحْمَةُ اللهِ وَبَرَكاتُهُ، اَلسَّلامُ عَلى مَحالِّ مَعْرِفَةِ اللهِ، وَمَساكِنِ بَرَكَةِ اللهِ، وَمَعادِنِ حِكْمَةِ اللهِ، وَحَفَظَةِ سِرِّ اللهِ، وَحَمَلَةِ كِتابِ اللهِ، وَاَوْصِياءِ نَبِىِّ اللهِ، وَذُرِّيَّةِ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَآلِهِ وَرَحْمَةُ اللهِ وَبَرَكاتُهُ، اَلسَّلامُ عَلَى الدُّعاةِ اِلَى اللهِ، وَالاَْدِلاّءِ عَلى مَرْضاتِ اللهِ، وَالْمُسْتَقِرّينَ فى اَمْرِ اللهِ، وَالتّامّينَ فى مَحَبَّةِ اللهِ، وَالُْمخْلِصينَ فـى تَوْحيدِ اللهِ، وَالْمُظْهِرينَ لاَِمْرِ اللهِ وَنَهْيِهِ، وَعِبادِهِ الْمُكْرَمينَ الَّذينَ لا يَسْبِقُونَهُ بِالْقَوْلِ وَهُمْ بِاَمْرِهِ يَعْمَلُونَ وَرَحْمَةُ اللهِ وَبَرَكاتُهُ، اَلسَّلامُ عَلَى الاَْئِمَّةِ الدُّعاةِ، وَالْقادَةِ الْهُداةِ، وَالسّادَةِ الْوُلاةِ، وَالذّادَةِ الْحُماةِ، وَاَهْلِ الذِّكْرِ وَاُولِى الاَْمْرِ، وَبَقِيَّةِ اللهِ وَخِيَرَتِهِ وَحِزْبِهِ وَعَيْبَةِ عِلْمِهِ وَحُجَّتِهِ وَصِراطِهِ وَنُورِهِ وَبُرْهانِهِ وَرَحْمَةُ اللهِ وَبَرَكاتُهُ، اَشْهَدُ اَنْ لا اِلـهَ اِلاَّ اللهُ وَحْدَهُ لا شَريكَ لَهُ كَما شَهِدَ اللهُ لِنَفْسِهِ وَشَهِدَتْ لَهُ مَلائِكَتُهُ وَاُولُو الْعِلْمِ مِنْ خَلْقِهِ، لا اِلـهَ اِلاّ هُوَ الْعَزِيزُ الْحَكيمُ، وَاَشْهَدُ اَنَّ مُحَمَّداً عَبْدُهُ '
                      'الْمُنْتَجَبُ، وَرَسُولُهُ الْمُرْتَضى، اَرْسَلَهُ بِالْهُدى وَدينِ الْحَقِّ لِيُظْهِرَهُ عَلَى الدِّينِ كُلِّهِ وَلَوْ كَرِهَ الْمُشْرِكُونَ، وَاَشْهَدُ اَنَّكُمُ الاَْئِمَّةُ الرّاشِدُونَ الْـمَهْدِيُّونَ الْمَعْصُومُونَ الْمُكَرَّمُونَ الْمُقَرَّبُونَ الْمُتَّقُونَ الصّادِقُونَ الْمُصْطَفَوْنَ الْمُطيعُونَ للهِ، الْقَوّامُونَ بِاَمْرِهِ، الْعامِلُونَ بِاِرادَتِهِ، الْفائِزُونَ بِكَرامَتِهِ، اصْطَفاكُمْ بِعِلْمِهِ، وَارْتَضاكُمْ لِغَيْبِهِ، وَاخْتارَكُمْ لِسِرِّهِ، وَاجْتَباكُمْ بِقُدْرَتِهِ، وَاَعَزَّكُمْ بِهُداهُ، وَخَصَّكُمْ بِبُرْهانِهِ، وَانْتَجَبَكُمْ لِنُورِهِ، وَاَيَّدَكُمْ بِرُوحِهِ، وَرَضِيَكُمْ خُلَفاءَ فى اَرْضِهِ، وَحُجَجاً عَلى بَرِيَّتِهِ، وَاَنْصاراً لِدينِهِ، وَ حَفَظَةً لِسِرِّهِ، وَخَزَنَةً لِعِلْمِهِ، وَمُسْتَوْدَعاً لِحِكْمَتِهِ، وَتَراجِمَةً لِوَحْيِهِ، وَاَرْكاناً لِتَوْحيدِهِ، وَشُهَداءَ عَلى خَلْقِهِ، وَاَعْلاماً لِعِبادِهِ، وَمَناراً فى بِلادِهِ، '
                      'وَاَدِلاّءَ عَلى صِراطِهِ، عَصَمَكُمُ اللهُ مِنَ الزَّلَلِ، وَآمَنَكُمْ مِنَ الْفِتَنِ، وَطَهَّرَكُمْ مِنَ الدَّنَسِ، وَاَذْهَبَ عَنْكُمُ الرِّجْسَ وَطَهَّرَكُمْ تَطْهيراً، فَعَظَّمْتُمْ جَلالَهُ، وَاَكْبَرْتُمْ شَأْنَهُ، وَمَجَّدْتُمْ كَرَمَهُ، وَاَدَمْتُمْ ذِكْرَهُ، وَوَكَّدْتُمْ ميثاقَهُ، وَاَحْكَمْتُمْ عَقْدَ طاعَتِهِ، وَنَصَحْتُمْ لَهُ فِى السِّرِّ وَالْعَلانِيَةِ، وَدَعَوْتُمْ اِلى سَبيلِهِ بِالْحِكْمَةِ وَالْمَوْعِظَةِ الْحَسَنَةِ، وَبَذَلْتُمْ اَنْفُسَكُمْ فى مَرْضاتِهِ، وَصَبَرْتُمْ عَلى ما اَصابَكُمْ فى جَنْبِهِ، وَاَقَمْتُمُ الصَّلاةَ، وَآتَيْتُمُ الزَّكاةَ، وَاَمَرْتُمْ بِالْمَعْرُوفِ، وَنَهَيْتُمْ عَنِ الْمُنْكَرِ، وَجاهَدْتُمْ فِى اللهِ حَقَّ جِهادِهِ حَتّى اَعْلَنْتُمْ دَعْوَتَهُ، وَبَيَّنْتُمْ فَرائِضَهُ، وَاَقَمْتُمْ حُدُودَهُ، وَنَشَرْتُمْ شَرايِعَ اَحْكامِهِ، وَسَنَنْتُمْ سُنَّتَهُ، وَصِرْتُمْ فى ذلِكَ مِنْهُ اِلَى الرِّضا، وَسَلَّمْتُمْ لَهُ الْقَضاءَ، وَصَدَّقْتُمْ مِنْ رُسُلِهِ مَنْ مَضى، فَالرّاغِبُ عَنْكُمْ مارِقٌ، وَاللاّزِمُ لَكُمْ لاحِقٌ، وَالْمُقَصِّرُ فى حَقِّكُمْ زاهِقٌ، وَالْحَقُّ مَعَكُمْ وَفيكُمْ وَمِنْكُمْ وَاِلَيْكُمْ وَاَنْتُمْ اَهْلُهُ وَمَعْدِنُهُ، وَميراثُ النُّبُوَّةِ عِنْدَكُمْ، وَاِيابُ الْخَلْقِ اِلَيْكُمْ، وَحِسابُهُمْ عَلَيْكُمْ، وَفَصْلُ الْخِطابِ عِنْدَكُمْ، '
                      'وَآياتُ اللهِ لَدَيْكُمْ، وَعَزائِمُهُ فيكُمْ، وَنُورُهُ وَبُرْهانُهُ عِنْدَكُمْ، وَاَمْرُهُ اِلَيْكُمْ، مَنْ والاكُمْ فَقَدْ والَى اللهَ، وَمَنْ عاداكُمْ فَقَدْ عادَ اللهَ، وَ مَنْ اَحَبَّكُمْ فَقَدْ اَحَبَّ اللهَ، وَمَنْ اَبْغَضَكُمْ فَقَدْ اَبْغَضَ اللهَ، وَمَنِ اعْتَصَمَ بِكُمْ فَقَدِ اعْتَصَمَ بِاللهِ، اَنْتُمُ الصِّراطُ الاَْقْوَمُ، وَشُهَداءُ دارِ الْفَناءِ، وَشُفَعاءُ دارِ الْبَقاءِ، وَالرَّحْمَةُ الْمَوْصُولَةُ، وَالاْيَةُ الَْمخْزُونَةُ، وَالاَْمانَةُ الُْمحْفُوظَةُ، وَالْبابُ الْمُبْتَلى بِهِ النّاسُ، مَنْ اَتاكُمْ نَجا، وَمَنْ لَمْ يَأتِكُمْ هَلَكَ، اِلَى اللهِ تَدْعُونَ، وَعَلَيْهِ تَدُلُّونَ، وَبِهِ تُؤْمِنُونَ، وَلَهُ تُسَلِّمُونَ، وَبِاَمْرِهِ تَعْمَلُونَ، وَاِلى سَبيلِهِ تُرْشِدُونَ، وَبِقَوْلِهِ تَحْكُمُونَ، سَعَدَ مَنْ والاكُمْ، '
                      'وَهَلَكَ مَنْ عاداكُمْ، وَخابَ مَنْ جَحَدَكُمْ، وَضَلَّ مَنْ فارَقَكُمْ، وَفازَ مَنْ تَمَسَّكَ بِكُمْ، وَاَمِنَ مَنْ لَجَاَ اِلَيْكُمْ، وَسَلِمَ مَنْ صَدَّقَكُمْ، وَهُدِىَ مَنِ اعْتَصَمَ بِكُمْ، مَنِ اتَّبَعَكُمْ فَالْجَنَّةُ مَأواهُ، وَمَنْ خالَفَكُمْ فَالنّارُ مَثْوايهُ، وَمَنْ جَحَدَكُمْ كافِرٌ، وَمَنْ حارَبَكُمْ مُشْرِكٌ، وَمَنْ رَدَّ عَلَيْكُمْ فى اَسْفَلِ دَرْك مِنَ الْجَحيمِ، اَشْهَدُ اَنَّ هذا سابِقٌ لَكُمْ فيما مَضى، وَجارٍ لَكُمْ فيما بَقِىَ، وَاَنَّ اَرْواحَكُمْ وَنُورَكُمْ وَطينَتَكُمْ واحِدَةٌ، طابَتْ وَطَهُرَتْ بَعْضُها مِنْ بَعْض، خَلَقَكُمُ اللهُ اَنْواراً فَجَعَلَكُمْ بِعَرْشِهِ مُحْدِقينَ حَتّى مَنَّ عَلَيْنا بِكُمْ، فَجَعَلَكُمْ فى بُيُوت اَذِنَ اللهُ اَنْ تُرْفَعَ وَيُذْكَرَ فيهَا اسْمُهُ، وَجَعَلَ صَلَواتِنا عَلَيْكُمْ وَما خَصَّنا بِهِ مِنْ وِلايَتِكُمْ طيباً لِخَلْقِنا، وَطَهارَةً لاَِنْفُسِنا، وَتَزْكِيَةً لَنا، وَكَفّارَةً لِذُنُوبِنا، فَكُنّا عِنْدَهُ مُسَلِّمينَ بِفَضْلِكُمْ، وَمَعْرُوفينَ بِتَصْديقِنا اِيّاكُمْ، فَبَلَغَ اللهُ بِكُمْ اَشْرَفَ مَحَلِّ الْمُكَرَّمينَ، وَاَعْلى مَنازِلِ الْمُقَرَّبينَ، وَاَرْفَعَ دَرَجاتِ الْمُرْسَلينَ، حَيْثُ لا يَلْحَقُهُ لاحِقٌ، وَلا يَفُوقُهُ فائِقٌ، وَلا يَسْبِقُهُ سابِقٌ، وَلا يَطْمَعُ فى '
                      'اِدْراكِهِ طامِعٌ، حَتّى لا يَبْقى مَلَكٌ مُقَرَّبٌ، وَلا نَبِىٌّ مُرْسَلٌ، وَلا صِدّيقٌ وَلا شَهيدٌ، وَلا عالِمٌ وَلا جاهِلٌ، وَلا دَنِىٌّ وَلا فاضِلٌ، وَلا مُؤْمِنٌ صالِحٌ، وَلا فِاجِرٌ طالِحٌ، وَلاجَبّارٌ عَنيدٌ، وَلا شَيْطانٌ مَريدٌ، وَلا خَلْقٌ فيما بَيْنَ ذلِكَ شَهيدٌ اِلاّ عَرَّفَهُمْ جَلالَةَ اَمْرِكُمْ، وَعِظَمَ خَطَرِكُمْ، وَكِبَرَ شَأنِكُمْ وَتَمامَ نُورِكُمْ، وَصِدْقَ مَقاعِدِكُمْ، وَثَباتَ مَقامِكُمْ، وَشَرَفَ مَحَلِّكُمْ وَمَنْزِلَتِكُمْ عِنْدَهُ، وَكَرامَتَكُمْ عَلَيْهِ، وَخاصَّتَكُمْ لَدَيْهِ، وَقُرْبَ مَنْزِلَتِكُمْ مِنْهُ ،بِاَبى اَنْتُمْ وَاُمّى وَاَهْلى وَمالى وَاُسْرَتى اُشْهِدُ اللهَ وَاُشْهِدُكُمْ اَنّى مُؤْمِنٌ بِكُمْ وَبِما آمَنْتُمْ بِهِ، كافِرٌ بَعَدُوِّكُمْ وَبِما كَفَرْتُمْ بِهِ، مُسْتَبْصِرٌ بِشَأنِكُمْ وَبِضَلالَةِ مَنْ خالَفَكُمْ، مُوالٍ لَكُمْ وَلاَِوْلِيائِكُمْ، مُبْغِضٌ لاَِعْدائِكُمْ وَمُعادٍ لَهُمْ، سِلْمٌ لِمَنْ سالَمَكُمْ، وَحَرْبٌ لِمَنْ حارَبَكُمْ، مُحَقِّقٌ لِما حَقَّقْتُمْ، مُبْطِلٌ لِما اَبْطَلْتُمْ، مُطيعٌ لَكُمْ، عارِفٌ بِحَقِّكُمْ، مُقِرٌّ بِفَضْلِكُمْ، مُحْتَمِلٌ لِعِلْمِكُمْ، مُحْتَجِبٌ بِذِمَّتِكُمْ، مُعْتَرِفٌ بِكُمْ، مُؤْمِنٌ بِاِيابِكُمْ، مُصَدِّقٌ بِرَجْعَتِكُمْ، مُنْتَظِرٌ لاَِمْرِكُمْ، مُرْتَقِبٌ لِدَوْلَتِكُمْ، آخِذٌ بِقَوْلِكُمْ، عامِلٌ بِاَمْرِكُمْ، مُسْتَجيرٌ بِكُمْ، زائِرٌ لَكُمْ، لائِذٌ عائِذٌ بِقُبُورِكُمْ، مُسْتَشْفِعٌ اِلَى اللهِ عَزَّوَجَلَّ بِكُمْ، وَمُتَقَرِّبٌ بِكُمْ اِلَيْهِ، '
                      'وَمُقَدِّمُكُمْ اَمامَ طَلِبَتى وَحَوائِجى وَاِرادَتى فى كُلِّ اَحْوالي وَاُمُورى مُؤْمِنٌ بِسِرِّكُمْ وَعَلانِيَتِكُمْ وَشاهِدِكُمْ وَغائِبِكُمْ وَاَوَّلِكُمْ وَآخِرِكُمْ، وَمُفَوِّضٌ فى ذلِكَ كُلِّهِ اِلَيْكُمْ وَمُسَلِّمٌ فيهِ مَعَكُمْ، وَقَلْبى لَكُمْ مُسَلِّمٌ، وَرَأيى لَكُمْ تَبَعٌ، وَنُصْرَتى لَكُمْ مُعَدَّةٌ حَتّى يُحْيِىَ اللهُ تَعالى دينَهُ بِكُمْ، وَيَرُدَّكُمْ فى اَيّامِهِ، وَيُظْهِرَكُمْ لِعَدْلِهِ، وَيُمَكِّنَكُمْ فى اَرْضِهِ، فَمَعَكُمْ مَعَكُمْ لا مَعَ غَيْرِكُمْ، آمَنْتُ بِكُمْ وَتَوَلَّيْتُ آخِرَكُمْ بِما تَوَلَّيْتُ بِهِ اَوَّلَكُمْ، وَبَرِئْتُ اِلَى اللهِ عَزَّوَجَلَّ مِنْ اَعْدائِكُمْ وَمِنَ الْجِبْتِ وَالطّاغُوتِ وَالشَّياطينِ وَحِزْبِهِمُ الظّالِمينَ لَكُمُ، الْجاحِدينَ لِحَقِّكُمْ، وَالْمارِقينَ مِنْ وِلايَتِكُمْ، وَالْغاصِبينَ لاِِرْثِكُمُ الشّاكّينَ فيكُمُ الْمُنْحَرِفينَ عَنْكُمْ، وَمِنْ كُلِّ وَليجَةٍ دُونَكُمْ وَكُلِّ مُطاعٍ سِواكُمْ، وَمِنَ الاَْئِمَّةِ الَّذينَ يَدْعُونَ اِلَى النّارِ، فَثَبَّتَنِىَ اللهُ اَبَداً ما حَييتُ عَلى مُوالاتِكُمْ وَمَحَبَّتِكُمْ وَدينِكُمْ، وَوَفَّقَنى '
                      'لِطاعَتِكُمْ، وَرَزَقَنى شَفاعَتَكُمْ، وَجَعَلَنى مِنْ خِيارِ مَواليكُمْ التّابِعينَ لِما دَعَوْتُمْ اِلَيْهِ، وَ جَعَلَنى مِمَّنْ يَقْتَصُّ آثارَكُمْ، وَيَسْلُكُ سَبيلَكُمْ، وَيَهْتَدى بِهُداكُمْ وَيُحْشَرُ فى زُمْرَتِكُمْ، وَيَكِرُّ فى رَجْعَتِكُمْ، وَيُمَلَّكُ فى دَوْلَتِكُـمْ، وَ يُشَـرَّفُ فى عافِيَتِكُمْ، وَيُمَكَّنُ فى اَيّامِكُمْ، وَتَقِرُّ عَيْنُهُ غَداً بِرُؤْيَتِكُمْ، بِاَبى اَنْتُمْ وَاُمّى وَنَفْسى وَاَهْلى وَمالى مَنْ اَرادَ اللهَ بَدَأَ بِكُمْ، وَمَنْ وَحَّدَهُ قَبِلَ عَنْكُمْ، وَمَنْ قَصَدَهُ تَوَجَّهَ بِكُمْ، '
                      'مَوالِىَّ لا اُحْصـى ثَنائَكُمْ وَلا اَبْلُغُ مِنَ الْمَدْحِ كُنْهَكُمْ وَمِنَ الْوَصْفِ قَدْرَكُمْ، وَاَنْتُمْ نُورُ الاَْخْيارِ وَهُداةُ الاَْبْرارِ وَحُجَجُ الْجَبّارِ، بِكُمْ فَتَحَ اللهُ وَبِكُمْ يَخْتِمُ، وَبِكُمْ يُنَزِّلُ الْغَيْثَ، وَبِكُمْ يُمْسِكُ السَّماءَ اَنْ تَقَعَ عَلَى الاَْرْضِ اِلاّ بِاِذْنِهِ، وَبِكُمْ يُنَفِّسُ الْهَمَّ وَيَكْشِفُ الضُّرَّ، وَعِنْدَكُمْ ما نَزَلَتْ بِهِ رُسُلُهُ، وَهَبَطَتْ بِهِ مَلائِكَتُهُ وَاِلى جَدِّكُمْ.\n\n'
                      'وإن كانت الزّيارة لأمير المؤمنين (عليه السلام) فعوض وَاِلى جَدِّكُمْ قُل :\n\n'
                      'وَاِلى اَخيكَ بُعِثَ الرُّوحُ الاَْمينُ، آتاكُمُ اللهُ ما لَمْ يُؤْتِ اَحَداً مِنَ الْعالَمينَ، طَأطَاَ كُلُّ شَريفٍ لِشَرَفِكُمْ، وَبَخَعَ كُلُّ مُتَكَبِّرٍ لِطاعَتِكُمْ، وَخَضَعَ كُلُّ جَبّارٍ لِفَضْلِكُمْ، وَذَلَّ كُلُّ شَىْءٍ لَكُمْ، وَاَشْرَقَتِ الاَْرْضُ بِنُورِكُمْ، وَفازَ الْفائِزُونَ بِوِلايَتِكُمْ، بِكُمْ يُسْلَكُ اِلَى الرِّضْوانِ، وَعَلى مَنْ جَحَدَ وِلايَتَكُمْ غَضَبُ الرَّحْمنِ، بِاَبى اَنْتُمْ وَاُمّى وَنَفسى وَاَهْلى وَمالى، ذِكْرُكُمْ فِى الذّاكِرينَ، وَاَسْماؤُكُمْ فِى الاَْسْماءِ، وَاَجْسادُكُمْ فِى الاَْجْسادِ، وَاَرْواحُكُمْ فِى اْلاََرْواحِ، وَاَنْفُسُكُمْ فِى النُّفُوسِ، وَآثارُكُمْ فِى الاْثارِ، وَقُبُورُكُمْ فِى الْقُبُورِ، فَما اَحْلى اَسْمائَكُمْ وَاَكْرَمَ اَنْفُسَكُمْ، وَاَعْظَمَ شَأنَكُمْ، وَاَجَلَّ خَطَرَكُمْ، وَاَوْفى عَهْدَكُمْ، وَاَصْدَقَ وَعْدَكُمْ، كَلامُكُمْ نُورٌ وَاَمْرُكُمْ رُشْدٌ وَوَصِيَّتُكُمُ التَّقْوى، وَفِعْلُكُمُ الْخَيْرُ، وَعادَتُكُمُ الاِْحْسانُ، وَسَجِيَّتُكُمُ الْكَرَمُ، وَشَأنُكُمُ الْحَقُّ وَالصِّدْقُ وَالرِّفْقُ، وَقَوْلُكُمْ حُكْمٌ وَحَتْمٌ، وَرَأيُكُمْ عِلْمٌ وَحِلْمٌ وَحَزْمٌ، اِنْ ذُكِرَ الْخَيْرُ كُنْتُمْ اَوَّلَهُ وَاَصْلَهُ وَفَرْعَهُ وَمَعْدِنَهُ وَمَأويهُ وَمُنْتَهاهُ، بِاَبى اَنْتُمْ وَاُمّى وَنَفْسى كَيْفَ اَصِفُ حُسْنَ ثَنائِكُمْ، وَاُحْصى جَميلَ بَلائِكُمْ، وَبِكُمْ اَخْرَجَنَا اللهُ مِنَ الذُّلِّ وَفَرَّجَ عَنّا غَمَراتِ '
                      'الْكُرُوبِ، وَاَنْقَذَنا مِنْ شَفا جُرُفِ الْهَلَكاتِ وَمِنَ النّارِ، بِاَبى اَنْتُمْ وَاُمّى وَنَفْسى بِمُوالاتِكُمْ عَلَّمَنَا اللهُ مَعالِمَ دِينِنا، وَاَصْلَحَ ماكانَ فَسَدَ مِنْ دُنْيانا، وَبِمُوالاتِكُمْ تَمَّتِ الْكَلِمَةُ، وَعَظُمَتِ النِّعْمَةُ، وَائْتَلَفَتِ الْفُرْقَةُ، وَبِمُوالاتِكُمْ تُقْبَلُ الطّاعَةُ الْمُفْتَرَضَةُ، وَلَكُمُ الْمَوَدَّةُ الْواجِبَةُ، وَالدَّرَجاتُ الرَّفيعَةُ، وَالْمَقامُ الَْمحْمُودُ، وَالْمَكانُ الْمَعْلُومُ عِنْدَ اللهِ عَزَّوَجَلَّ، وَالْجاهُ الْعَظيمُ، وَالشَّأنُ الْكَبيرُ، وَالشَّفاعَةُ الْمَقْبُولَةُ، رَبَّنا آمَنّا بِما اَنْزَلْتَ وَاتَّبَعْنَا الرَّسُولَ فَاكْتُبْنا مَعَ الشّاهِدينَ، رَبَّنا لا تُزِ غْ قُلُوبَنا بَعْدَ اِذْ هَدَيْتَنا وَهَبْ لَنا مِنْ لَدُنْكَ رَحْمَةً اِنَّكَ اَنْتَ الْوَهّابُ، سُبْحانَ رَبِّنا اِنْ كانَ وَعْدُ رَبِّنا لَمَفْعُولاً، يا وَلِىَّ اللهِ اِنَّ بَيْنى وَبيْنَ اللهِ عَزَّوَجَلَّ ذُنُوباً لا يَأتى عَلَيْها اِلاّ رِضاكُمْ، فَبِحَقِّ مَنِ ائْتَمَنَكُمْ عَلى سِرِّهِ وَاسْتَرْعاكُمْ اَمْرَ خَلْقِهِ وَقَرَنَ طاعَتَكُمْ بِطاعَتِهِ، لَمَّا اسْتَوْهَبْتُمْ ذُنُوبى وَكُنْتُمْ شُفَعائى، فَاِنّى لَكُمْ مُطيعٌ، مَنْ اَطاعَكُمْ فَقَدْ اَطاعَ اللهَ، وَمَنْ عَصاكُمْ فَقَدْ عَصَى اللهَ، وَمَنْ اَحَبَّكُمْ فَقَدْ اَحَبَّ اللهَ، وَمَنْ '
                      'اَبْغَضَكُمْ فَقَدْ اَبْغَضَ اللهَ، اَللّـهُمَّ اِنّى لَوْ وَجَدْتُ شُفَعاءَ اَقْرَبَ اِلَيْكَ مِنْ مُحَمِّدٍ وَاَهْلِ بَيْتِهِ الاَْخْيارِ الاَْئِمَّةِ الاَْبْرارِ لَجَعَلْتُهُمْ شُفَعائي، فَبِحَقِّهِمُ الَّذى اَوْجَبْتَ لَهُمْ عَلَيْكَ اَسْاَلُكَ اَنْ تُدْخِلَنى فى جُمْلَةِ الْعارِفينَ بِهِمْ وَبِحَقِّهِمْ، وَفى زُمْرَةِ الْمَرْحُومينَ بِشَفاعَتِهِمْ، اِنَّكَ اَرْحَمُ الرّاحِمينَ، وَصَلَّى اللهُ عَلى مُحَمَّدٍ وَآلِهِ الطّاهِرينَ وَسَلَّمَ تَسْليماً كَثيراً، وَحَسْبُنَا اللهُ وَنِعْـمَ الْوَكيلُ.\n\n'
                      'أقول : أورد الشّيخ أيضاً هذه الزّيارة في التّهذيب ثمّ ذيلها بوداع تركناه اختصاراً، وهذه الزّيارة كما صرّح به العلامة المجلسي (رحمه الله) إنّما هي أرقى الزّيارات الجامعة متناً وسنداً وهي أفصحها وأبلغها . وقال والده في شرح الفقيه : إنّ هذه الزّيارة أحسن الزّيارات وأكملها وإنّي لم أزر الأئمّة (عليهم السلام) ما دمت في الاعتاب المقدّسة الاّ بها، وقد أورد شيخنا في كتابه النجم الثّاقب قصّة تبدي لزوم المواظبة على هذه الزّيارة والاهتمام بها . قال : قدم النّجف الأشرف منذ سبع عشرة سنة تقريباً التّقيّ الصّالح السّيد أحمد ابن السّيد هاشم ابن السّيد حسن الموسوي الرّشتي أيّده الله وهو من تجّار مدينة رشت، '
                      'فزارني في بيتي بصحبة العالم الرّباني والفاضل الصّمداني الشّيخ علي الرّشتي طاب ثراه الآتي ذكره في القصّة الآتية إن شاء الله، فلمّا نهضا للخروج نبّهني الشّيخ الى أنّ السّيد أحمد من الصّلحاء المسدّدين ولمح الى أنّ له قصّة غريبة والمجال حينذاك لم يسمح بأن تفصّل وصادفت الشّيخ بعد بضعة أيّام ينبّئني بارتحال السّيد من النّجف ويحدث لي عن سيرته ويوقفني على قصّته الغريبة، فأسفت أسفاً بالغاً على ما فاتني من سماع القصّة منه نفسه وإن كنت أجل الشّيخ عن أن يخالف ما يرويه شيئاً ممّا وعته أذناه من السّيد نفسه، ولكنّي صادفت السّيد ثانياً في مدينة الكاظمين منذ عدّة أشهر وذلك في شهر جمادى الثّانية من سنتنا هذه حينما عُدت من النّجف الأشرف وكان السيّد راجعاً من سامراء وهو يؤمّ ايران، فطلبت اليه أن يحدث لي عن نفسه وعمّا كنت قد وقفت عليه ممّا عرض له في حياته فأجابني الى ذلك وكان ممّا حكاه قضيّتنا المعهودة حكاها برمّتها طبقاً لما كنت قد سمعته من قبل ، قال : غادرت سنة 1280 ] دار المرز  [مدينة رشت الى تبريز متوخياً حجّ بيت الله الحرام فحللت دار الحاج صفر عليّ '
                      'التبريزي التّاجر المعروف وظللت هناك حائراً لم أجد قافلة ارتحل معها حتّى جهز الحاج جبّار الرّائد ] جلو دار[ السدّهي الأصبهاني قافلة الی طرابوزن فأكريت منه مركوباً وصرت مع القافلة مفرداً من دون صديق وفي أول منزل من منازل السفر التحق بي رجال ثلاثة كان قد رغبهم في ذلك الحاج صفر علي وهم المولی الحاج باقر التبريزي الذي كان يحج بالنيابة عن الغير المعروف لدی العلماﺀ والحاج السيد حسين التبريزي التاجر ورجل يسمی الحاج علي وكان يخدم فتصاحبنا في الطريق حتی بلغنا ارزنة الروم ثم قصدنا من هناك الطرابوزن وفي احد المنازل التي بين البلدين أتانا الحاج جبار الرائد ] جلو دار[ ينبئنا بأنّ أمامنا اليوم طريقاً مخيفاً ويحذرنا عن التّخلّف عن الركب فقد كنّا نحن نبتعد غالباً عن القافلة ونتخلّف، فامتثلنا وعجلنا الى السّير واستأنفنا المسير معاً قبل الفجر بساعتين ونصف أو بثلاث ساعات فما سرنا نصف الفرسخ أو ثلاثة أرباعه إلاّ وقد أظلم الجوّ وتساقط الثّلج بحيث كان كلّ منّا قد غطّى '
                      'رأسه بما لديه من الغطاء واسرع في المسير ، أما أنا فلم يسعني اللّحوق بهم مهما اجتهدت في ذلك فتخلّفت عنهم وانفردت بنفسي في الطّريق فنزلت من ظهر فرسي وجلست في ناحية من الطّريق وأنا مضطرب غاية الاضطراب، فنفقة السّفر كانت كلّها معي وهي ستمائة توماناً، ففكرت في أمري مليّاً فقرّرت على أن لا أبرح مقامي حتّى يطلع الفجر ، ثمّ أعود الى المنزل الذي بتنا فيه ليلتنا الماضية ثم ارجع ثانياً مع عدّة من الحرس فالتحق بالقافلة وإذا بستان يبدو أمامي فيها فلاّح بيده مسحاة يضرب بها فروع الأشجار فيتساقط ما تراكم عليها من الثّلج، فدنا منّي وسألني من أنت؟ فأجبت : انّي قدتخلّفت عن الركب لا اهتدي الطريق، فخاطبني باللّغة الفارسية قائلاً : عليك بالنّافلة كي تهتدي، فأخذت في النّافلة وعندما فرغت من التهجّد أتاني ثانياً قائلاً : ألم تمض بعد ؟ قلت : والله لا اهتدي الى الطّريق ، قال : عليك بالزّيارة الجامعة الكبيرة وما كنت حافظاً لها والى الآن لا أقدر أن أقرأها من ظهر القلب مع تكرّر ارتحالي الى الأعتاب المقدّسة للزّيارة، فوقفت قائماً '
                      'وقرأت الزّيارة كاملة من ظهر القلب ، فبدالي الرّجل لما انتهيت قائلاً : ألم تبرح مكانك بعد ، فعرض لي البكاء وأجبته : لم اُغادر مكاني بعد فإنّي لا أعرف بالطريق ، فقال : عليك بزيارة العاشوراء ولم أكن مستظهراً لها أيضاً والى الآن لا أقدر أن أقرأها من ظهر قلبي ، فنهضت وأخذت في قراءتها من ظهر القلب حتى انتهيت من اللّعن والسّلام ودعاء علقمة ، فعاد الرّجل إليّ وقال : ألم تنطلق؟ فأجبته انّي سأظل هنا الى الصّباح ، فقال لي : أنا الآن ألحقك بالقافلة ، فركب حماراً وحمل المسحاة على عاتقه وقال لي : اردف لي على ظهر الحمار ، فردفت له ، ثمّ سحبت عنان فرسي فقاومني ولم '
                      'يجر معي ، فقال صاحبي : ناولني العنان . فناولته إيّاه ، فأخذ العنان بيمناه ووضع المسحاة على عاتقه الأيسر وأخذ في المسير فطاوعه الفرس أيسر المطاوعة، ثمّ وضع يده على ركبتي وقال : لماذا لا تؤدّون صلاة النّافلة النّافلة النّافلة، قالها ثلاث مرّات ، ثمّ قال أيضاً : لماذا تتركون زيارة عاشوراء ] زيارة [عاشوراء ] زيارة [ عاشوراء كرّرها ثلاث مرّات ، ثمّ قال : لماذا لا تزورون بالزّيارة الجامعة '
                      ' ] الكبيرة [ الجامعة الجامعة الجامعة، وكان يدور في مسلكه واذا به يلتفت الى الوراء ويقول : اولئك، أصحابك قد وردوا النّهر يتوضّؤون لفريضة الصبح ، فنزلت من ظهر الحمار وأردت أن أركب فرسي ، فلم أتمكّن من ذلك فنزل هو من ظهر حماره وأقام المسحاة في الثّلج وأركبني فحوّل بالفرس الى جانب الصّحب وإذا بي يجول في خاطري السّؤال من عساه يكون هذا الذي ينطق باللغة الفارسيّة في منطقة التّرك اليسوعيّين؟ '
                      'وكيف ألحقني بالصّحب خلال هذه الفترة القصيرة من الزّمان، فنظرت الى الوراء فلم أجد أحداً ولم أعثر على أثر يدلّ عليه فالتحقت بأصدقائي.',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: 'الزّيارة الثّالثة :',
                  subtitle:
                      ' ما جعلها العلامة المجلسي الثّامنة من الزّيارات الجامعة في كتابه تحفة الزائر ، وقال : هذه زيارة رواها السّيد ابن طاووس في خلال أدعية عرفة عن الصّادق صلوات الله عليه ويُزار بها في كلّ مكان وزمان لا سيّما في يوم عرفة وهي هذه الزّيارة :\n\n'
                      'اَلسَّلامُ عَلَيْكَ يا رَسُولَ اللهِ، اَلسَّلامُ عَلَيْكَ يا نَبِىَّ اللهِ، اَلسَّلامُ عَلَيْكَ يا خِيَرَةَ اللهِ مِنْ خَلْقِهِ وَاَمينَهُ عَلى وَحْيِهِ، اَلسَّلامُ عَلَيْكَ يا مَوْلاىَ يا اَميرَ الْمُؤْمِنينَ، اَلسَّلامُ عَلَيْكَ يا مَوْلاىَ، اَنْتَ حُجَّةُ اللهِ عَلى خَلْقِهِ وَبابُ عِلْمِهِ وَوَصِىُّ نَبِيِّهِ وَالْخَليفَةُ مِنْ بَعْدِهِ فى اُمَّتِهِ، لَعَنَ اللهُ اُمَّةً غَصَبَتْكَ حَقَّكَ وَقَعَدَتْ مَقْعَدَكَ، اَنَا بَريٌ مِنْهُمْ وَمِنْ شيعَتِهِمْ اِلَيْكَ، اَلسَّلامُ عَلَيْكِ يا فاطِمَةُ الْبَتُولُ، اَلسَّلامُ عَلَيْكِ يا زَيْنَ نِساءِ الْعالَمينَ، اَلسَّلامُ عَلَيْكِ يا بِنْتَ رَسُولِ اللهِ رَبِّ الْعالَمينَ صَلَّى اللهُ عَلَيكِ وَعَلَيْهِ، اَلسَّلامُ عَلَيْكِ يا اُمَّ الْحَسَنِ وَالْحُسَيْنِ، لَعَنَ اللهُ اُمَّةً غَصَبَتْكِ حَقَّكِ وَمَنَعَتْكِ ما جَعَلَهُ الله لَكِ حَلالاً، اَنَا بَريٌ اِلَيْكِ مِنْهُمْ وَمِنْ شيعَتِهِمْ، اَلسَّلامُ عَلَيْكَ يا مَوْلاىَ يا اَبا مُحَمَّد الْحَسَنِ الزَّكِىَّ، اَلسَّلامُ عَلَيْكَ يا مَوْلاىَ لَعَنَ اللهُ اُمَّةً قَتَلَتْكَ وَبايَعَتْ فى اَمْرِكَ وَشايَعَتْ اَنَا بَرئٌ اِلَيْكَ مِنْهُمْ وَمِنْ شيعَتِهِمْ، اَلسَّلامُ عَلَيْكَ يا مَوْلاىَ يا اَبا عَبْدَاللهِ الْحُسَيْنَ بْنَ عَلِىٍّ صَلَواتُ اللهِ عَلَيْكَ وَعَلى اَبيكَ وَجَدِّكَ مُحَمَّدٍ صَلَّى اللهُ عَلَيْهِ وَآلِهِ، لَعَنَ اللهُ اُمَّةً اسْتَحَلَّتْ دَمَكَ، وَلَعَنَ اللهُ اُمَّةً قَتَلَتْكَ وَاسْتَباحَتْ حَريمَكَ، وَلَعَنَ اللهُ اَشْياعَهُمْ وَاَتْباعَهُمْ، وَلَعَنَ اللهُ الْمُمَهِّدينَ لَهُمْ بِالَّتمْكينِ مِنْ قِتالِكُمْ، اَنَا بَرئٌ اِلَى اللهِ وَاِلَيْكَ '
                      'مِنْهُمْ، اَلسَّلامُ عَلَيْكَ يا مَوْلاىَ يا اَبا مُحَمَّد عَلِىَّ بْنَ الْحُسَيْنِ، اَلسَّلامُ عَلَيْكَ يا مَوْلاىَ يا اَبا جَعْفَر مُحَمَّدَ بْنَ عَلِىٍّ، اَلسَّلامُ عَلَيْكَ يا مَوْلاىَ يا اَبا عَبْدِاللهِ جَعْفَرَ بْنَ مُحَمَّد، اَلسَّلامُ عَلَيْكَ يا مَوْلاىَ يا اَبَا الْحَسَنِ مُوسَى بْنَ جَعْفَر، اَلسَّلامُ عَلَيْكَ يا مَوْلاىَ يا اَبَا الْحَسَنِ عَلِىَّ بْنَ موُسى، اَلسَّلامُ عَلَيْكَ يا مَوْلاىَ يا اَبا جَعْفَر مُحَمَّدَ بْنَ عَلِىٍّ، اَلسَّلامُ عَلَيْكَ يا مَوْلاىَ يا اَبَا الْحَسَنِ عَلِىَّ بْنَ مُحَمَّد، اَلسَّلامُ عَلَيْكَ يا مَوْلاىَ يا اَبا مُحَمَّد الْحَسَنَ بْنَ عَلِىٍّ، اَلسَّلامُ عَلَيْكَ يا مَوْلاىَ يا اَبَا الْقاسِمِ مُحَمَّدَ بْنَ الْحَسَنِ صاحِبَ الزَّمانِ، صَلَّى اللهُ عَلَيْكَ وَعَلى عِتْرَتِكَ الطّاهِرَةِ الطَّيِّبَةِ، يا مَوالِىَّ كُونُوا شُفَعائي فى حَطِّ وِزْرى وَخَطاياىَ، آمَنْتُ بِاللهِ وَبِما اُنْزِلَ اِلَيْكُمْ، وَاَتَوالى آخِرَكُمْ بِما اَتَوالى اَوَّلَكُمْ، وَبَرِئْتُ مِنَ الْجِبْتِ وَالطّاغوُتِ وَاللاّتِ وَالْعُزّى، يا مَوالِىَّ اَنَا سِلْمٌ لِمَنْ سالَمَكُمْ، وَحَرْبٌ لِمَنْ حارَبَكُمْ، وَعَدُوٌّ لِمَنْ عاداكُمْ، وَوَلِىٌّ لِمَنْ والاكُمْ اِلى يَوْمِ الْقِيامَةِ وَلَعَنَ اللهُ ظالِميكُمْ وَغاصِبيكُمْ، وَلَعَنَ اللهُ اَشْياعَهُمْ وَاَتْباعَهُمْ وَاَهْلَ مَذْهَبِهِمْ، وَاَبْرَأُ اِلىَ اللهِ وَاِلَيْكُمْ مِنْهُمْ.',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: 'الزّيارة الرّابعة :',
                  subtitle:
                      'هي الزّيارة المعروفة بزيارة أمين الله أوّلها اَلسَّلامُ عَلَيْكَ يا اَمينَ اللهِ فى اَرْضِهِ وَحُجَّتَهُ عَلى عِبادِهِ اَشْهَدُ اَنَّكَ جاهَدْتَ فِى اللهِ الى آخر ما مضى في زيارات الامير (عليه السلام) ، فنحن قد جعلناها الزّيارة الثّانية من زيارات امير المؤمنين (عليه السلام).',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: 'الزّيارة الخامسة :',
                  subtitle:
                      'زيارة اَلْحَمْدُ للهِ الَّذى اَشْهَدَنا مَشْهَدَ اَوْلِيآئِهِ فى رَجَب، الماضية في أعمال شهر رجب، فمجموع ما في هذا الكتاب من الزّيارات الجامعة يبلغ خمس زيارات وهي كافية إن شاء الله تعالى.',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
            ],
          ),
        ),
        bottomNavigationBar: AddCustomBottomNavigationBar(
          pushNext: AakibZiyaratAl2a2ima.screenRoute,
          pushBack: FiZiyaratL2abiya2L3izam.screenRoute,
          soud: '',
          onTap: (double fontSize) {
            // تحديث حجم الخط
            setState(() {
              isTablet ? _fontSizeTablet = fontSize : _fontSize = fontSize;
            });
            print('fontSize: $fontSize');
            // إغلاق Dialog
            Navigator.of(context).pop();
          },
          onLongPress: () {
            final snackBar = SnackBar(
              content: Center(
                child: Text(
                  '${isTablet ? _fontSizeTablet.toInt() : _fontSize.toInt()}',
                  style: TextStyle(
                    color: Colors.white,
                    fontSize: 16,
                  ),
                ),
              ),
              width: 60,
              behavior: SnackBarBehavior.floating,
              backgroundColor: Colors.blue,
              duration: Duration(seconds: 2),
              shape: ShapeBorder.lerp(
                RoundedRectangleBorder(
                  borderRadius: BorderRadius.circular(50),
                ),
                RoundedRectangleBorder(
                  borderRadius: BorderRadius.circular(50),
                ),
                1,
              ),
            );
            ScaffoldMessenger.of(context).showSnackBar(snackBar);
          },
        ),
      ),
    );
  }
}
