import 'package:flutter/material.dart';
import 'package:maktabat_almoslim/screens/favorites_provider.dart';
import 'package:maktabat_almoslim/widgets/container_scrollview.dart';
import 'package:provider/provider.dart';
import 'package:shared_preferences/shared_preferences.dart';

import '../../../../widgets/add_custom_bottom_navigation_bar.dart';
import '../../../../widgets/list_of_nine_verses.dart';
import '../../../favorites_screen.dart';
import '../alziyarat_aljami3a_walsalawat.dart';
import 'salat_ja3far_altayar.dart';
import 'ziyarat_2al_yasin.dart';

class ZiyaratAlna7iyaAlmokadasa extends StatefulWidget {
  static String screenRoute = 'ziyarat_alna7iya_almokadasa_screen';
  const ZiyaratAlna7iyaAlmokadasa({super.key});

  @override
  State<ZiyaratAlna7iyaAlmokadasa> createState() =>
      _ZiyaratAlna7iyaAlmokadasaState();
}

double _fontSize = 18;
double _fontSizeTablet = 30;

class _ZiyaratAlna7iyaAlmokadasaState extends State<ZiyaratAlna7iyaAlmokadasa> {
  bool isIcon = true;
  @override
  void initState() {
    super.initState();
    _loadFavoriteState();
  }

  Future<void> _loadFavoriteState() async {
    final prefs = await SharedPreferences.getInstance();
    bool? savedState =
        prefs.getBool('isFavorite_ziyarat_alna7iya_almokadasa_screen');
    setState(() {
      isIcon = savedState ?? true;
    });
  }

  Future<void> _saveFavoriteState(bool value) async {
    final prefs = await SharedPreferences.getInstance();
    await prefs.setBool('isFavorite_ziyarat_alna7iya_almokadasa_screen', value);
  }

  Future<bool> _onWillPop() async {
    final args =
        ModalRoute.of(context)!.settings.arguments as Map<String, dynamic>?;
    final previousPage = args?['previousPage'];
    if (previousPage == 'favorite_screen') {
      Navigator.of(context).pushReplacementNamed(FavoritesScreen.screenRoute);
      return false;
    } else {
      Navigator.of(context)
          .pushReplacementNamed(AlziyaratAljami3aWalsalawat.screenRoute);
      return false;
    }
  }

  @override
  Widget build(BuildContext context) {
    double size = MediaQuery.of(context).textScaleFactor;
    final screenWidth = MediaQuery.of(context).size.width;
    final isTablet = screenWidth >= 600;
    return WillPopScope(
      onWillPop: _onWillPop,
      child: Scaffold(
        appBar: AppBar(
          toolbarHeight: isTablet ? 100 : 50,
          centerTitle: true,
          leading: IconButton(
            onPressed: _onWillPop,
            icon: Icon(
              Icons.arrow_back,
              size: isTablet ? 50 : 25,
            ),
          ),
          actions: [
            IconButton(
              padding: EdgeInsets.only(left: isTablet ? 50 : 30),
              icon: Icon(
                isIcon ? Icons.favorite_border : Icons.favorite_rounded,
                size: isTablet ? 40 : 25,
                color: isIcon ? Colors.black : Colors.red,
              ),
              onPressed: () async {
                setState(() {
                  isIcon = !isIcon;
                });
                await _saveFavoriteState(isIcon);

                if (!isIcon) {
                  Provider.of<FavoritesProvider>(context, listen: false)
                      .addFavorite('زيارة الناحية المقدسة',
                          ZiyaratAlna7iyaAlmokadasa.screenRoute);
                } else {
                  Provider.of<FavoritesProvider>(context, listen: false)
                      .removeFavorite(
                          'زيارة الناحية المقدسة',
                          ZiyaratAlna7iyaAlmokadasa.screenRoute,
                          ZiyaratAlna7iyaAlmokadasa.screenRoute);
                }
              },
            ),
          ],
          title: Text(
            'زيارة الناحية المقدسة',
            style: TextStyle(
              fontSize: isTablet
                  ? 40
                  : size > 1.0
                      ? 20
                      : 23,
              fontWeight: FontWeight.bold,
            ),
          ),
        ),
        body: ContainerScrollview(
          widget: Column(
            crossAxisAlignment: CrossAxisAlignment.start,
            children: [
              Container(
                child: Column(
                  children: [
                    Center(
                      child: Text(
                        'بسم الله الرحمن الرحيم',
                        style: TextStyle(
                          fontSize: isTablet ? _fontSizeTablet : _fontSize,
                          fontWeight: FontWeight.w900,
                        ),
                      ),
                    ),
                    Center(
                      child: Text(
                        'اللهم صلِّ على محمد وآل محمد',
                        style: TextStyle(
                          fontSize: isTablet ? _fontSizeTablet : _fontSize,
                          fontWeight: FontWeight.w900,
                        ),
                      ),
                    ),
                  ],
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: '',
                  subtitle:
                      'السَّلامُ عَلى آدمَ صَفْوةِ اللهِ مِن خَليقَتِهِ، السَّلامُ عَلى شِيثَ وَليِّ اللهِ وخِيرَتِهِ، السَّلامُ عَلى إدْريسَ القائِمِ للهِ بِحُجَّتِهِ، السَّلامُ عَلى نُوح المُجَابِ في دَعوَتِهِ، السَّلامُ عَلى هُود المَمْدودِ مِنَ اللهِ بِمَعونَتِهِ.\n\n'
                      'السَّلامُ عَلى صَالِح الَّذي تَوَجَّهَ للهِ بِكَرامَتِهِ، السَّلامُ عَلى إِبْراهِيم الَّذي حَبَاهُ اللهُ بِخُلَّتِهِ، السَّلامُ عَلى إِسْمَاعيل الَّذي فَداهُ اللهُ بِذِبْحٍ عَظيمٍ مِنَ جَنَّتِهِ، السَّلامُ عَلى إِسْحَاق الَّذي جَعَل اللهُ النُّبُوَّةَ في ذُرِّيَّتِهِ.\n\n'
                      'السَّلامُ عَلى يَعقوب الَّذي رَدَّ الله عَليهِ بَصَرَهُ بِرَحمَتِهِ، السَّلامُ عَلى يُوسف الَّذي نَجَّاهُ اللهُ مِنَ الجُّبِّ بِعَظَمَتِهِ، السَّلامُ عَلى مُوسَى الَّذي فَلَقَ اللهُ البَحْرَ لَهُ بِقُدرَتِهِ، السَّلامُ عَلى هَارُون الَّذي خَصَّهُ اللهُ بِنُبوَّتِهِ.\n\n'
                      'السَّلامُ عَلى شُعَيب الَّذي نَصَرَهُ اللهُ عَلى أُمَّتِهِ، السَّلامُ عَلى دَاود الَّذي تَابَ اللهُ عَليهِ مِن خَطيئَتِهِ، السَّلامُ عَلى سُلَيمَان الَّذي ذُلَّتْ لَهُ الجِنُّ بِعزَّتِهِ، السَّلامُ عَلى أيُّوب الَّذي شَفَاهُ اللهُ مِنْ عِلَّتِهِ، السَّلامُ عَلى يُونس الَّذي أنْجَزَ اللهُ لَهُ مَضْمُونَ عِدَّتِه.\n\n'
                      'السَّلامُ عَلى عُزَير الَّذي أحيَاهُ اللهُ بَعدَ مَوتَتِهِ، السَّلامُ عَلى زَكَريَّا الصَّابِر فِي مِحْنَتِهِ، السَّلامُ عَلى يَحْيَى الَّذي أزْلَفَهُ اللهُ بِشَهادَتِهِ، السَّلامُ عَلى عِيسَى رُوح اللهِ وَكَلِمَتِهِ.\n\n'
                      'السَّلامُ عَلى مُحمَّدٍ حَبيبِ اللهِ وصَفْوتِهِ، السَّلامُ عَلَى أميرِ المُؤمِنين عَليِّ بْن أبي طَالِبٍ المَخْصُوص بِأخُوَّتِهِ، السَّلامُ عَلى فَاطِمَةَ الزَّهراءِ ابنَتِهِ، السَّلامُ عَلى أبِي مُحَمَّدٍ الحَسَنِ وَصِيِّ أبِيهِ وخَليفَتِهِ، السَّلامُ عَلى الحُسينِ الَّذي سَمَحَتْ نَفْسُهُ بِمُهجَتِهِ، السَّلامُ عَلى مَنْ أطَاعَ اللهَ فِي سِرِّهِ وَعَلانِيَتِهِ، السَّلامُ عَلى مَنْ جَعَلَ اللهُ الشِّفاءَ فِي تُرْبَتِهِ، السَّلامُ عَلَى مَن الإِجَابَة تَحْتَ قُبَّتِهِ، السَّلامُ عَلى مَن الأئمَّة مِنْ ذُرِّيَّتِهِ.\n\n'
                      'السَّلامُ عَلى ابْنِ خَاتَمِ الأنبِيَاءِ، السَّلامُ عَلَى ابْنِ سَيِّدِ الأوصِيَاءِ، السَّلامُ عَلَى ابْنِ فَاطِمَةَ الزَّهْرَاءِ، السَّلامُ عَلَى ابنِ خَدِيجَة الكُبْرَى، السَّلامُ عَلَى ابْنِ سِدْرَة المُنتَهَى، السَّلامُ عَلى ابْنِ جَنَّة المَأوَى، السَّلامُ عَلى ابْنِ زَمْزَمَ وَالصَّفَا.\n\n'
                      'السَّلامُ عَلى المُرَمَّلِ بالدِّمَاءِ، السَّلامُ عَلى المَهْتُوكِ الخِبَاءِ، السَّلامُ عَلَى خَامِسِ أصْحَابِ أهْلِ الكِسَاءِ، السَّلامُ عَلى غَريبِ الغُرَبَاءِ، السَّلامُ عَلى شَهِيدِ الشُّهَدَاءِ، السَّلامُ عَلى قَتيلِ الأدْعِيَاءِ، السَّلامُ عَلى سَاكِنِ كَرْبَلاءِ، السَّلامُ عَلى مَنْ بَكَتْهُ مَلائِكَةُ السَّمَاءِ، السَّلامُ عَلَى مَنْ ذُرِّيتُهُ الأزكِيَاءُ.\n\n'
                      'السَّلامُ عَلى يَعْسُوبِ الدِّيْنِ، السَّلامُ عَلى مَنَازِلِ البَرَاهِينِ.\n\n'
                      'السَّلامُ عَلى الأئِمَّةِ السَّادَاتِ، السَّلامُ عَلى الجُيوبِ المُضَرَّجَاتِ، السَّلامُ عَلى الشِّفَاهِ الذَّابِلاتِ، السَّلامُ عَلى النُّفوسِ المُصْطَلِمَاتِ، السَّلامُ عَلَى الأروَاحِ المُختَلسَاتِ.\n\n'
                      'السَّلامُ عَلى الأجْسَادِ العَاريَاتِ، السَّلامُ عَلى الجُسُومِ الشَّاحِبَاتِ، السَّلامُ عَلى الدِّمَاءِ السَّائِلاتِ، السَّلامُ عَلى الأعْضَاءِ المُقطَّعَاتِ، السَّلامُ عَلى الرُّؤوسِ المُشَالاَتِ، السَّلامُ عَلى النُّسْوَةِ البَارِزَاتِ.\n\n'
                      'السَّلامُ عَلى حُجَّةِ رَبِّ العَالَمِينَ، السَّلامُ عَلَيكَ وعَلى آبَائِكَ الطَّاهِرِينَ، السَّلامُ عَلَيْكَ وعَلى أبْنَائِكَ المُسْتَشْهَدِينَ، السَّلامُ عَليكَ وعَلى ذُرِّيَّتِك النَّاصِرِينَ، السَّلامُ عَليكَ وعَلى المَلائِكَةِ المُضَاجِعِينَ.\n\n'
                      'السَّلامُ عَلى القَتيلِ المَظلُومِ، السَّلامُ عَلى أخِيْهِ المَسمُومِ.\n\n'
                      'السَّلامُ عَلى عَليٍّ الكَبِيرِ، السَّلامُ عَلى الرَّضِيعِ الصَّغِيرِ، السَّلامُ عَلَى الأبْدَانِ السَّلِيبَةِ، السَّلامُ عَلى العِتْرَةِ القَريْبَةِ، السَّلامُ عَلى المُجدَّلِينَ في الفَلَوَاتِ، السَّلامُ عَلى النَّازِحِينَ عَن الأوطَانِ، السَّلامُ عَلى المَدْفُونِينَ بِلا أكْفَانِ، السَّلامُ عَلى الرُّؤوسِ المُفَرَّقَةِ عَن الأبْدانِ.\n\n'
                      'السَّلامُ عَلى المُحتَسِبِ الصَّابِرِ، السَّلامُ عَلى المَظْلُومِ بِلا نَاصِرِ، السَّلامُ عَلَى سَاكِنِ التُّربَةِ الزَّاكِيَةِ، السَّلامُ عَلى صَاحِبِ القُبَّة السَّامِيَةِ.\n\n'
                      'السَّلامُ عَلى مَن طَهَّرَهُ الجَلِيلُ، السَّلامُ عَلى مَنِ افْتَخَرَ بِهِ جِبرائِيلُ، السَّلامُ عَلى مَنْ نَاغَاهُ فِي المَهْدِ مِيكَائيلُ.\n\n'
                      'السَّلامُ عَلى مَنْ نُكِثَتْ ذِمَّتُهُ، السَّلامُ عَلى مَن هُتِكَتْ حُرْمَتُهُ، السَّلامُ عَلى مَنْ أُرِيقَ بِالظُّلْمِ دَمُهُ.\n\n'
                      'السَّلامُ عَلى المُغسَّلِ بِدَمِ الجِرَاحِ، السَّلامُ عَلى المُجَرَّعِ بِكاسَاتِ الرِّمَاحِ، السَّلامُ عَلى المُضَامِ المُستَبَاحِ.\n\n'
                      'السَّلامُ عَلى المَنْحُورِ في الوَرَى، السَّلامُ عَلى مَن دَفنَهُ أهْلُ القُرَى، السَّلامُ عَلى المَقْطُوعِ الوَتِينِ، السَّلامُ عَلى المُحَامي بِلا مُعِينٍ.\n\n'
                      'السَّلامُ عَلى الشَّيْبِ الخَضِيبِ، السَّلامُ عَلى الخَدِّ التَّرِيْبِ، السَّلامُ عَلى البَدَنِ السَّلِيْبِ، السَّلامُ عَلى الثَّغْرِ المَقْرُوعِ بالقَضِيبِ، السَّلامُ عَلى الرَّأسِ المَرفُوعِ.\n\n'
                      'السَّلامُ عَلى الأجْسَامِ العَارِيَةِ في الفَلَوَاتِ، تَنْهَشُهَا الذِّئَابُ العَادِيَاتُ، وتَخْتَلِفُ إِلَيها السِّباعُ الضَّارِيَاتُ.\n\n'
                      'السَّلامُ عَليْكَ يَا مَولاَيَ وعَلى المَلائِكَةِ المَرْفُوفينَ حَولَ قُبَّتِكَ، الحَافِّينَ بِتُربَتِكَ، الطَّائِفِين بِعَرَصَتِكَ، الوَاردِينَ لِزَيَارَتِكَ.\n\n'
                      'السَّلامُ عَليكَ فَإنِّي قَصَدْتُ إِلَيكَ، ورَجَوتُ الفَوزَ لَدَيكَ.\n\n'
                      'السَّلامُ عَليكَ سَلامُ العَارِفِ بِحُرمَتِكَ، المُخْلِصِ في وِلايَتِكَ، المُتَقرِّبِ إِلى اللهِ بِمَحَبَّتِكَ، البريءِ مِن أعَدَائِكَ، سَلامُ مَنْ قَلْبُهُ بِمُصَابِك مَقرُوحٌ، وَدَمْعُهُ عِندَ ذِكرِكَ مَسْفُوحٌ، سَلامُ المَفْجُوعِ الحَزِينِ، الوَالِهِ المُستَكِينِ.\n\n'
                      'سَلامُ مَن لَوكَانَ مَعَكَ بِالطُّفُوفِ لَوَقَاكَ بِنَفسِهِ حَدَّ السُّيُوفِ، وبَذَلَ حَشَاشَتَهُ دُونَك لِلحُتُوف، وجَاهَد بَينَ يَدَيكَ، ونَصَرَكَ عَلى مَن بَغَى عَلَيكَ، وَفَدَاك بِرُوحِه وَجَسَدِهِ، وَمَالِهِ وَولْدِهِ، وَرُوحُهُ لِرُوحِكَ فِدَاءٌ، وَأهْلُهُ لأهلِكَ وِقَاءٌ.\n\n'
                      'فَلَئِنْ أخَّرَتْني الدُّهُورُ، وَعَاقَنِي عَنْ نَصْرِكَ المَقْدُورُ، وَلَمْ أكُنْ لِمَنْ حَارَبَكَ مُحَارِباً، وَلِمَنْ نَصَبَ لَكَ العَدَاوَةَ مُناصِباً، فَلأنْدُبَنَّكَ صَبَاحاً وَمَسَاءً، وَلأبْكِيَنَّ لَكَ بَدَل الدُّمُوعِ دَماً، حَسْرَةً عَلَيكَ، وتَأسُّفاً عَلى مَا دَهَاكَ وَتَلَهُّفاً، حَتَّى أمُوتُ بِلَوعَةِ المُصَابِ، وَغُصَّةِ الاِكْتِئَابِ.\n\n'
                      'أشْهَدُ أنَّكَ قَدْ أقَمْتَ الصَّلاةَ، وَآتَيْتَ الزَّكَاةَ، وَأَمَرْتَ بِالمَعرُوفِ، وَنَهَيْتَ عَنِ المُنْكَرِ والعُدْوَانِ، وأطَعْتَ اللهَ وَمَا عَصَيْتَهُ، وتَمَسَّكْتَ بِهِ وَبِحَبلِهِ، فأرضَيتَهُ وَخَشيْتَهُ، وَرَاقبتَهُ واسْتَجَبْتَهُ، وَسَنَنْتَ السُّنَنَ، وأطفَأْتَ الفِتَنَ.\n\n'
                      'وَدَعَوْتَ إلَى الرَّشَادِ، وَأوْضَحْتَ سُبُل السَّدَادِ، وجَاهَدْتَ فِي اللهِ حَقَّ الجِّهَادِ، وكُنْتَ لله طَائِعاً، وَلِجَدِّك مُحمَّدٍ (صَلَّى اللهُ عَلَيه وَآلِه) تَابِعاً، وَلِقُولِ أبِيكَ سَامِعاً، وَإِلَى وَصِيَّةِ أخيكَ مُسَارِعاً، وَلِعِمَادِ الدِّينِ رَافِعاً، وَللطُّغْيَانِ قَامِعاً، وَللطُّغَاةِ مُقَارِعاً، وللأمَّة نَاصِحاً، وفِي غَمَرَاتِ المَوتِ سَابِحاً، ولِلفُسَّاقِ مُكَافِحاً، وبِحُجَجِ اللهِ قَائِماً، وللإِسْلاَمِ وَالمُسْلِمِينَ رَاحِماً، وَلِلحَقِّ نَاصِراً، وَعِنْدَ البَلاءِ صَابِراً، وَلِلدِّينِ كَالِئاً، وَعَنْ حَوزَتِه مُرامِياً.\n\n'
                      'تَحُوطُ الهُدَى وَتَنْصُرُهُ، وَتَبْسُطُ العَدْلَ وَتنْشُرُهُ، وتنْصُرُ الدِّينَ وتُظْهِرُهُ، وَتَكُفُّ العَابِثَ وتَزجُرُهُ، وتأخُذُ للدَّنيِّ مِنَ الشَّريفِ، وتُسَاوي فِي الحُكْم بَينَ القَويِّ والضَّعِيفِ.\n\n'
                      'كُنْتَ رَبيعَ الأيْتَامِ، وَعِصْمَةَ الأنَامِ، وَعِزَّ الإِسْلامِ، وَمَعْدِنَ الأَحْكَامِ، وَحَلِيفَ الإِنْعَامِ، سَالِكاً طَرائِقَ جَدِّكَ وَأبِيكَ، مُشَبِّهاً في الوَصيَّةِ لأخِيكَ، وَفِيَّ الذِّمَمِ، رَضِيَّ الشِّيَمِ، ظَاهِرَ الكَرَمِ، مُتَهَجِّداً فِي الظُّلَمِ، قَويمَ الطَّرَائِقِ، كَرِيمَ الخَلائِقِ، عَظِيمَ السَّوابِقِ، شَرِيفَ النَّسَبِ، مُنِيفَ الحَسَبِ، رَفِيعَ الرُّتَبِ، كَثيرَ المَنَاقِبِ، مَحْمُودَ الضَّرَائِبِ، جَزيلَ المَوَاهِبِ.\n\n'
                      'حَلِيمٌ، رَشِيدٌ، مُنِيبٌ، جَوادٌ، عَلِيمٌ، شَدِيدٌ، إِمَامٌ، شَهِيدٌ، أوَّاهٌ، مُنِيبُ، حَبِيبٌ، مُهِيبٌ.\n\n'
                      'كُنْتَ للرَّسُولِ (صَلَّى اللهُ عَلَيهِ وَآلِهِ) وَلَداً، وَللقُرآنِ سَنَداً، وَلِلأمَّةِ عَضُداً، وفي الطَّاعَةِ مُجتَهِداً، حَافِظاً للعَهدِ والمِيثَاقِ، نَاكِباً عَن سُبُل الفُسَّاقِ، وبَاذلاً للمَجْهُودِ، طَويلَ الرُّكُوعِ والسُّجُودِ، زاهِداً في الدُّنيَا زُهْدَ الرَّاحِلِ عَنْها، نَاظِراً إِلَيها بِعَينِ المُسْتَوحِشِينَ مِنْها.\n\n'
                      'آمَالُكَ عَنْها مَكفُوفَةٌ، وهِمَّتُكَ عَنْ زِينَتِهَا مَصْرُوفَةٌ، وَأَلحَاظِكَ عَن بَهْجَتِهَا مَطْرُوفَةٌ، وَرَغْبَتِكَ فِي الآخِرَة مَعرُوفَةٌ، حَتَّى إِذَا الجَورُ مَدَّ بَاعَهُ، وأسْفَرَ الظُّلْمُ قِنَاعَهُ، وَدَعَا الغَيُّ أتْبَاعَهُ.\n\n'
                      'وأنْتَ فِي حَرَمِ جَدِّك قَاطِنٌ، وَللظَّالِمِينَ مُبَايِنٌ، جَليسُ البَيتِ وَالمِحْرَابِ، مُعتَزِلُ عَنْ اللَّذَاتِ والشَّهَوَاتِ، تَنْكُرُ المُنْكَرَ بِقَلبِكَ وَلِسَانِك، عَلى حَسَبِ طَاقَتِكَ وَإمْكَانِكَ.\n\n'
                      'ثُّمَّ اقْتَضَاكَ العِلْمُ للإِنْكَارِ، وَلزمَكَ أنْ تُجَاهِدَ الفُجَّار، فَسِرْتَ فِي أوْلادِكَ وَأهَالِيكَ، وشِيعَتِكَ ومُوَالِيكَ، وصَدَّعْتَ بِالحَقِّ وَالبَيِّنَةِ، وَدَعَوتَ إِلَى الله بِالْحِكْمَةِ وَالْمَوْعِظَةِ الْحَسَنَةِ.\n\n'
                      'وَأمَرْتَ بِإِقَامَةِ الحُدُودِ، والطَّاعَةِ لِلمَعْبُودِ، وَنَهَيْتَ عَنِ الخَبَائِثِ وَالطُّغْيَانِ، وَوَاجَهُوكَ بِالظُّلْمِ وَالعُدْوَانِ، فَجَاهَدْتَهُم بَعْدَ الإِيعَازِ لَهُم، وَتَأكِيدِ الحُجَّةِ عَلَيْهِم، فَنَكَثوا ذِمَامَكَ وِبَيْعَتَكَ، وأسْخَطَوا رَبَّك وَجَدَّك، وَبَدؤُوكَ بِالحَرْبِ، فَثَبَتَّ لِلطَّعْنِ والضَّرْبِ، وطَحَنْتَ جُنُودَ الفُجَّارِ، وَاقْتَحَمْتَ قَسْطَلَ الغُبَارِ، مُجَاهِداً بِذِي الفِقَارِ، كَأنَّكَ عَلِيٌّ المُخْتَارُ.\n\n'
                      'فَلمَّا رَأوْكَ ثَابِتَ الجَأْشِ، غَيْرَ خَائِفٍ وَلا خَاشٍ، نَصَبُوا لَكَ غَوائِلَ مَكْرِهِمُ، وقَاتَلُوكَ بِكَيْدِهِمُ وَشَرِّهِمُ، وأمَرَ اللَّعِينُ جُنودَهُ، فَمَنَعُوكَ المَاءَ وَوُرُودَهُ، ونَاجَزُوكَ القِتَالَ، وَعَاجَلُوكَ النِّزَالَ، وَرَشَقُوكَ بِالسِّهَامِ وَالنِّبَالِ، وبَسَطُوا إِلَيكَ أَكُفَّ الاِصْطِلاَمِ، وَلَمْ يَرْعَوْا لَكَ ذِمَاماً، وَلا رَاقَبُوا فِيْكَ أثَاماً، فِي قَتْلِهِمُ أوْلِيَاءَكَ، وَنَهْبِهِمُ رِحَالَكَ.\n\n'
                      'وَأنْتَ مُقْدَّمٌ في الهَبَوَاتِ، ومُحْتَمِلٌ للأذِيَّاتِ، قَدْ عَجِبَتْ مِنْ صَبْرِكَ مَلائِكَةُ السَّمَاوَاتِ، فَأحْدَقُوا بِكَ مِنْ كِلِّ الجِّهَاتِ، وأثْخَنُوكَ بِالجِّرَاحِ، وَحَالُوا بَيْنَكَ وَبَينَ الرَّوَاحِ، وَلَمْ يَبْقَ لَكَ نَاصِرٌ، وَأنْتَ مُحْتَسِبٌ صَابِرٌ.\n\n'
                      'تَذُبُّ عَنْ نِسْوَتِكَ وَأوْلادِكَ، حَتَّى نَكَّسُوكَ عَنْ جَوَادِكَ، فَهَوَيْتَ إِلَى الأرْضِ جَرِيْحاً، تَطَأُكَ الخُيولُ بِحَوَافِرِهَا، وَتَعْلُوكَ الطُّغَاةُ بِبَوَاتِرِها، قَدْ رَشَحَ لِلمَوْتِ جَبِيْنُكَ، واخْتَلَفَتَ بالاِنْقِبَاضِ والاِنْبِسَاطِ شِمَالُكَ وَيَمِينُكَ، تُدِيرُ طَرَفاً خَفِيّاً إلى رَحْلِكَ وَبَيْتِكَ، وَقَدْ شُغِلْتَ بِنَفسِكَ عَنْ وُلْدِكَ وَأهَالِيكَ.\n\n'
                      'وَأَسْرَعَ فَرَسُكَ شَارِداً إِلَى خِيَامِكَ، قَاصِداً مُحَمْحِماً بَاكِياً، فَلَمَّا رَأَيْنَ النِّسَاءُ جَوَادَكَ مَخْزِيّاً، وَنَظَرْنَ سَرْجَكَ عَلَيهِ مَلْوِيّاً، بَرَزْنَ مِنَ الخُدُورِ، نَاشِرَات الشُّعُورِ عَلى الخُدُودِ، لاطِمَاتُ الوُجُوه سَافِرَات، وبالعَوِيلِ دَاعِيَات، وبَعْدَ العِزِّ مُذَلَّلاَت، وإِلَى مَصْرَعِكَ مُبَادِرَات، والشِّمْرُ جَالِسٌ عَلى صَدْرِكَ، وَمُولِغٌ سَيْفَهُ عَلى نَحْرِكَ، قَابِضٌ عَلى شَيْبَتِكَ بِيَدِهِ، ذَابِحٌ لَكَ بِمُهَنَّدِهِ، قَدْ سَكَنَتْ حَوَاسُّكَ، وَخفِيَتْ أنْفَاسُكَ، وَرُفِع عَلى القَنَاةِ رَأسُكَ.\n\n'
                      'وَسُبِيَ أهْلُكَ كَالعَبِيدِ، وَصُفِّدُوا فِي الحَدِيْدِ، فَوقَ أقْتَابِ المطِيَّاتِ، تَلْفَحُ وُجُوهَهُمُ حَرُّ الهَاجِرَات، يُسَاقُونَ فِي البَرَارِي وَالفَلَوَاتِ، أيْدِيهُمُ مَغْلُولَةٌ إِلَى الأعْنَاقِ، يُطَافُ بِهِم فِي الأسْوَاقِ، فالوَيْلُ للعُصَاةِ الفُسَّاقِ.\n\n'
                      'لَقَد قَتَلُوا بِقَتْلِكَ الإِسْلامَ، وَعَطَّلوا الصَّلاةَ وَالصِّيَامَ، وَنَقَضُوا السُّنَنَ وَالأحْكَامَ، وَهَدَّمُوا قَوَاعِدَ الإيْمَانِ، وحَرَّفُوا آيَاتَ القُرْآنِ، وَهَمْلَجُوا فِي البَغْيِ وَالعُدْوَانِ.\n\n'
                      'لَقَدْ أصْبَحَ رَسُولُ اللهِ (صَلَّى اللهُ عَلَيهِ وَآلِهِ) مَوتُوراً، وَعَادَ كِتَابُ اللهِ عَزَّ وَجَلَّ مَهْجُوراً، وَغُودِرَ الحَقُّ إِذْ قُهِرْتَ مَقْهُوراً، وَفُقِدَ بِفَقْدِكَ التَّكبِيرُ وَالتهْلِيلُ، وَالتَّحْرِيمُ وَالتَّحِليلُ، وَالتَّنْزِيلُ وَالتَّأوِيلُ، وَظَهَرَ بَعْدَكَ التَّغْيِيرُ وَالتَّبدِيلُ، والإِلْحَادُ وَالتَّعطِيلُ، وَالأهْوَاءُ وَالأضَالِيلُ، وَالفِتَنُ وَالأَبَاطِيلُ.\n\n'
                      'فَقَامَ نَاعِيكَ عِنْدَ قَبْرِ جَدِّكَ الرَّسُولِ (صَلَّى اللهُ عَلَيهِ وَآلِهِ)، فَنَعَاكَ إِلَيهِ بِالدَّمْعِ الهَطُولِ، قَائِلاً: يَا رَسُولَ اللهِ، قُتِلَ سِبْطُكَ وَفَتَاكَ، واسْتُبِيحَ أهْلُكَ وَحِمَاكَ، وَسُبِيَتْ بَعْدَكَ ذَرَارِيكَ، وَوَقَعَ المَحْذُورُ بِعِتْرَتِكَ وَذَويكَ.\n\n'
                      'فانْزَعَجَ الرَّسُولُ، وَبَكَى قَلْبُهُ المَهُولُ، وَعَزَّاهُ بِكَ المَلائِكَةُ وَالأنْبِيَاءُ، وَفُجِعَتْ بِكَ أُمُّكَ الزَّهْرَاءُ، وَاخْتَلَفَ جُنُودُ المَلائِكَةِ المُقَرَّبِينَ، تُعَزِّي أبَاكَ أمِيرَ المُؤْمِنينَ، وأُقِيمَتْ لَكَ المَآتِمُ فِي أَعْلَى عِلِّيِّينَ، وَلَطَمَتْ عَلَيكَ الحُورُ العِينُ.\n\n'
                      'وَبَكَتِ السَّمَاءُ وَسُكَّانُهَا، وَالجِنَانُ وَخُزَّانُهَا، وَالهِضَابُ وَأقْطَارُهَا، وَالبِحَارُ وَحِيتَانُها، وَالجِنَانُ وَولْدَانُهَا، وَالبَيتُ وَالمَقَامُ، وَالمَشْعَرُ الحَرَام، وَالحِلُّ والإِحْرَامُ.\n\n'
                      'اللَّهُمَّ فَبِحُرْمَةِ هَذَا المَكَانِ المُنِيفِ، صَلِّ عَلى مُحَمَّدٍ وَآلِ مُحَمَّدٍ، وَاحْشُرْنِي فِي زُمْرَتِهِم، وأدْخِلْنِي الجَنَّة بِشَفَاعَتِهِم.\n\n'
                      'اللَّهُمَّ إِنِّي أتوَسَّلُ إِلَيكَ يَا أسْرَعَ الحَاسِبِينَ، وَيَا أكْرَمَ الأَكْرَمِينَ، وَيَا أحْكَمَ الحَاكِمِينَ، بِمُحَمَّدٍ خَاتَمِ النَّبِيِّينَ، وَرَسُولِكَ إِلَى العَالَمِينَ أجْمَعِينَ، وَبِأخِيهِ وَابْنِ عَمِّهِ الأنْزَعِ البَطِينِ، العَالِمِ المَكِينِ، عَليٍّ أمِيْرِ المُؤْمِنِينَ، وَبِفَاطِمَةَ سَيِّدَةِ نِسَاءِ العَالَمِينَ.\n\n'
                      'وَبِالحَسَنِ الزَّكِيِّ عِصْمَةَ المُتَّقِينَ، وَبِأَبِي عَبْدِ اللهِ الحُسَينِ أَكَرَمِ المُستَشْهِدِينَ، وَبِأوْلاَدِهِ المَقْتُولِينَ، وَبِعِتْرَتِهِ المَظلُومِينَ.\n\n'
                      'وَبِعَلِيِّ بْنِ الحُسَيْنِ زَيْنِ العَابِدِينَ، وَبِمُحَمَّدِ بْنِ عَلِيٍّ قِبْلَةِ الأوَّابِينَ، وَبِجَعْفَرِ بْنِ مُحَمَّدٍ أَصْدَقِ الصَّادِقِينَ، وَبِمُوسَى بْنِ جَعْفَرٍ مُظِهِرِ البَرَاهِينَ، وَبِعَليِّ بْنِ مُوسَى نَاصِرِ الدِّينَ، وَبِمُحَمَّدِ بْنِ عَلِيٍّ قُدْوَةِ المُهْتَدِينَ، وَبِعَلِيِّ بْنِ مُحَمَّدٍ أزْهَدِ الزَّاهِدِينَ، وَبِالحَسَنِ بْنِ عَليٍّ وَارِثِ المُسْتَخْلفِينَ، وَبِالحُجَّةِ عَلى الخَلْقِ أجْمَعِينَ، أنْ تُصَلِّيَ عَلى مُحَمَّدٍ وَآلِ مُحَمَّدٍ الصَّادِقِينَ الأَبَرِّينَ، آلِ طَهَ وَيَاسِينَ، وَأنْ تَجْعَلَنِي فِي القِيَامَةِ مِنَ الآمِنِينَ المُطْمَئِنِّينَ، الفَائِزِينَ الفَرِحِينَ المُسْتَبْشِرِينَ.\n\n'
                      'اللَّهُمَّ اكتُبْنِي فِي المُسْلِمِينَ، وَأَلْحِقْنِي بِالصَّالِحِينَ، وَاجْعَلْ لِي لِسَانَ صِدْقٍ فِي الآخِرِينَ، وَانْصُرْنِي عَلى البَاغِينَ، واكْفِنِي كَيْدَ الحَاسِدِينَ، وَاصْرِفْ عَنِّي مَكْرَ المَاكِرينَ، وَاقْبِضْ عَنِّي أيْدِي الظَّالِمِينَ، وَاجْمَع بَينِي وَبَينَ السَّادَةِ المَيَامِينَ فِي أعَلَى عِلِّيِّينَ، مَعَ الَّذِينَ أنْعَمْتَ عَلَيْهِمْ مِنَ النَّبِيِّينَ، وَالصِّدِّيقِينَ وَالشُّهَداءِ وَالصَّالِحِينَ، بِرَحْمَتِكَ يَا أرْحَمَ الرَّاحِمِينَ.\n\n'
                      'اللَّهُمَّ إِنِّي أُقْسِمُ عَلَيكَ بِنَبِيِّكَ المَعْصُومِ، وَبِحُكْمِكَ المَحْتُومِ، وَنَهْيِكَ المَكْتُومِ، وَبِهَذا القَبْرِ المَلْمُومِ، المُوَسَّدِ في كَنَفِهِ الإِمَامِ المَعْصُومِ، المَقْتُولِ المَظْلُومِ، أنْ تَكْشِفَ مَا بِي مِنَ الغُمُومِ، وَتَصْرِفَ عَنِّي شَرَّ القَدَرِ المَحْتُومِ، وَتُجِيرُنِي مِنَ النَّارِ ذَاتِ السُّمُومِ.\n\n'
                      'اللَّهُمَّ جَلِّلْنِي بِنِعْمَتِكَ، وَرَضِّنِي بِقَسَمِكَ، وتَغَمَّدْنِي بِجُودِكَ وَكَرَمِكَ، وَبَاعِدْنِي مِن مَكْرِكَ وَنِقْمَتِكَ.\n\n'
                      'اللَّهُمَّ اعْصِمْنِي مِنَ الزَّلَلِ، وَسَدِّدْنِي فِي القَوْلِ وَالعَمَلِ، وَافْسَحْ لِي فِي مُدَّةِ الأَجَلِ، وَاعْفِنِي مِنَ الأوْجَاعِ وَالعِلَلِ، وَبَلِّغْنِي بِمَوَالِيَّ وَبِفَضْلِكَ أَفْضَلَ الأَمَلِ.\n\n'
                      'اللَّهُمَّ صَلِّ عَلى مُحَمَّدٍ وَآلِ مُحَمَّدٍ، وَاقْبَلْ تَوبَتِي، وَارْحَم عَبْرَتِي، وَأَقِلْنِي عَثْرَتي، وَنَفِّسْ كُرْبَتِي، وَاغْفِرْ لِي خَطِيئَتِي، وَأَصْلِحْ لِي فِي ذُرِّيَّتِي.\n\n'
                      'اللَّهُمَّ لا تَدَعْ لِي فِي هَذَا المَشْهَدِ المُعَظَّمِ، وَالمَحَلِّ المُكَرَّمِ، ذَنْباً إلاَّ غَفَرْتَهُ، وَلا عَيْباً إِلاَّ سَتَرْتَهُ، وَلاَ غَمّاً إلاَّ كَشَفْتَهُ، وَلاَ رِزْقاً إلاَّ بَسَطْتَهُ، وَلا جَاهاً إِلاَّ عَمَرْتَهُ، وَلا فَسَاداً إِلاَّ أصْلَحْتَهُ، وَلاَ أمَلاً إِلاَّ بَلَغْتَهُ، وَلا دُعَاءً إِلاَّ أجَبْتَهُ، وَلاَ مَضيقاً إلاَّ فَرَّجْتَهُ، وَلا شَمْلاً إلاَّ جَمَعْتَهُ، وَلا أمْراً إلاَّ أتْمَمْتَهُ، وَلا مَالاً إِلاَّ كَثَّرْتَهُ، وَلا خُلْقاً إلاَّ حَسَّنْتَهُ، وَلا إِنْفَاقاً إِلاَّ أخْلَفْتَهُ، وَلا حَالاً إِلاَّ عَمَرتَهُ، وَلا حَسُوداً إِلاَّ قَمَعْتَهُ، وَلا عَدوّاً إِلاَّ أرْدَيْتَهُ، وَلا شَرّاً إِلاَّ كَفَيْتَهُ، وَلا مَرَضاً إِلاَّ شَفَيْتَهُ، ولا بَعِيداً إِلاَّ أدْنَيْتَهُ، وَلا شَعْثاً إِلاَّ لَمَمْتَهُ، وَلا سُؤالاً إِلاَّ أعْطَيْتَهُ.\n\n'
                      'اللَّهُمَّ إِنِّي أَسْأَلُكَ خَيْرَ العَاجِلَةِ، وثَوَابَ الآجِلَةِ، اللَّهُمَّ أغْنِنِي بِحَلالِكَ عَنِ الحَرَامِ، وَبِفَضْلِكَ عَنْ جَمِيعِ الأنَامِ، اللَّهُمَّ إِنِّي أسْأَلُكَ عِلْماً نَافِعاً، وَقَلْباً خَاشِعاً، وَيَقِيناً شَافِياً، وَعَمَلاً زَاكِياً، وَصَبْراً جَمِيلاً، وَأجْراً جَزِيلاً.\n\n'
                      'اللَّهُمَّ ارْزُقْنِي شُكْرَ نِعْمَتِكَ عَلَيَّ، وَزِدْ فِي إحْسَانِكَ وَكَرَمِكَ إِلَيَّ، وَاجْعَلْ قَولِي فِي النَّاسِ مَسْمُوعاً، وَعَمَلي عِنْدَكَ مَرْفُوعاً، وَأثَري فِي الخَيْرَاتِ مَتْبُوعاً، وَعَدُوِّي مَقْمُوعاً.\n\n'
                      'اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَآلِ مُحَمَّدٍ الأخْيَارِ، فِي آنَاء اللَّيلِ وَأطْرَافِ النَّهَارِ، وَاكْفِنِي شَرَّ الأشْرَارِ، وَطَهِّرنِي مِن الذُّنُوبِ وَالأوْزَارِ، وَأَجِرْنِي مِن النَّار، وأحِلَّنِي دَارَ القَرَارِ، وَاغْفِرْ لِي وَلِجَمِيعِ أُخْوانِي وأخَوَاتي المُؤْمِنِينَ وَالمُؤْمِنَاتِ، بِرَحْمَتِكَ يَا أرْحَمَ الرَّاحِمِينَ. المخصوص بأخوته السلام على فاطمة الزهراء ابنته السلام على أبي محمد الحسن رضي أبيه وخليفته السلام '
                      'على الحسين الذي سمحت نفسه بمهجته السلام على من أطاع الله في سره وعلانيته السلام على من جعل الله الشفاء في تربيته السلام على من الإجابة تحت قبته السلام على من الأئمة من ذريته السلام على ابن خاتم الأوصياء السلام على ابن فاطمة الزهراء السلام على ابن خديجة الكبرى السلام على ابن سدرة المنتهى السلام على ابن جنه المأوى السلام على ابن زمزم والصفا السلام على المرمل بالدماء السلام على المهتوك الخباء السلام على خامس أصحاب الكساء السلام على غريب الغرباء السلام على شهيد الشهداء السلام على قتيل الأدعياء السلام على ساكن كربلاء السلام على من بكته ملائكة السماء.\n\n'
                      'السلام على من ذريته الأزكياء السلام على يعسوب الدين السلام على منازل البراهين السلام على الأئمة السادات السلام على الحيوب المضرجعات السلام على الشفاه الذابلات السلام على النفوس المصطلمات السلام على الأرواح المختلسات السلام على الأجساد العاريات السلام على الجسوم الشاحبات السلام على الدماء السائلات السلام على الأعضاء المقطعات السلام على الرؤوس المشالات السلام على النسوة البارزات السلام على حجه رب العالمين السلام عليك وعلى آبائك الطاهرين السلام عليك وعلى أبنائك المستشهدين السلام عليك وعلى ذريتك الناصرين السلام عليك وعلى الملائكة الضاجين السلام على القتيل السلام على أخيه المسموم السلام على علي الأكبر السلام على '
                      'الرضيع الصغير السلام على الأبدان السليبة السلام على العترة الغربية السلام على الجلدين في الفلوات السلام على النازحين عن الأوطان السلام على المدفونين بلا أكفان السلام على الرؤوس المفرقة عن الأبدان السلام على المحتسب الصابر السلام على المظلوم بلا ناصر السلام على ساكن التربة الزكية السلام على صاحب القبة السامية السلام على من طهره الجليل السلام على من افتخر به جبرئيل السلام على ناغاه في المهد ميكائيل السلام على من نكثت ذمته السلام على من هتكت حرمته السالم على من أريق بالظلم دمه السلام على المغسل بدم الجراح السلام على المجرع بكاسات الرماح السلام على المضام المستباح السلام على المنحور في الورى السلام على من دفنه أهل القرى السلام على المقطوع الوتيرين السلام على المحامي بلا معين السلام على الشيب الخضيب السلام على الخد التريب السلام على البدن السليب السلام على الثغر المقروع '
                      'بالقضيب السلام على الرأس المرفوع السلام على الأجسام العارية في الفلوات تنهشها الذئاب العاديات وتختلف إليها السباع الضاريات السلام عليك يا مولاي وعلى الملائكة المرفرفين حول قبتك الحافين بتربتك الطائفين بعرصتك الواردين لزيارتك السلام عليك فاني قصدت إليك ورجوت الفوز لديك السلام عليك سلام العارف بحرمتك المخلص في ولايتك المتقرب إلى الله بمحبتك البريء من أعدائك سلام من قبله بمصابك مقروح ودمعه عند ذكرك مسفوح سلام المفجوع المحزون الواله المستكين سلام من لو كان معك في الطفوف لوقاك بنفسه حد السيوف وبذل حشاشته دونك للحتوف وجاهد بين يديك ونصرك على من بغى عليك وفداك بروحه وجسده وماله وولده وروحه لروحك فداء وأهله لأهلك وقاء.\n\n'
                      'فلئن أخرتني الدهور وعاقني عن نصرك المقدور ولم أكن لمن حاربك محاربا ولمن نصب لك العداوة مناصبا فلا ندبنك صباحا ومساء ولأبكينك لك بدل الدموع دما حسرة عليك وتأسفا على ما دهاك وتلهفا حتى أموت بلوعة المصاب وغصة الاكتئاب أشهد أنك قد أقمت الصلاة وأتيت الزكاة وأمرت بالمعروف ونهيت عن المنكر والعدوان وأطعت الله وما عصيته وتمسكت به وبحبله فأرضيته وخشيته وراقبته و استحييته وسننت السنن وأطفأت الفتن ودعوت إلى الرشاد وأوضحت سبل السداد وجاهدت في الله حق الجهاد وكنت لله طائعا ولجدك محمد صلى الله عليه واله تابعا ولقول أبيك سامعا والى وصيه أخيك مساعا ولعماد الدين رافعا وللطغيان قامعا وللطغاة مقارعا وللأمة ناصحا وغي غمرات الموت سابحا وللفاسق مكافحا وبحجج الله قائما وللإسلام وللمسلمين راحما وللحق ناصرا وعند البلاء صابرا وللدين كالئا وعن حوزته راميا وتحوط الهدى وتنصره وتبسط العدل وتنشره وتنصر الدين وتظهره وتكف العابث وتجزره وتأخذ للدني من الشريف وتساوي في الحكم بين القوي والضعيف كنت ربيع الأيتام وعصمه الأنام وعز '
                      'الإسلام ومعدن الأحكام وحليف الأنعام سالكا طرائق جدك وأبيك مشبها في الوصية لأخيك وفي الذمم رضي الشيم ظاهر الكرم متهجدا في الظلم قويم الطرائق كريم الخلائق عظيم السوابق شريف النسب منيف الحسب رفيع الرتب كثير المناقب محمود الضرائب جزيل المواهب حليم رشيد منيب جوادعليم شديد أمام شهيد أواه حبيب مهيب.\n\n'
                      'كنت للرسول صلى الله عليه واله ولدا وللقران سندا وللأمة عضدا وفي الطاعة مجتهدا حافظا للعهد والميثاق ناكبا عن سبل الفساق باذلا للمجهود طويل الركوع والسجود زاهدا في الدنيا زهد الراحل عنها ناظرا إليها بعين المستوحشين منها آمالك عنها مكفوفة وهمتك عن زينتها مصروفه وألحاظك عن بهجتها مظروفه ورغبتك في الآخرة معروفه حتى إذا الجور مد باعه وأسفر الظلم قناعه ودعا الغي أتباعه وأنت في حرم جدك قاطن وللظالمين مباين جليس البيت والمحراب معتزل عن اللذات والشهوات تنكر المنكر بقلبك ولسانك على حسب طاقتك وإمكانك ثم اقتضاك العلم والإنكار ولزمك أن تجاهد الفجار فسرت في أولادك وأهاليك وشيعتك ومواليك وصدعت بالحق والبينة ودعوت إلى الله بالحكمة والموعظة الحسنه وأمرت باقامه الحدود والطاعة للمعبود ونهيت عن الخبائث والطغيان وواجهوك بالظلم والعدوان فجاهدتهم بعد الايعاد إليهم وتأكيد الحجة عليهم فنكثوا ذمامك وبيعتك وأسخطوا ربك وجدك وبدأوك بالحرب فثبت للطعن والضرب وطحنت جنود الفجار واقتحمت قسطل الغبار مجالدا بذي الفقار كأنك علي المختار '
                      'فلما رأوك ثابت الجأش غير خائف ولا خاش نصبوا لك غوائل مكرهم وقاتلوك بكيدهم وشرهم وأمر اللعين جنوده فمنعوك الماء ووروده وناجزوك القتال وعاجلوك النزل ورشقوك بالسهام والنبال وبسطوا إليك أكف الاصطلام ولم يرعوا لك ذماما ولا راقبوا فيك آثاما في قتلهم أولياءك ونهبهم رحالك وأنت مقدم في الهبوات ومحتمل للأذيات قد عجبت من صبرك وملائكة السماوات فأحدقوا بك من كل الجهات وأثخنوك بالجراح وحالوا بينك وبين الرواح ولم بيق لك ناصر وأنت محتسب صابر تذب عن نسوتك وأولادك حتى نكسوك عن جوادك فهويت إلى الأرض جريحا تطأك الخيول بحوافرها وتعلوك الطغاة بباترها قد رشح للموت جبينك واختلفت بالانقباض والانبساط شمالك ويمينك تدير طرفا خفيفا إلى رحلك وبيتك وقد شغلت بنفسك عن ولدك وأهاليك وأسرع فرسك شاردا إلى خيامك قاصدا محمحما باكيا فلما رأت النساء جوادك مخزيا ونظرت سرجك عليه ملويا برزن من الخدور ناشرات الشعور على الخدود '
                      'لاطمات الوجود سافرات وبالعويل داعيات وبعد العز مذللات والى مصرعك مبادرات والشمر جالسا على صدرك مولع سيفه على نحرك قابض على شيبتك بيده ذابح لك بمهنده قد سكنت حواسك وخفيت أنفاسك ورفع على القنا راسك وسبي أهلك كالعبيد وصفدوا في الحديد وفوق أقتاب المطيات تلفح وجوههم حر الهاجرات يساقون في البراري والفلوات أيديهم مغوله إلى الأعناق يطاف بهم في الأسواق فالويل للعصاه الفساق.\n\n'
                      'لقد قتلوا بقتلك الإسلام وعطلوا الصلاة والصيام ونقصوا السنن والأحكام وهدموا قواعد الإيمان وحرفوا آيات القران وهجموا في البغي والعدوان لقد أصبح رسول الله صلى الله عليه واله من أجلك موتورا وعاد كتاب الله عز وجل مهجورا وغودر الحق إذا قهرت مقهورا وفقد بفقدك التكبير والتهليل والتحريم والتحليل والتنزيل والتأويل وظهر بعدك التغيير والتبديل والإلحاد والتعطيل والأهواء والأضاليل والفتن والأباطيل فقام ناعيك عند قبر جدك الرسول صلى الله عليه واله فنعاك إليه بالدمع الهطول قائلا يا رسول الله قتل سبطك وفتاك واستبيح أهلك وحماك وسبيت بعدك ذراريك ووقع المحذور بعترتك وذويك فانزعج الرسول وبكى قلبه المهول وعزاه بك الملائكة والأنبياء وفجعت بك أمك الزهراء واختفت جنود الملائكة المقربين تعزي أباك أمير المؤمنين وأقيمت لك المآتم في أعلى عليين ولطمت عليك الحور العين وبكت السماء وسكانها والجنان وخزانها والهضاب '
                      'وأقطارها والبحار وحيتانها ومكة وبنيانها والجنان وولدانها والبيت والمقام و المعشر الحرام والحل والإحرام اللهم فبحرمه هذا المكان المنيف صل على محمد وال محمد واحشرني في زمرتهم وأدخلني الجنة بشفاعتهم اللهم إني أتوسل إليك يا أسرع الحاسبين ويا أكرم الأكرمين ويا أحكم الحاكمين بمحمد خاتم النبيين ورسولك إلى العالمين أجمعين وبأخيه وابن عمه الأنزع البطين العالم المكين علي أمير المؤمنين وبفاطمة سيده نساء العالمين وبالحسن الزكي عصمه المتقين وبأبي عبد الله الحسين أكرم المستشهدين وبأولاده المقتولين وبعترته المظلومين وبعلي بن الحسين زين العابدين وبمحمد بن علي فلبه الأولين وجعفر بن محمد اصدق الصادقين و موسى بن جعفر مظهر البراهين وعلي ابن محمد أزهد الزاهدين والحين بن علي وارث المستحلفين والحجة على '
                      'الخلق أجمعين أن تصلي على محمد وال محمد الصادقين الأبرين آل طــــه ويــــــس , وان تجعلني في القيامة من الآمنين المطمئنين الفائزين الفرحين المستبشرين اللهم اكتبني في المسلمين وألحقني بالصالحين ( واجعل لي لسان صدق في الآخرين ) وانصرني على الباغين واكفني كيد الحاسدين واصرف عني مكر الماكرين واقبض عني أيدي الظالمين واجمع بيني وبين السادة الميامين في أعلى عليين مع الذين أنعمت عليهم من النبيين والصديقين والشهداء والصالحين برحمتك يا ارحم الرحمين اللهم إني أقسم عليك بنبيك المعصوم.',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
            ],
          ),
        ),
        bottomNavigationBar: AddCustomBottomNavigationBar(
        pushNext: SalatJa3farAltayar.screenRoute,
        pushBack: Ziyarat2alYasin.screenRoute,
        soud: 'https://cdn.jsdelivr.net/gh/SounaDiab/image_audio@master/audio/زيارة الناحية المقدسة.mp3',
        onTap: (double fontSize) {
          // تحديث حجم الخط
          setState(() {
            isTablet ? _fontSizeTablet = fontSize : _fontSize = fontSize;
          });
          print('fontSize: $fontSize');
          // إغلاق Dialog
          Navigator.of(context).pop();
        },
        onLongPress: () {
          final snackBar = SnackBar(
            content: Center(
              child: Text(
                '${isTablet ? _fontSizeTablet.toInt() : _fontSize.toInt()}',
                style: TextStyle(
                  color: Colors.white,
                  fontSize: 16,
                ),
              ),
            ),
            width: 60,
            behavior: SnackBarBehavior.floating,
            backgroundColor: Colors.blue,
            duration: Duration(seconds: 2),
            shape: ShapeBorder.lerp(
              RoundedRectangleBorder(
                borderRadius: BorderRadius.circular(50),
              ),
              RoundedRectangleBorder(
                borderRadius: BorderRadius.circular(50),
              ),
              1,
            ),
          );
          ScaffoldMessenger.of(context).showSnackBar(snackBar);
        },
      ),
      ),
    );
  }
}
