import 'package:flutter/material.dart';
import 'package:maktabat_almoslim/widgets/container_scrollview.dart';
import 'package:provider/provider.dart';
import 'package:shared_preferences/shared_preferences.dart';

import '../../../../widgets/add_custom_bottom_navigation_bar.dart';
import '../../../../widgets/list_of_nine_verses.dart';
import '../../../favorites_provider.dart';
import '../../../favorites_screen.dart';
import '../ziyarat_alkazimin.dart';
import 'almasjed_alsharif.dart';
import 'ziyarat_2o5ra_lmohamad_altaki.dart';

class Ziyarat2o5raLmohamadAltakiAlsaniya extends StatefulWidget {
  static String screenRoute = 'ziyarat_2o5ra_lmohamad_altaki_alsaniya_screen';
  const Ziyarat2o5raLmohamadAltakiAlsaniya({super.key});

  @override
  State<Ziyarat2o5raLmohamadAltakiAlsaniya> createState() =>
      _Ziyarat2o5raLmohamadAltakiAlsaniyaState();
}

double _fontSize = 18;
double _fontSizeTablet = 30;

class _Ziyarat2o5raLmohamadAltakiAlsaniyaState
    extends State<Ziyarat2o5raLmohamadAltakiAlsaniya> {
  bool isIcon = true;
  @override
  void initState() {
    super.initState();
    _loadFavoriteState();
  }

  Future<void> _loadFavoriteState() async {
    final prefs = await SharedPreferences.getInstance();
    bool? savedState = prefs
        .getBool('isFavorite_ziyarat_2o5ra_lmohamad_altaki_alsaniya_screen');
    setState(() {
      isIcon = savedState ?? true;
    });
  }

  Future<void> _saveFavoriteState(bool value) async {
    final prefs = await SharedPreferences.getInstance();
    await prefs.setBool(
        'isFavorite_ziyarat_2o5ra_lmohamad_altaki_alsaniya_screen', value);
  }

  Future<bool> _onWillPop() async {
    final args =
        ModalRoute.of(context)!.settings.arguments as Map<String, dynamic>?;
    final previousPage = args?['previousPage'];
    if (previousPage == 'favorite_screen') {
      Navigator.of(context).pushReplacementNamed(FavoritesScreen.screenRoute);
      return false;
    } else {
      Navigator.of(context).pushReplacementNamed(ZiyaratAlkazimin.screenRoute);
      return false;
    }
  }

  @override
  Widget build(BuildContext context) {
    double size = MediaQuery.of(context).textScaleFactor;
    final screenWidth = MediaQuery.of(context).size.width;
    final isTablet = screenWidth >= 600;
    return WillPopScope(
      onWillPop: _onWillPop,
      child: Scaffold(
        appBar: AppBar(
          toolbarHeight: isTablet ? 100 : 50,
          centerTitle: true,
          leading: IconButton(
            onPressed: _onWillPop,
            icon: Icon(
              Icons.arrow_back,
              size: isTablet ? 50 : 25,
            ),
          ),
          actions: [
            IconButton(
              padding: EdgeInsets.only(left: isTablet ? 50 : 30),
              icon: Icon(
                isIcon ? Icons.favorite_border : Icons.favorite_rounded,
                size: isTablet ? 40 : 25,
                color: isIcon ? Colors.black : Colors.red,
              ),
              onPressed: () async {
                setState(() {
                  isIcon = !isIcon;
                });
                await _saveFavoriteState(isIcon);

                if (!isIcon) {
                  Provider.of<FavoritesProvider>(context, listen: false)
                      .addFavorite(
                          'زيارة أخرى محمد بن علي التقي (عليه السلام) الثانية',
                          Ziyarat2o5raLmohamadAltakiAlsaniya.screenRoute);
                } else {
                  Provider.of<FavoritesProvider>(context, listen: false)
                      .removeFavorite(
                          'زيارة أخرى محمد بن علي التقي (عليه السلام) الثانية',
                          Ziyarat2o5raLmohamadAltakiAlsaniya.screenRoute,
                          Ziyarat2o5raLmohamadAltakiAlsaniya.screenRoute);
                }
              },
            ),
          ],
          title: Text(
            'زيارة أخرى محمد بن علي التقي (عليه السلام) الثانية',
            style: TextStyle(
              fontSize: isTablet
                  ? 40
                  : size > 1.0
                      ? 20
                      : 23,
              fontWeight: FontWeight.bold,
            ),
          ),
        ),
        body: ContainerScrollview(
          widget: Column(
            crossAxisAlignment: CrossAxisAlignment.start,
            children: [
              Container(
                child: Column(
                  children: [
                    Center(
                      child: Text(
                        'بسم الله الرحمن الرحيم',
                        style: TextStyle(
                          fontSize: isTablet ? _fontSizeTablet : _fontSize,
                          fontWeight: FontWeight.w900,
                        ),
                      ),
                    ),
                    Center(
                      child: Text(
                        'اللهم صلِّ على محمد وآل محمد',
                        style: TextStyle(
                          fontSize: isTablet ? _fontSizeTablet : _fontSize,
                          fontWeight: FontWeight.w900,
                        ),
                      ),
                    ),
                  ],
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: '',
                  subtitle:
                      'روى الصّدوق في الفقيه ، قال : اذا أردت زيارته فاغتسل وتنظف والبس ثوبين طاهرين وقُل في زيارته :\n\n'
                      'اَللّـهُمَّ صَلِّ عَلى مُحَمَّدِ بْنِ عَلِيِّ الاِْمامِ التَّقِيِّ النَّقِيِّ الرِّضِيِّ الْمَرْضِيِّ وَحُجَّتِكَ عَلى مَنْ فَوْقَ الاَْرْضِ وَمَنْ تَحْتَ الثَّرى، صَلاةً كَثيرَةً نامِيَةً زاكِيَةً مُبارَكَةً مُتَواصِلَةً مُتَرادِفَةً مُتَواتِرَةً، كَاَفْضَلِ ما صَلَّيْتَ عَلى اَحَد مِنْ اَوْلِيائِكَ، وَاَلسَّلامُ عَلَيْكَ يا وَلِيَّ اللهِ، اَلسَّلامُ عَلَيْكَ يا نُورَ اللهِ، اَلسَّلامُ عَلَيْكَ يا حُجَّةَ اللهِ، اَلسَّلامُ عَلَيْكَ يا اِمامَ الْمُؤْمِنينَ وَوارِثَ عِلْمِ النَّبِيّينَ وَسُلالَةَ الْوَصِيّينَ، اَلسَّلامُ عَلَيْكَ يا نُورَ اللهِ في ظُلُماتِ الاَْرْضِ، اَتَيْتُكَ زائِراً عارِفاً بِحَقِّكَ مُعادِياً لاَِعْدائِكَ مُوالِياً لاَِوْلِيائِكَ فَاشْفَعْ لي عِنْدَ رَبِّكَ.\n\n'
                      'ثمّ سل حاجتك ثمّ صلّ في القُبّة الّتي فيها قبر مُحمّد بن عليّ (عليهما السلام) عند رأسه اربع ركعات ، ركعتين لزيارة موسى الكاظم (عليه السلام) وركعتين لزيارة محمّد التّقي (عليهما السلام) ولا تصلّ عند رأس موسى الكاظم فانّه يقابل قبُور قريش ولا يجوز اتّخاذها قبلة.\n\n'
                      'أقول : يبدو من كلام الشّيخ الصّدوق انّ قبر الامام الكاظم (عليه السلام) كان مفرزاً عن قبر الامام الجواد (عليه السلام)،فكان ينفرد بقُبّة مستقلّة وباب خاصّ فالزّائر يخرج منها ليدخل تحت قُبّة الجواد (عليه السلام) الّتي كانت ذات بناء خاص وأمّا الزّيارات المشتركة بين هذين الامامين الهمامين فهي ايضاً نوعان :',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: 'الاوّل :',
                  subtitle:
                      'ما يُزار به كلّ واحد منهُما (عليهما السلام) منفرداً.\n\n'
                      'روى الشّيخ الجليل جعفر بن محمّد بن قولويه القمّي في كتاب كامل الزّيارة عن الامام عليّ النّقي (عليه السلام) قال : قُل في زيارة كلّ من الامامين:\n\n'
                      'اَلسَّلامُ عَلَيْكَ يا وَلِيَّ اللهِ، اَلسَّلامُ عَلَيْكَ يا حُجَّةَ اللهِ، اَلسَّلامُ عَلَيْكَ يا نُورَ اللهِ في ظُلُماتِ الاَْرْضِ، اَلسَّلامُ عَلَيْكَ يا مَنْ بَدا للهِ في شَأنِهِ اَتَيْتُكَ زائِراً عارِفاً بِحَقِّكَ مُعادِياً لاَِعْدائِكَ مُوالِياً لاَِوْلِيائِكَ فَاشْفَعْ لي عِنْدَ رَبِّكَ يا مَوْلايَ.\n\n'
                      'وهذه الزّيارة معتبرة غاية الاعتبار وقد رواها ايضاً الصّدوق والكليني والطّوسي مع اختلاف يسير.',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: 'الثّاني :',
                  subtitle:
                      'ما يُزار به كلا الامامين (عليهما السلام) معاً وهي كما يلي :\n\n'
                      'قال المفيد والشّهيد ومحمّد ابن المشهدي: تقول في زيارتهما(عليهما السلام) اذا وقفت عند الضّريح الطّاهر :\n\n'
                      'اَلسَّلامُ عَلَيْكُما يا وَلِيَّيِ اللهِ، اَلسَّلامُ عَلَيْكُما يا حُجَّتَيِ اللهِ، اَلسَّلامُ عَلَيْكُما يا نُورَيِ اللهِ في ظُلُماتِ الاَْرْضِ، اَشْهَدُ اَنَّكُما قَدْ بَلَّغْتُما عَنِ اللهِ ما حَمَّلَكُما، وَحَفِظْتُما مَا اسْتَودَعْتُما، وَحَلَّلْتُما حَلالَ اللهِ وَحَرَّمْتُما حَرامَ اللهِ، وَاَقَمْتُما حُدُودَ اللهِ، وَتَلَوْتُما كِتابَ اللهِ، وَصَبَرْتُما عَلَى الاَْذى في جَنْبِ اللهِ مُحْتَسبَيْنَ حَتّى اَتاكُمَا الْيَقينُ، اَبْرَأُ اِلَى اللهِ مِنْ اَعْدائِكُما، وَاَتَقَرَّبُ اِلَى اللهِ بِوِلايَتِكُما، اَتَيْتُكُما زائِراً عارِفاً بِحَقِّكُما، مُوالِياً لاَِوْلِيائِكُما، مُعادِياً لاَِعْدائِكُما مُسْتَبْصِراً بِالْهُدَى الَّذي اَنْتُما عَلَيْهِ، عارِفاً بِضَلالَةِ مَنْ خالَفَكُما، فَاشْفَعا لي عِنْدَ رَبِّكُما فَاِنَّ لَكُما عِنْدَ اللهِ جاهاً عَظيماً وَمَقاماً مَحْمُوداً.\n\n'
                      'ثمّ قبّل التّربة الشّريفة وضع خدّك الايمن عليها ثمّ تحوّل الى جانب الرّأس المقدّس فقُل :\n\n'
                      'اَلسَّلامُ عَلَيْكُما يا حُجَّتَيِ اللهِ في اَرْضِهِ وَسَمائِهِ، عَبْدُكُما وَوَلِيُّكُما زائِرُكُما مُتَقَرِّباً اِلَى اللهِ بِزِيارَتِكُما، اَللّـهُمَّ اجْعَلْ لي لِسانَ صِدْق في اَوْلِيائِكَ الْمُصْطَفَيْنَ، وَحَبِّبْ اِلَيَّ مَشاهِدَهُمْ وَاجْعَلْني مَعَهُمْ في الدُّنْيا وَالاْخِرَةِ يا اَرْحَمَ الرّاحِمينَ، ثمّ صلّ ركعتين لزيارة كلّ امام وادعُ بما أحببت.',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: 'أقول :',
                  subtitle:
                      'كان عصر صُدور هذه الزّيارات عصر التقيّة الشّديدة ولاجل ذلك كان المعصومون (عليهم السلام) يعلّمون الشّيعة زيارات قصيرة صيانة لهم عن طاغية الزّمان، فالزّائر إن طلب زيارة طويلة فليقرأ الزّيارات الجامعة الاتية وهي خير ما يُزاران بها ولا سيّما الزّيارة الاُولى منها حيث يظهر من روايتها انّ لها مزيد اختصاص بالامام الكاظم (عليه السلام)، واذا شاء الزّائر أن يخرج من بلدهما(عليهما السلام) فليودّعهما(عليهما السلام) بدعوات الوداع، ومن تلك الدّعوات ما رواه الطّوسي(رحمه الله)في التّهذيب قال : اذا أردت أن تودع الامام مُوسى (عليه السلام) فقِف عند القبر وقُل:\n\n'
                      'اَلسَّلامُ عَلَيْكَ يا مَوْلايَ يا اَبَا الْحَسَنِ وَرَحْمَةُ اللهِ وَبَرَكاتُهُ، اَسْتَوْدِعُكَ اللهَ وَاَقْرَأُ، عَلَيْكَ السَّلامَ آمَنّا بِاللهِ وَبِالرَّسُولِ وَبِما جِئْتَ بِهِ وَدَلَلْتَ عَلَيْهِ، اَللّـهُمَّ اَكْتُبْنا مَعَ الشّاهِدينَ. وتقول أيضاً في وداع الامام محمد التقي(عليه السلام): السَّلامُ عَلَيكَ يا مَولايَ يا ابْنَ رَسُولِ الله ورَحمَةُ اللهِ وَبَركاتُهُ أسْتَوْدِعُكَ اللهَ وأقْرأُ عَلَيْكَ السَّلامَ آمَنّا باللهِ وبِرَسُولِهِ وبِما جِئْتَ بِهِ وَلَلْتَ عَلَيْهِ، الَّلهُمَّ اُكْتُبْنا مَعَ الشّاهِدِينَ.\n\n'
                      'وتقول ايضاً في وداع الامام محمّد التّقي (عليه السلام):\n\n'
                      'اَلسَّلامُ عَلَيْكَ يا مَوْلايَ يا بْنَ رَسُولِ اللهِ وَرَحْمَةُ اللهِ وَبَرَكاتُهُ اَسْتَوْدِعُكَ اللهَ وَاَقْرَءُ عَلَيْكَ السَّلامُ آمَنّا بِاللهِ وَبِالرَّسُولِ وَبِما جَئْتَ بِهِ وَدَلَلْتَ عَلَيْهِ اَللّـهُمَّ اَكْتُبْنا مَعَ الشّاهِدينَ.\n\n'
                      'ثمّ سل الله تعالى أن لا تكون هذه آخر عهدك من زيارتهم وأن توفّق للعود، وقبل القبر وضَع خدّيك عليه.',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: 'أقول :',
                  subtitle:
                      'ممّا يناسب المقام قصّة السّعيد الصّالح الصّفيّ المتّقي الحاج عليّ البغدادي الّتي أوردها شيخنا في جنّة المأوى والنّجم الثّاقب، وقال في كتاب النّجم الثّاقب: انّه لو لم يكن في هذا الكتاب سوى هذه القصّة المتقنة الصّحيحة الحاوية على فوائد جمّة الحادثة في عصرنا لكفاه شرفاً ونفساً، ثمّ قال بعدما مهّده من المقدّمات : حكى الحاج علي أيّده ا لله قائلاً: تراكم في ذمّتي من سهم الامام (عليه السلام) من الخمس مبلغ ثمانين توماناً، فرحلت الى النّجف الاشرف ودفعت منها الى علم الهُدى والتّقي حضرة الشّيخ مرتضى أعلى الله مقامه عشرين توماناً، والى حضرة الشّيخ محمّد حسين المجتهد الكاظمي عشرين توماناً، والى حضرة الشّيخ محمّد الشّروقي عشرين توماناً، ولم يبق عليّ سوى عشرين توماناً كنت أروم أن اقدّمها اذا قفلت من النّجف الى الشّيخ '
                      'محمّد حسن آل يس الكاظمي أيّده الله، ووددت لمّا وافيت بغداد أن أُبادر الى أداء ما استمرّ عليّ من السّهم، فتوجّهت الى الكاظميّة وكان اليوم يوم الخميس فزرت الامامين الهمامين الكاظمين (عليهما السلام)ثمّ وافيت حضرة الشّيخ سلّمه الله فنقدته شطراً من العشرين توماناً وأوعدته بانّ أؤدّي الباقي اذا بعت بعض البضائع بأن أبذله الى مستحقّه حسب ما يحيله عليّ بالتّدريج، ثمّ أزمعت على مغادرة الكاظميّة ورفضت ما الحّ فيه حضرة الشّيخ من البقاء معتذراً بأن عليّ أن أوفيّ عمّال معمل النّسيج أجورهم حسب ما قررت عليه من بذل أجر عمل الاسبوع في يوم الخميس عصراً، فأخذت أسلك طريقي الى بغداد، فلمّا قاربت ثلث الطّريق اذاً أنا بسيّد جليل من السّادة يعرّج عليّ في طريقه الى الكاظميّة فدنى منّي وسلّم عليّ وبسط يده للمصافحة والمعانقة ورحّب بي قائلاً: أهلاً وسهلاً وضمّني الى صدره وتلاثمنا، وكان قد تعمّم '
                      'بعمامة خضراء زاهرة وفي وجهه الشّريف شامة كبيرة سوداء فتوقّف وقال: خير أيّها الحاج علي أين المقصد؟ فأجبته : قد زُرت الكاظمين (عليهما السلام)وأنا الان ماض الى بغداد ، فقال لي : عُد الى الكاظمين (عليه السلام)فهذه ليلة الجمعة ، قلت : لا يسعني العود ، فأجاب : ذلك في وسعك عُد كي اشهد لك بانّك من الموالين لجدّي امير المؤمنين (عليه السلام) ولنا ويشهد لك الشّيخ ، فقد قال تعالى : واستشهدوا شهيدين، وكان هذا تلميحاً الى ما كنت أتوخاه من التماس الشّيخ أن يمنحني رقعة أجعلها في كفني يشهد لي فيها بانّي من الموالين لاهل البيت (عليهم السلام)، فسألته من أين عرفتني وكيف تشهد لي . فأجاب : وكيف لا يعرف المرء من وافاه حقّه ، قلت : وأيّ حقّ هذا الّذي تعنيه ؟ فأجاب : ما بذلته لوكيلي ، قلت : ومن هو ، قال : الشّيخ '
                      'محمّد حسن ، فقلت : أهو وكيلك ؟ أجاب : هو وكيلي وكذلك السّيد محمّد ، قال الحاج علي: ما كنت أعرف صاحبي هذا ولكنّه كان قد دعاني باسمي فاحتملت أن تكون بيننا معرفة سابقة وقلت أيضاً في نفسي: انّه يطالبني بشيء من الخمس ووددت أن أبذل له من سهم الامام (عليه السلام) فقُلت : يا أيّها السّيد انّه قد بقي في ذمّتي من حقّكم شيء (أي حقّ السّادة) وقد راجعت في ذلك حضرة الشّيخ محمّد حسن كي أؤدّيه اليكم باذنه، فتبسّم في وجهي قائلاً : نعم قد أبلغت شطراً من حقّنا الى وكلائنا في النّجف الاشرف ، فقلت : هل قُبل ما أدّيته ؟ قال : نعم ، ثمّ انتبهت الى انّ صاحبي هذا يعبّر عن اعاظم العلماء بكلمة وكلائي فاستكبرت ذلك ثمّ قلت في نفسي : العلماء وكلاء السّادة في قبض حقوقهم ثمّ اعترضتني الغفلة ، انتهى.',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: 'ثمّ قال لي :',
                  subtitle:
                      'عُد الى زيارة جدّي فطاوعته وعُدت معه وكنت قابضاً على يده اليمنى بيدي اليسرى ، فلمّا استأنفنا المسير وجدت نهراً الى جانبنا الايمن يجري بماء زلال ووجدت اشجار اللّيمون والرّارنج والعنب والرّمان وغيرها تظلّنا من فوق رؤوسنا وكلّها مثمرة معاً في غير مواسمها، فسألته عن النّهر والاشجار ، فقال: انّها تصاحب كلّ مُوال من موالينا اذا زار جدّنا وزارنا، فقلت له : '
                      'مسألة أريد سؤالها، قال : سل، قلت : انّ الشّيخ عبد الرّزاق (رحمه الله) كان ممّن يزاول التّدريس وقد وافيته يوماً فسمعته يقول : من دأب في حياته على صيام النّهار وقيام اللّيل وحجّ اربعين حجّة واعتمر أربعين عُمرة ثمّ وافته المنون وهو بين الصّفا والمروة ولم يكن هو من الموالين لامير المؤمنين (عليه السلام) ما كان له شيء من الاجر. فأجاب : نعم والله ما كان له شيء. ثمّ سألته عن بعض أقربائي هل هو من الموالين لامير المؤمنين (عليه السلام) ، فأجاب : نعم هو ومن يتّصل بك ، ثمّ قلت : سيّدنا مسألة، قال:سل ، قلت له : يقول خطباء مأتم الحسين (عليه السلام) انّ سليمان الاعمش أتى رجلاً يسأله عن زيارة سيّد الشّهداء (عليه السلام) فأجابه الرّجل انّها بدعة ثمّ رأى في المنام هودجاً بين السّماء والارض فسأل عن الهودج فأجيب بأنّ فيه فاطمة الزّهراء وخديجة الكبرى (عليهما السلام) فسأل أين تذهبان، فأجيب الى زيارة الحسين (عليه السلام) في هذه اللّيلة وهي ليلة الجمعة، وشاهد رقعاً تتساقط الى الارض من ذلك الهودج كتب فيها '
                      'اَمانٌ مِنَ النّارِ لِزُوّارِ الْحُسَيْنِ عَلَيْهِ السَّلامُ في لَيْلَةِ الْجُمُعَةِ، اَمانٌ مِنِ النّارِ يَوْمَ الْقِيامَةِ، فهل صحيح هذا الحديث ؟ قال : نعم تامّ صحيح . قلت : سيّدنا أصحيح ما يُقال من انّ من زار الحسين (عليه السلام) ليلة الجمعة كان آمناً ؟ قال : نعم ، ودمعت عيناه وبكى ، قلت : سيّدنا مسألة ، قال : سل ، قلت : قد زُرنا الرّضا (عليه السلام) سنة ألف ومائتين وتسع وستّين فصادفنا في بلدة درود أحد الشّرُوقيّين (وهم قوم من العرب يسكنون البادية الشّرقيّة للنّجف الاشرف) فاضفناه وسألناه عن ولاية الرّضا(عليه السلام)، فقال: هي الجنّة، وقال : هذا هو الخامس عشر من ايّام اقتات فيها بطعام الرّضا(عليه السلام) فكيف يجرأ منكر ونكير أن يدنوا منّي في قبري انّه قد نبت لحمي وعظمي من طعام الرّضا(عليه السلام)في دار ضيافته، فهل صحيح انّ الرّضا(عليه السلام) يوافيه في قبره وينجيه من '
                      'منكر ونكير؟ فأجاب : نعم والله انّ جدّي الضّامن ، قلت : سيّدنا مسألة قصيرة شئت أسألها ، قال : سل ، قلت : زيارتي للرّضا (عليه السلام) هل هي مقبُولة؟ أجاب : مقبولة ان شاء الله ، قلت : سيّدنا مسألة ، قال : سل بسم الله ، قلت : وهل قُبلت زيارة الحاج محمّد حسين البزّاز (بزّاز باشى) ابن المرحوم الحاج احمد البّزاز (بزّاز باشى) وقد رافقته في طريقي الى مشهد الرّضا (عليه السلام) فكنّا شريكين في النّفقة ؟ قال : '
                      'زيارة العبد الصّالح مقبولة ، قلت : سيّدنا مسألة ، قال : سل بسم الله ، قلت : وهل قُبلت زيارة فلان من أهالي بغداد وكان معنا في طريقنا الى خراسان، فسكت ولم يجب ، قلت : سيّدنا مسألة ، قال : سل بسم الله ، قلت : هل سمعت مسألتي السّابقة؟ هل قُبلت زيارة الرّجل؟ فلم يجبني ، قال: الحاج عليّ انّ الرّجل كان هو واخلاّؤه في الطّريق من أهالي بغداد المترفين وكانوا في رحلتهم هذه يدأبون في اللّعب واللّهو وكان هو قاتل امّه.\n\n'
                      'ثمّ بلغنا متّسعاً من الطّريق يواجه مدينة الكاظمين (عليه السلام) محاطاً بالبساتين من الجانبين وكان شطر من هذه الجادة يقع على يمين القادم من بغداد ملكاً لبعض الايتام من السّادة وقد اغتصبته الحكومة فجعله جزءاً من الطّريق العام، فكان الورع التّقي من أهالي بغداد والكاظميّة يحذر المسير في هذا الشّطر من الجادة، فرأيت صاحبي هذا لا يأبى الجري عليه ، فقلت له : سيّدي هذا الموضع ملك لبعض الايتام من السّادة ولا ينبغي التّصرّف فيه ، فأجاب: هو لجدّي امير المؤمنين (عليه السلام) وذرّيّته وأولادنا ويحلّ التّصرف فيه لموالينا، وكان على الجانب الايمن قُرب هذا الموضِع بستان لرجل يدعى الحاج ميرزا هادي وكان ثرياً من أثرياء العجم '
                      'المشهورين وكان يسكن بغداد ، فقلت : سيّدنا هل صحيح ما يقال انّ هذا البستان أرضه للامام موسى بن جعفر (عليهما السلام)؟ قال : ما شأنك وهذا، وأعرض عن الجواب ، ثمّ بلغنا ساقية مدّت من نهر دجلة لريّ المزارع والبساتين وهي تقاطع الجادة فتنشعب هُناك المسلك الى المدينة شعبتين هما الشّارع السّلطاني وشارع السّادة، فتوجّه صاحبي الى شارع السّادة فدعوته الى الشّارع السّلطاني فرفض وقال: لنسر في شارعنا هذا، فما خطونا خطوات الاّ ووجدنا أنفسنا في الصّحن المقدّس عند منزع الاحذية (الكيشوانيّة) من دون أن نمرّ '
                      'بسوق أو زقاق، فدخلنا الايوان من جانب باب المراد شرقاً ممّا يلي الرّجل فلم يمكث صاحبي للاستئذان لدخول الرّواق الطّاهر وورد من دون الاستئذان، ثمّ وقف على باب الحرم الشّريف فخاطبني وقال : زُر ، قلت : انّي لا أعرف القراءة ، قال : فأقرأ لك الزّيارة ؟ قلت : نعم ، فقال : أَاَدْخُلُ يا اَللهُ، اَلسَّلامُ عَلَيْكَ يا رَسُولَ اللهِ، السَّلامُ عَلَيْكَ يا اَميرَ الْمُؤْمِنينَ، (وسلّم على الائمة واحداً فواحداً حتّى بلغ الامام العسكري (عليه السلام) فقال:) اَلسَّلامُ عَلَيْكَ يا اَبا مُحَمَّد الْحَسَنَ الْعَسْكَرِيَّ، '
                      'ثمّ خاطبني قائلاً : أتعرف امام عصرك ؟ أجبت : وكيف لا أعرفه ، قال : فسلّم عليه، فقلت: اَلسَّلامُ عَلَيْكَ يا حُجَّةَ اللهِ يا صاحِبَ الزَّمانِ يا بْنَ الْحَسَنِ، فتبسّم وقال : عَلَيْكَ السَّلامُ وَرَحْمَةُ اللهِ وَبَرَكاتُهُ، فدخلنا الحرم الطّاهر وانكببنا على الضّريح المقدّس وقبّلناه ثمّ قال لي : زُر ، قلت : لا أعرف القراءة ، قال : فأقرأ لك الزّيارة؟ قلت: نعم ، قال : في أي الزّيارات ترغب؟ قلت : اقرأ عليَّ ما هو أفضل الزّيارات ، فقال : زيارة امين الله هي الفضلى، ثمّ أخذ يزُور بها قائلاً: اَلسَّلامُ عَلَيْكُما يا اَمينَيِ اللهِ في اَرْضِهِ وَحُجَّتَيْهِ عَلى عِبادِهِ .. الخ واُجّجت حينئذ مصابيح الحرم الشّريف فشاهدت الشّموع لا تؤثر ضياءً في تلك البُقعة الشّريفة فكأنّها مشرقة بنور الشّمس والشّموع تبدو كما لو '
                      'اُجّجت في وضح النّهار هذا وأنا ذاهِل عن هذه الايات فلا أنتبه اليها، فلمّا انتهى من الزّيارة دار من سمت الرّجل الى خلف القبر الشّريف فوقف في الجانب الشّرقي وقال : هل تزُور جدّي الحسين (عليه السلام) ؟ قلت : نعم أزُوره (عليه السلام)فهذه ليلة الجُمعة، فزاره (عليه السلام)بزيارة وارث وانتهى المؤذّن حينئذ من أذان المغرب ، فقال لي صاحبي : صلّ والتحق بالجماعة فأتى المسجد الواقع خلف القبر الشّريف وقد أقيمت هُناك صلاة الجماعة ووقف هو منفرداً الى يمين الامام محاذياً له ، أمّا أنا فوجدت مكاناً في الصّف الاوّل '
                      'ووقفت هُناك مصلّياً مع الجماعة فلمّا فرغت من الصّلاة لم أجد صاحبي فخرجت من المسجد وفتّشت عنه الحرم الشّريف فلم أجده وكنتُ أنوي أن أبذل له عدّة قرانات واستضيفه تلك اللّيلة واذا أنا أفيق من غفلتي وأنتبه، فأشخص السّيد الّذي صحبني فتتوالى في خاطري الايات والمعجزات التي مرّت بي فقد انقادت له نفسي فعدت معه الى الكاظمين (عليهما السلام) غير مبال بما كان يصدّني عن ذلك من الامر الهام في بغداد وقد دعاني باسمي ولم أكن قد رأيته من قبل وقد عبّر بكلمة الموالين لنا وقال ايضاً: أنا اشهد لك، وقد أبدى لي النّهر الجاري والاشجار المثمرة في غير مواسمها، فهذه الشّواهد الواضحة وغيرها ممّا شهدت تورث لي القطع واليقين بأنّه هو الامام المهدي (عليه السلام) ولا سيّما انّه سألني : هل '
                      'تعرف امام زمانك ؟ قلت : نعم ، فقال : سلّم عليه ، فلمّا سلّمت تبسّم وردّ هو عليّ السّلام ثمّ أتيت حافظ الاحذية (الكيشوان) وسألته عن صاحبي ، فأجاب : قد خرج وسألني أكان هو صاحبك ؟ قلت : نعم ، ثمّ أويت الى البيت الّذي كنت أحلّ بها ضيفاً فبتّ فيه ليلتي فلمّا أصبح الصّباح توجّهت الى حضرة الشّيخ محمّد حسن وقصصت له قصّتي، فوضع يده على فيه ونهاني عن افشاء القصّة وقال لي : وفّقك الله فكنت أكتمها ولا اُنبىء بها أحداً، وبعد شهر من حدوثها شاهدت يوماً في الحرم الطّاهر سيّداً جليلاً يدنُو منّي ويسألني ماذا حدث لك ويلمح الى القصّة فأنكرتها قائلاً : لم يحدث لي شيء ، فأعاد عليَّ كلامه فاشتدّ انكاري لها ، ثمّ غاب عن بصري ولم أره بعد ، انتهى.',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
            ],
          ),
        ),
        bottomNavigationBar: AddCustomBottomNavigationBar(
          pushNext: AlmasjedAlsharif.screenRoute,
          pushBack: Ziyarat2o5raLmohamadAltaki.screenRoute,
          soud: '',
          onTap: (double fontSize) {
            // تحديث حجم الخط
            setState(() {
              isTablet ? _fontSizeTablet = fontSize : _fontSize = fontSize;
            });
            print('fontSize: $fontSize');
            // إغلاق Dialog
            Navigator.of(context).pop();
          },
          onLongPress: () {
            final snackBar = SnackBar(
              content: Center(
                child: Text(
                  '${isTablet ? _fontSizeTablet.toInt() : _fontSize.toInt()}',
                  style: TextStyle(
                    color: Colors.white,
                    fontSize: 16,
                  ),
                ),
              ),
              width: 60,
              behavior: SnackBarBehavior.floating,
              backgroundColor: Colors.blue,
              duration: Duration(seconds: 2),
              shape: ShapeBorder.lerp(
                RoundedRectangleBorder(
                  borderRadius: BorderRadius.circular(50),
                ),
                RoundedRectangleBorder(
                  borderRadius: BorderRadius.circular(50),
                ),
                1,
              ),
            );
            ScaffoldMessenger.of(context).showSnackBar(snackBar);
          },
        ),
      ),
    );
  }
}
