import 'package:flutter/material.dart';
import 'package:provider/provider.dart';
import 'package:shared_preferences/shared_preferences.dart';

import '../../../widgets/add_custom_bottom_navigation_bar.dart';
import '../../../widgets/container_scrollview.dart';
import '../../../widgets/list_of_nine_verses.dart';
import '../../favorites_provider.dart';
import '../../favorites_screen.dart';
import '../al2a3mal_al3ama.dart';
import 'altasbihat.dart';
import 'dou3a2_l2iftitah.dart';

class Dou3a2MakarimAl2a5lak extends StatefulWidget {
  static String screenRoute = 'dou3a2_makarim_al2a5lak_screen';
  const Dou3a2MakarimAl2a5lak({super.key});

  @override
  State<Dou3a2MakarimAl2a5lak> createState() => _Dou3a2MakarimAl2a5lakState();
}

double _fontSize = 18;
double _fontSizeTablet = 30;

class _Dou3a2MakarimAl2a5lakState extends State<Dou3a2MakarimAl2a5lak> {
  bool isIcon = true;
  @override
  void initState() {
    super.initState();
    _loadFavoriteState();
  }

  Future<void> _loadFavoriteState() async {
    final prefs = await SharedPreferences.getInstance();
    bool? savedState =
        prefs.getBool('isFavorite_dou3a2_makarim_al2a5lak_screen');
    setState(() {
      isIcon = savedState ?? true;
    });
  }

  Future<void> _saveFavoriteState(bool value) async {
    final prefs = await SharedPreferences.getInstance();
    await prefs.setBool('isFavorite_dou3a2_makarim_al2a5lak_screen', value);
  }

    Future<bool> _onWillPop() async {
    final args =
        ModalRoute.of(context)!.settings.arguments as Map<String, dynamic>?;
    final previousPage = args?['previousPage'];
    if (previousPage == 'favorite_screen') {
      Navigator.of(context).pushReplacementNamed(FavoritesScreen.screenRoute);
      return false;
    } else {
      Navigator.of(context).pushReplacementNamed(Al2a3malAl3ama.screenRoute);
      return false;
    }
  }

  @override
  Widget build(BuildContext context) {
    double size = MediaQuery.of(context).textScaleFactor;
    final screenWidth = MediaQuery.of(context).size.width;
    final isTablet = screenWidth >= 600;
    return WillPopScope(
      onWillPop: _onWillPop,
      child: Scaffold(
        appBar: AppBar(
          toolbarHeight: isTablet ? 100 : 50,
          centerTitle: true,
          leading: IconButton(
            onPressed: _onWillPop,
            icon: Icon(
              Icons.arrow_back,
              size: isTablet ? 50 : 25,
            ),
          ),
          actions: [
            IconButton(
              padding: EdgeInsets.only(left: isTablet ? 50 : 30),
              icon: Icon(
                isIcon ? Icons.favorite_border : Icons.favorite_rounded,
                size: isTablet ? 40 : 25,
                color: isIcon ? Colors.black : Colors.red,
              ),
              onPressed: () async {
                setState(() {
                  isIcon = !isIcon;
                });
                await _saveFavoriteState(isIcon);
      
                if (!isIcon) {
                  Provider.of<FavoritesProvider>(context, listen: false)
                      .addFavorite('دعاء مكارم الاخلاق',
                          Dou3a2MakarimAl2a5lak.screenRoute);
                } else {
                  Provider.of<FavoritesProvider>(context, listen: false)
                      .removeFavorite(
                          'دعاء مكارم الاخلاق',
                          Dou3a2MakarimAl2a5lak.screenRoute,
                          Dou3a2MakarimAl2a5lak.screenRoute);
                }
              },
            ),
          ],
          title: Text(
            'دعاء مكارم الاخلاق',
            style: TextStyle(
              fontSize: isTablet
                  ? 40
                  : size > 1.0
                      ? 20
                      : 23,
              fontWeight: FontWeight.bold,
            ),
          ),
        ),
        body: ContainerScrollview(
          widget: Column(
            crossAxisAlignment: CrossAxisAlignment.start,
            children: [
              Center(
                child: Text(
                  'بسم الله الرحمن الرحيم',
                  style: TextStyle(
                    fontSize: isTablet ? _fontSizeTablet + 10 : _fontSize,
                    fontWeight: FontWeight.w900,
                  ),
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: '',
                  subtitle:
                      'اللّهُمَّ، صَلِّ عَلَى مُحَمَّدٍ وَآلِهِ، وَبَلِّغْ بِإِيْمانِي أَكْمَلَ الْإِيْمانِ، وَاجْعَلْ يَقِينِي أَفْضَلَ الْيَقِينِ، وَانْتَهِ بِنِيَّتِي إِلَى أَحْسَنِ النِّيَّاتِ، وَبِعَمَلِي إِلَى أَحْسَنِ الْأَعْمالِ. اللّهُمَّ، وَفِّرْ بِلُطْفِكَ نِيَّتِي، وَصَحِّحْ بِما عِنْدَكَ يَقِينِي، وَاسْتَصْلِحْ بِقُدْرَتِكَ ما فَسَدَ مِنِّي. اللّهُمَّ، صَلِّ عَلَى مُحَمَّدٍ وَآلِهِ، وَاكْفِنِي ما يَشْغَلُنِي الْاهْتِمامُ بِهِ، وَاسْتَعْمِلْنِي بِما تَسْأَلُنِي غَداً عَنْهُ، وَاسْتَفْرِغْ أَيَّامِي فِيما خَلَقْتَنِي لَهُ، وَأَغْنِنِي وَأَوْسِعْ عَلَيَّ فِي رِزْقِكَ، وَلا تَفْتِنِّي بِالنَّظَرِ، وَأَعِزَّنِي وَلا تَبْتَلِيَنِّي بِالْكِبْرِ، وَعَبِّدْنِي لَكَ وَلا تُفْسِدْ عِبادَتِي بِالْعُجْبِ، وَأَجْرِ لِلنَّاسِ عَلَى يَدَيَّ الْخَيْرَ وَلا تَمْحَقْهُ بِالْمَنِّ، وَهَبْ لِي مَعالِيَ الْأَخْلاقِ، وَاعْصِمْنِي مِنَ الْفَخْرِ. اللّهُمَّ، صَلِّ عَلَى مُحَمَّدٍ وَآلِهِ، وَلا تَرْفَعْنِي فِي النَّاسِ دَرَجَةً إِلّا حَطَطْتَنِي عِنْدَ نَفْسِي مِثْلَها، وَلا تُحْدِثْ لِي عِزّاً ظاهِراً إِلّا أَحْدَثْتَ لِي ذِلَّةً باطِنَةً عِنْدَ نَفْسِي بِقَدَرِها. اللّهُمَّ، صَلِّ عَلَى مُحَمَّدٍ وَآلِ مُحَمَّدٍ، وَمَتِّعْنِي بِهُدَىً صالِحٍ لا أَسْتَبْدِلُ بِهِ، وَطَرِيقَةِ حَقٍّ لا أَزِيغُ عَنْها، وَنِيَّةِ رُشْدٍ لا أَشُكُّ فِيها، وَعَمِّرْنِي ما كانَ عُمْرِي بِذْلَةً فِي طاعَتِكَ، فَإِذا كانَ عُمْرِي مَرْتَعاً لِلشَّيْطانِ، فَاقْبِضْنِي إِلَيْكَ قَبْلَ أَنْ يَسْبِقَ مَقْتُكَ إِلَيَّ أَوْ يَسْتَحْكِمَ غَضَبُكَ عَلَيَّ. اللّهُمَّ، لا تَدَعْ خَصْلَةً تُعابُ مِنِّي إِلّا أَصْلَحْتَها، وَلا عائِبَةً أُؤَنَّبُ بِها إِلّا حَسَّنْتَها، وَلا أُكْرُومَةً فِيَّ ناقِصَةً إِلّا أَتْمَمْتَها. اللّهُمَّ، صَلِّ عَلَى مُحَمَّدٍ وَآلِ مُحَمَّدٍ، وَأَبْدِلْنِي مِنْ بِغْضَةِ أَهْلِ الشَّنآنِ الْمَحَبَّةَ، وَمِنْ حَسَدِ أَهْلِ الْبَغْيِ الْمَوَدَّةَ، وَمِنْ ظِنَّةِ أَهْلِ الصَّلاحِ الثِّقَةَ، وَمِنْ عَداوَةِ الْأَدْنَيْنَ الْوِلايَةَ، وَمِنْ عُقُوقِ ذَويِ الْأَرْحامِ الْمَبَرَّةَ، وَمِنْ خِذْلانِ الْأَقْرَبِينَ النُّصْرَةَ، وَمِنْ حُبِّ الْمُدارِينَ تَصْحِيحَ الْمِقَةِ، وَمِنْ رَدِّ الْمُلابِسِينَ كَرَمَ الْعِشْرَةِ، وَمِنْ مَرارَةِ خَوْفِ الظَّالِمِينَ حَلاوَةَ الْأَمَنَةِ. اللّهُمَّ، صَلِّ عَلَى مُحَمَّدٍ وَآلِهِ، وَاجْعَلْ لِي يَداً عَلَى مَنْ ظَلَمَنِي، وَلِساناً عَلَى مَنْ خاصَمَنِي، وَظَفَراً بِمَنْ عانَدَنِي، وَهَبْ لِي مَكْراً عَلَى مَنْ كايَدَنِي، وَقُدْرَةً عَلَى مَنِ اضْطَهَدَنِي، وَتَكْذِيباً لِمَنْ قَصَبَنِي، وَسَلامَةً مِمَّنْ تَوَعَّدَنِي، وَوَفِّقْنِي لِطاعَةِ مَنْ سَدَّدَنِي، وَمُتابَعَةِ مَنْ أَرْشَدَنِي. اللّهُمَّ، صَلِّ عَلَى مُحَمَّدٍ وَآلِهِ، وَسَدِّدْنِي لأَنْ أُعارِضَ مَنْ غَشَّنِي بِالنُّصْحِ، وَأَجْزِيَ مَنْ هَجَرَنِي بِالْبِرِّ، وَأُثِيبَ مَنْ حَرَمَنِي بِالْبَذْلِ، وَأُكافِىءَ مَنْ قَطَعَنِي بِالصِّلَةِ، وَأُخالِفَ مَنِ اغْتابَنِي إِلَى حُسْنِ الذِّكْرِ، وَأَنْ أَشْكُرَ الْحَسَنَةَ وَأُغْضِيَ عَنِ السَّيِّئَةِ. اللّهُمَّ، صَلِّ عَلَى مُحَمَّدٍ وَآلِهِ، وَحَلِّنِي بِحِلْيَةِ الصَّالِحِينَ، وَأَلْبِسْنِي زِينَةَ المُتَّقِينَ، فِي بَسْطِ الْعَدْلِ، وَكَظْمِ الْغَيْظِ، وَإِطْفاءِ النَّائِرَةِ، وَضَمِّ أَهْلِ الْفُرْقَةِ، وَإِصْلاحِ ذاتِ الْبَيْنِ، وَإِفْشاءِ الْعارِفَةِ، وَسَتْرِ الْعائِبَةِ وَلِينِ الْعَرِيكَةِ وَخَفْضِ الْجَناحِ، وَحُسْنِ السِّيرَةِ، وَسُكُونِ الرِّيحِ، وَطِيبِ الْمُخالَقَةِ، وَالسَّبْقِ إِلَى الْفَضِيلَةِ، وَإِيثارِ التَّفَضُّلِ، وَتَرْكِ التَّعْييرِ، وَالْإِفْضالِ عَلَى غَيْرِ الْمُسْتَحِقِّ، وَالْقَوْلِ بِالْحَقِّ وَإِنْ عَزَّ، وَاسْتِقْلالِ الْخَيْرِ وَإِنْ كَثُرَ مِنْ قَوْلِي وَفِعْلِي، وَأَكْمِلْ ذلِكَ لِي بِدَوامِ الطَّاعَةِ وَلُزُومِ الْجَماعَةِ، وَرَفْضِ أَهْلِ الْبِدَعِ وَمُسْتَعْمِلِي الرَّأْيِ الْمُخْتَرَعِ. اللّهُمَّ، صَلِّ عَلَى مُحَمَّدٍ وَآلِهِ، وَاجْعَلْ أَوْسَعَ رِزْقِكَ عَلَيَّ إِذا كَبِرْتُ، وَأَقْوى قُوَّتِكَ فِيَّ إِذا نَصِبْتُ، وَلا تَبْتَلِنِي بِالْكَسَلِ عَنْ عِبادَتِكَ، وَلا الْعَمَى عَنْ سَبِيلِكَ، وَلا بِالتَّعَرُّضِ لِخِلافِ مَحَبَّتِكَ، وَلا مُجامَعَةِ مَنْ تَفَرَّقَ عَنْكَ، وَلا مُفارَقَةِ مَنِ اجْتَمَعَ إِلَيْكَ. اللّهُمَّ، اجْعَلْنِي أَصُولُ بِكَ عِنْدَ الضَّرُورَةِ، وَأَسْأَلُكَ عِنْدَ الْحاجَةِ، وَأَتَضَرَّعُ إِلَيْكَ عِنْدَ الْمَسْكَنَةِ، وَلا تَفْتِنِّي بِالْاسْتِعانَةِ بِغَيْرِكَ إِذا اضْطُرِرْتُ، ولا بِالْخُضُوعِ لِسُؤالِ غَيْرِكَ إِذا افْتَقَرْتُ، وَلا بِالتَّضَرُّعِ إِلَى مَنْ دُوْنَكَ إِذا رَهِبْتُ، فَأَسْتَحِقَّ بِذلِكَ خِذْلانَكَ وَمَنْعَكَ وَإِعْراضَكَ، يا أَرْحَمَ الرَّاحِمِينَ. اللّهُمَّ، اجْعَلْ ما يُلْقِي الشَّيْطانُ فِي رَوْعي مِنَ التَّمَنِّي وَالتَّظَنِّي وَالْحَسَدِ ذِكْراً لِعَظَمَتِكَ، وَتَفَكُّراً فِي قُدْرَتِكَ، وَتَدْبِيراً عَلَى عَدُوِّكَ، وَما أَجْرَى عَلَى لِسانِي مِنْ لَفْظَةِ فُحْشٍ أَوْ هُجْرٍ أَوْ شَتْمِ عِرْضٍ، أَوْ شَهادَةِ باطِلٍ، أَوْ اغْتِيابِ مُؤْمِنٍ غائِبٍ أَوْ سَبِّ حاضِرٍ وَما أَشْبَهَ ذلِكَ، نُطْقاً بِالْحَمْدِ لَكَ، وَإِغْراقاً فِي الثَّناءِ عَلَيْكَ، وَذَهاباً فِي تَمْجِيدِكَ، وَشُكْراً لِنِعْمَتِكَ، وَاعْتِرافاً بِإِحْسانِكَ، وَإِحْصاءً لِمِنَنِكَ. اللّهُمَّ، صَلِّ عَلَى مُحَمَّدٍ وَآلِهِ، وَلا أُظْلَمَنَّ وَأَنْتَ مُطِيقٌ لِلدَّفْعِ عَنِّي، وَلا أَظْلِمَنَّ وَأَنْتَ الْقادِرُ عَلَى الْقَبْضِ مِنِّي، وَلا أَضِلَّنَّ وَقَدْ أَمْكَنَتْكَ هِدايَتِي، وَلا أَفْتَقِرَنَّ وَمِنْ عِنْدِكَ وُسْعِي، وَلا أَطْغَيَنَّ وَمِنْ عِنْدِكَ وُجْدِي. اللّهُمَّ، إِلَى مَغْفِرَتِكَ وَفَدْتُ، وَإِلَى عَفْوِكَ قَصَدْتُ، وَإِلَى تَجاوُزِكَ اشْتَقْتُ، وَبِفَضْلِكَ وَثِقْتُ، وَلَيْسَ عِنْدِي ما يُوجِبُ لِي مَغْفِرَتَكَ، وَلا فِي عَمَلِي ما أَسْتَحِقُّ بِهِ عَفْوَكَ، وَما لِي بَعْدَ أَنْ حَكَمْتُ عَلَى نَفْسِي إِلّا فَضْلُكَ، فَصَلِّ عَلَى مُحَمَّدٍ وَآلِهِ، وَتَفَضَّلْ عَلَيَّ. اللّهُمَّ، وَأَنْطِقْنِي بِالْهُدَى، وَأَلْهِمْنِي التَّقْوى، وَوَفّقْنِي لِلَّتِي هِيَ أَزْكَى، وَاسْتَعْمِلْنِي بِما هُوَ أَرْضَى. اللّهُمَّ، اسْلُكْ بِيَ الطَّرِيقَةَ الْمُثْلَى، وَاجْعَلْنِي عَلَى مِلَّتِكَ أَمُوتُ وَأَحْيا. اللّهُمَّ، صَلِّ عَلَى مُحَمَّدٍ وَآلِهِ، وَمَتِّعْنِي بِالْاقْتِصادِ، وَاجْعَلْنِي مِنْ أَهْلِ السَّدادِ، وَمِنْ أَدِلَّةِ الرَّشادِ، وَمِنْ صالِحِي الْعِبادِ، وَارْزُقْنِي فَوْزَ الْمَعادِ، وَسَلامَةَ الْمِرْصادِ. اللّهُمَّ، خُذْ لِنَفْسِكَ مِنْ نَفْسِي ما يُخَلِّصُها، وَأَبْقِ لِنَفْسِي مِنْ نَفْسِي ما يُصْلِحُها، فَإِنَّ نَفْسِي هالِكَةٌ أَوْ تَعْصِمَها. اللّهُمَّ، أَنْتَ عُدَّتِي إِنْ حَزِنْتُ، وَأَنْتَ مُنْتَجَعِي إِنْ حُرِمْتُ، وَبِكَ اسْتِغاثَتِي إِنْ كَرِثْتُ، وَعِنْدَكَ مِمَّا فاتَ خَلَفٌ، وَلِما فَسَدَ صَلاحٌ، وَفِيما أَنْكَرْتَ تَغْيِيرٌ، فَامْنُنْ عَلَيَّ قَبْلَ الْبَلاءِ بِالْعافِيَةِ، وَقَبْلَ الطَّلَبِ بِالجِدَةِ، وَقَبْلَ الضَّلالِ بِالرَّشادِ، وَاكْفِنِي مَؤُونَةَ مَعَرَّةِ الْعِبادِ، وَهَبْ لِي أَمْنَ يَوْمِ الْمَعادِ، وَامْنَحْنِي حُسْنَ الْإِرْشادِ. اللّهُمَّ، صَلِّ عَلَى مُحَمَّدٍ وَآلِهِ، وَادْرَأْ عَنِّي بِلُطْفِكَ، وَاغْذُنِي بِنِعْمَتِكَ، وَأَصْلِحْنِي بِكَرَمِكَ، وَداوِنِي بِصُنْعِكَ، وَأَظِلَّنِي فِي ذَراكَ، وَجَلِّلْنِي رِضاكَ، وَوَفِّقْنِي إِذا اشْتَكَلَتْ عَلَيَّ الأُمُورُ لأَهْداها، وَإِذا تَشابَهَتِ الْأَعْمالُ لأَزْكاها، وَإِذا تَناقَضَتِ الْمِلَلُ لأَرْضاها. اللّهُمَّ، صَلِّ عَلَى مُحَمَّدٍ وَآلِهِ، وَتَوِّجْنِي بِالْكِفايَةِ، وَسُمْنِي حُسْنَ الْوِلايَةِ، وَهَبْ لِي صِدْقَ الْهِدايَةِ، وَلا تَفْتِنِّي بِالسَّعَةِ، وَامْنَحْنِي حُسْنَ الدَّعَةِ، وَلا تَجْعَلْ عَيْشِي كَدّاً كَدّاً، وَلا تَرُدَّ دُعائِي عَلَيَّ رَدّاً، فَإِنِّي لا أَجْعَلُ لَكَ ضِدّاً، وَلا أَدْعُو مَعَكَ نِدّاً. اللّهُمَّ، صَلِّ عَلَى مُحَمَّدٍ وَآلِهِ، وَامْنَعْنِي مِنَ السَّرَفِ، وَحَصِّنْ رِزْقِي مِنَ التَّلَفِ، وَوَفِّرْ مَلَكَتِي بِالْبَرَكَةِ فِيهِ، وَأَصِبْ بِي سَبِيلَ الْهِدايَةِ لِلْبِرِّ فِيما أُنْفِقُ مِنْهُ. اللّهُمَّ، صَلِّ عَلَى مُحَمَّدٍ وَآلِهِ، وَاكْفِنِي مَؤُونَةَ الْاكْتِسابِ، وَارْزُقْنِي مِنْ غَيْرِ احْتِسابٍ، فَلا أَشْتَغِلَ عَنْ عِبادَتِكَ بِالطَّلَبِ، وَلا أَحْتَمِلَ إِصْرَ تَبِعاتِ الْمَكْسَبِ. اللّهُمَّ، فَاطْلُبْنِي بِقُدْرَتِكَ ما أَطْلُبُ، وَأَجِرْنِي بِعِزَّتِكَ مِمَّا أَرْهَبُ. اللّهُمَّ، صَلِّ عَلَى مُحَمَّدٍ وَآلِهِ، وَصُنْ وَجْهِي بِاليَسارِ، وَلا تَبْتَذِلْ جاهِي بِالْإِقْتارِ، فَأَسْتَرْزِقَ أَهْلَ رِزْقِكَ، وَأَسْتَعْطِيَ شِرارَ خَلْقِكَ، فَأَفْتَتِنَ بِحَمْدِ مَنْ أَعْطانِي، وَأُبْتَلَى بِذَمِّ مَنْ مَنَعَنِي، وَأَنْتَ مِنْ دُونِهِمْ وَلِيُّ الْإِعْطاءِ وَالْمَنْعِ. اللّهُمَّ، صَلِّ عَلَى مُحَمَّدٍ وَآلِهِ، وَارْزُقْنِي صِحَّةً فِي عِبادَةٍ، وَفَراغاً فِي زَهادَةٍ، وَعِلْماً فِي اسْتِعْمالٍ، وَوَرَعاً فِي إِجْمالٍ. اللّهُمَّ، اخْتِمْ بِعَفْوِكَ أَجَلِي، وَحَقِّقْ فِي رَجاءِ رَحْمَتِكَ أَمَلِي، وَسَهِّلْ إِلَى بُلُوغِ رِضاكَ سُبُلِي، وَحَسِّنْ فِي جَمِيعِ أَحْوالِي عَمَلِي. اللّهُمَّ، صَلِّ عَلَى مُحَمَّدٍ وَآلِهِ، وَنَبِّهْنِي لِذِكْرِكَ فِي أَوْقاتِ الْغَفْلَةِ، وَاسْتَعْمِلْنِي بِطاعَتِكَ فِي أَيَّامِ الْمُهْلَةِ، وَأَنْهِجْ لِي إِلَى مَحَبَّتِكَ سَبِيلاً سَهْلَةً، أَكْمِلْ لي بِها خَيْرَ الدُّنْيا وَالآخِرَةِ. اللّهُمَّ، صَلِّ عَلَى مُحَمَّدٍ وَآلِهِ، كَأَفْضَلِ ما صَلَّيْتَ عَلَى أَحَدٍ مِنْ خَلْقِكَ قَبْلَهُ، وَأَنْتَ مُصَلٍّ عَلَى أَحَدٍ بَعْدَهُ، وَآتِنا فِي الدُّنْيا حَسَنَةً، وَفِي الآخِرَةِ حَسَنَةً، وَقِنِي بِرَحْمَتِكَ عَذابَ النَّارِ.',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
            ],
          ),
        ),
        bottomNavigationBar: AddCustomBottomNavigationBar(
          pushNext: Dou3a2L2iftitah.screenRoute,
          pushBack: Altasbihat.screenRoute,
          soud: 'https://cdn.jsdelivr.net/gh/SounaDiab/image_audio@master/audio/دعاء مكارم الاخلاق.mp3',
          onTap: (double fontSize) {
            // تحديث حجم الخط
            setState(() {
              isTablet ? _fontSizeTablet = fontSize : _fontSize = fontSize;
            });
            print('fontSize: $fontSize');
            // إغلاق Dialog
            Navigator.of(context).pop();
          },
          onLongPress: () {
            final snackBar = SnackBar(
              content: Center(
                child: Text(
                  '${isTablet ? _fontSizeTablet.toInt() : _fontSize.toInt()}',
                  style: TextStyle(
                    color: Colors.white,
                    fontSize: 16,
                  ),
                ),
              ),
              width: 60,
              behavior: SnackBarBehavior.floating,
              backgroundColor: Colors.blue,
              duration: Duration(seconds: 2),
              shape: ShapeBorder.lerp(
                RoundedRectangleBorder(
                  borderRadius: BorderRadius.circular(50),
                ),
                RoundedRectangleBorder(
                  borderRadius: BorderRadius.circular(50),
                ),
                1,
              ),
            );
            ScaffoldMessenger.of(context).showSnackBar(snackBar);
          },
        ),
      ),
    );
  }
}
