import 'package:flutter/material.dart';
import 'package:maktabat_almoslim/screens/a3mal%20layali%20kadr/al2a3mal%20al3ama/dou3a2_alsalihin.dart';
import 'package:maktabat_almoslim/screens/a3mal%20layali%20kadr/al2a3mal%20al3ama/dou3a2_makarim_al2a5lak.dart';
import 'package:provider/provider.dart';
import 'package:shared_preferences/shared_preferences.dart';

import '../../../widgets/add_custom_bottom_navigation_bar.dart';
import '../../../widgets/container_scrollview.dart';
import '../../../widgets/list_of_nine_verses.dart';
import '../../favorites_provider.dart';
import '../../favorites_screen.dart';
import '../al2a3mal_al3ama.dart';

class Dou3a2L2iftitah extends StatefulWidget {
  static String screenRoute = 'dou3a2_l2iftitah_screen';
  const Dou3a2L2iftitah({super.key});

  @override
  State<Dou3a2L2iftitah> createState() => _Dou3a2L2iftitahState();
}

double _fontSize = 18;
double _fontSizeTablet = 30;

class _Dou3a2L2iftitahState extends State<Dou3a2L2iftitah> {
  bool isIcon = true;
  @override
  void initState() {
    super.initState();
    _loadFavoriteState();
  }

  Future<void> _loadFavoriteState() async {
    final prefs = await SharedPreferences.getInstance();
    bool? savedState = prefs.getBool('isFavorite_dou3a2_l2iftitah_screen');
    setState(() {
      isIcon = savedState ?? true;
    });
  }

  Future<void> _saveFavoriteState(bool value) async {
    final prefs = await SharedPreferences.getInstance();
    await prefs.setBool('isFavorite_dou3a2_l2iftitah_screen', value);
  }

    Future<bool> _onWillPop() async {
    final args =
        ModalRoute.of(context)!.settings.arguments as Map<String, dynamic>?;
    final previousPage = args?['previousPage'];
    if (previousPage == 'favorite_screen') {
      Navigator.of(context).pushReplacementNamed(FavoritesScreen.screenRoute);
      return false;
    } else {
      Navigator.of(context).pushReplacementNamed(Al2a3malAl3ama.screenRoute);
      return false;
    }
  }

  @override
  Widget build(BuildContext context) {
    double size = MediaQuery.of(context).textScaleFactor;
    final screenWidth = MediaQuery.of(context).size.width;
    final isTablet = screenWidth >= 600;
    return WillPopScope(
      onWillPop: _onWillPop,
      child: Scaffold(
        appBar: AppBar(
          toolbarHeight: isTablet ? 100 : 50,
          centerTitle: true,
          leading: IconButton(
            onPressed: _onWillPop,
            icon: Icon(
              Icons.arrow_back,
              size: isTablet ? 50 : 25,
            ),
          ),
          actions: [
            IconButton(
              padding: EdgeInsets.only(left: isTablet ? 50 : 30),
              icon: Icon(
                isIcon ? Icons.favorite_border : Icons.favorite_rounded,
                size: isTablet ? 40 : 25,
                color: isIcon ? Colors.black : Colors.red,
              ),
              onPressed: () async {
                setState(() {
                  isIcon = !isIcon;
                });
                await _saveFavoriteState(isIcon);
      
                if (!isIcon) {
                  Provider.of<FavoritesProvider>(context, listen: false)
                      .addFavorite('دعاء الإفتتاح', Dou3a2L2iftitah.screenRoute);
                } else {
                  Provider.of<FavoritesProvider>(context, listen: false)
                      .removeFavorite(
                          'دعاء الإفتتاح',
                          Dou3a2L2iftitah.screenRoute,
                          Dou3a2L2iftitah.screenRoute);
                }
              },
            ),
          ],
          title: Text(
            'دعاء الإفتتاح',
            style: TextStyle(
              fontSize: isTablet
                  ? 40
                  : size > 1.0
                      ? 20
                      : 23,
              fontWeight: FontWeight.bold,
            ),
          ),
        ),
        body: ContainerScrollview(
          widget: Column(
            crossAxisAlignment: CrossAxisAlignment.start,
            children: [
              Center(
                child: Text(
                  'بسم الله الرحمن الرحيم',
                  style: TextStyle(
                    fontSize: isTablet ? _fontSizeTablet + 10 : _fontSize,
                    fontWeight: FontWeight.w900,
                  ),
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: '',
                  subtitle:
                      'اَللّـهُمَّ اِنّي اَفْتَتِحُ الثَّناءَ بِحَمْدِكَ، وَاَنْتَ مُسَدِّدٌ لِلصَّوابِ بِمَّنِكَ، وَاَيْقَنْتُ اَنَّكَ اَنْتَ اَرْحَمُ الرّاحِمينَ في مَوْضِعِ الْعَفْوِ وَالرَّحْمَةِ، وَاَشَدُّ الْمُعاقِبينَ في مَوْضِعِ النَّكالِ وَالنَّقِمَةِ، وَاَعْظَمُ الْمُتَجَبِّرِينَ في مَوْضِعِ الْكِبْرياءِ وَالْعَظَمَةِ، اَللّـهُمَّ اَذِنْتَ لي في دُعائِكَ وَمَسْأَلَتِكَ فَاسْمَعْ يا سَميعُ مِدْحَتي، وَاَجِبْ يا رَحيمُ دَعْوَتي، وَاَقِلْ يا غَفُورُ عَثْرَتي، فَكَمْ يا اِلهي مِنْ كُرْبَة قَدْ فَرَّجْتَها وَهُمُوم قَدْ كَشَفْتَها، وَعَثْرَة قَدْ اَقَلْتَها، وَرَحْمَة قَدْ نَشَرْتَها، وَحَلْقَةِ بَلاء قَدْ فَكَكْتَها، اَلْحَمْدُ للهِ الَّذي لَمْ يَتَّخِذْ صاحِبَةً وَلا وَلَداً، وَلَمْ يَكُنْ لَهُ شَريكٌ في الْمُلْكِ، وَلَمْ يَكُنْ لَهُ وَلِىٌّ مِنَ الذُّلِّ وَكَبِّرْهُ تَكْبيراً، اَلْحَمْدُ للهِ بِجَميعِ مَحامِدِهِ كُلِّهَا، عَلى جَميعِ نِعَمِهِ كُلِّها اَلْحَمْدُ للهِ الَّذي لا مُضادَّ لَهُ في مُلْكِهِ، وَلا مُنازِعَ لَهُ في اَمْرِهِ، اَلْحَمْدُ للهِ الَّذي لا شَريكَ لَهُ في خَلْقِهِ، وَلا شَبيهَ لَهُ في عَظَمَتِهِ، اَلْحَمْدُ للهِ الْفاشي في الْخَلْقِ اَمْرُهُ وَحَمْدُهُ، الظّاهِرِ بِالْكَرَمِ مَجْدُهُ، الْباسِطِ بِالْجُودِ يَدَهُ، الَّذي لا تَنْقُصُ خَزائِنُهُ، وَلا تَزيدُهُ كَثْرَةُ الْعَطاءِ إلاّ جُوداً وَكَرَماً، اِنَّهُ هُوَ الْعَزيزُ الْوَهّابُ، اَللّـهُمَّ اِنّي اَسْاَلُكَ قَليلاً مِنْ كَثير، مَعَ حاجَة بي اِلَيْهِ عَظيمَة وَغِناكَ عَنْهُ قَديمٌ، وَهُوَ عِنْدي كَثيرٌ، وَهُوَ عَلَيْكَ سَهْلٌ يَسيرٌ، اَللّـهُمَّ اِنَّ عَفْوَكَ عَنْ ذَنْبي، وَتَجاوُزَكَ عَنْ خَطيـئَتي، وَصَفْحَكَ عَنْ ظُلْمي وَسِتْرَكَ عَنْ قَبيحِ عَمَلي، وَحِلْمَكَ عَنْ كَثيرِ جُرْمي، عِنْدَ ما كانَ مِنْ خَطئي وَعَمْدي، اَطْمَعَني في اَنْ اَسْأَلَكَ ما لا اَسْتَوْجِبُهُ مِنْكَ، الَّذي رَزَقْتَني مِنْ رَحْمَتِكَ، وَاَرَيْتَني مَنْ قُدْرَتِكَ، وَعَرَّفْتَني مِنْ اِجابَتِكَ، فَصِرْتُ اَدْعُوكَ آمِناً، وَاَسْاَلُكَ مُسْتَأنِساً، لا خائِفاً وَلا وَجِلاً، مُدِلاًّ عَلَيْكَ فيـما قَصَدْتُ فيهِ اِلَيْكَ، فَاِنْ اَبْطأَ عَنّي عَتَبْتُ بِجَهْلي عَلَيْكَ، وَلَعَلَّ الَّذي اَبْطأَ عَنّي هُوَ خَيْرٌ لي لِعِلْمِكَ بِعاقِبَةِ الاُْمُورِ، فَلَمْ اَرَ مَوْلاً كَريماً اَصْبَرَ عَلى عَبْد لَئيم مِنْكَ عَلَيَّ يا رَبِّ، اِنَّكَ تَدْعُوني فَاُوَلّي عَنْكَ، وَتَتَحَبَّبُ اِلَيَّ فَاَتَبَغَّضُ اِلَيْكَ، وَتَتَوَدَّدُ اِلَىَّ فَلا اَقْبَلُ مِنْكَ، كَاَنَّ لِيَ التَّطَوُّلَ عَلَيْكَ، فَلَمْ يَمْنَعْكَ ذلِكَ مِنَ الرَّحْمَةِ لي، وَالاِْحْسانِ اِلَىَّ، وَالتَّفَضُّلِ عَلَيَّ بِجُودِكَ وَكَرَمِكَ، فَارْحَمْ عَبْدَكَ الْجاهِلَ وَجُدْ عَلَيْهِ بِفَضْلِ اِحْسانِكَ اِنَّكَ جَوادٌ كَريمٌ، اَلْحَمْدُ للهِ مالِكِ الْمُلْكِ، مُجْرِي الْفُلْكِ، مُسَخِّرِ الرِّياحِ، فالِقِ الاِْصْباحِ، دَيّانِ الدّينِ، رَبِّ الْعَالَمينَ، اَلْحَمْدُ للهِ عَلى حِلْمِهِ بَعْدَ عِلمِهِ، وَالْحَمْدُ للهِ عَلى عَفْوِهِ بَعْدَ قُدْرَتِهِ، وَالْحَمْدُ للهِ عَلى طُولِ اَناتِهِ في غَضَبِهِ، وَهُوَ قادِرٌ عَلى ما يُريدُ، اَلْحَمْدُ للهِ خالِقِ الْخَلْقِ، باسِطِ الرِّزْقِ، فاِلقِ اَلاِْصْباحِ ذِي الْجَلالِ وَالاِْكْرامِ وَالْفَضْلِ وَالاِْنْعامِ، الَّذي بَعُدَ فَلا يُرى، وَقَرُبَ فَشَهِدَ النَّجْوى تَبارَكَ وَتَعالى، اَلْحَمْدُ للهِ الَّذي لَيْسَ لَهُ مُنازِعٌ يُعادِلُهُ، وَلا شَبيهٌ يُشاكِلُهُ، وَلا ظَهيرٌ يُعاضِدُهُ قَهَرَ بِعِزَّتِهِ الاَْعِزّاءَ، وَتَواضَعَ لِعَظَمَتِهِ الْعُظَماءُ، فَبَلَغَ بِقُدْرَتِهِ ما يَشاءُ، اَلْحَمْدُ للهِ الَّذي يُجيبُني حينَ اُناديهِ، وَيَسْتُرُ عَلَيَّ كُلَّ عَورَة وَاَنَا اَعْصيهِ، وَيُعَظِّمُ الْنِّعْمَةَ عَلَىَّ فَلا اُجازيهِ، فَكَمْ مِنْ مَوْهِبَة هَنيئَة قَدْ اَعْطاني، وَعَظيمَة مَخُوفَة قَدْ كَفاني، وَبَهْجَة مُونِقَة قَدْ اَراني، فَاُثْني عَلَيْهِ حامِداً، وَاَذْكُرُهُ مُسَبِّحاً، اَلْحَمْدُ للهِ الَّذي لا يُهْتَكُ حِجابُهُ، وَلا يُغْلَقُ بابُهُ، وَلا يُرَدُّ سائِلُهُ، وَلا يُخَيَّبُ آمِلُهُ، اَلْحَمْدُ للهِ الَّذي يُؤْمِنُ الْخائِفينَ، وَيُنَجِّى الصّالِحينَ، وَيَرْفَعُ الْمُسْتَضْعَفينَ، وَيَضَعُ الْمُسْتَكْبِرينَ،يُهْلِكُ مُلُوكاً وَيَسْتَخْلِفُ آخَرينِ، وَالْحَمْدُ للهِ قاِصمِ الجَّبارينَ، مُبيرِ الظّالِمينَ، مُدْرِكِ الْهارِبينَ، نَكالِ الظّالِمينَ صَريخِ الْمُسْتَصْرِخينَ، مَوْضِعِ حاجاتِ الطّالِبينَ، مُعْتَمَدِ الْمُؤْمِنينَ، اَلْحَمْدُ للهِ الَّذي مِنْ خَشْيَتِهِ تَرْعَدُ السَّماء  وَسُكّانُها، وَتَرْجُفُ الاَْرْضُ وَعُمّارُها، وَتَمُوجُ الْبِحارُ وَمَنْ يَسْبَحُ في غَمَراتِها، اَلْحَمْدُ للهِ الَّذي هَدانا لِهذا وَما كُنّا لِنَهْتَدِيَ لَوْلا اَنْ هَدانَا اللّهُ، اَلْحَمْدُ للهِ الَّذي يَخْلُقُ، وَلَمْ يُخْلَقْ وَيَرْزُقُ، وَلا يُرْزَقُ وَيُطْعِمُ، وَلا يُطْعَمُ وَيُميتُ الاَْحياءَ وَيُحْيِي الْمَوْتى وَهُوَ حَيٌّ لا يَمُوتُ، بِيَدِهِ الْخَيْرُ وَهُوَ عَلى كُلِّ شَيْء قَديرٌ، اَللّـهُمَّ صَلِّ عَلى مُحَمَّد عَبْدِكَ وَرَسُولِكَ، وَاَمينِكَ، وَصَفِيِّكَ، وَحَبيبِكَ، وَخِيَرَتِكَ مَنْ خَلْقِكَ، وَحافِظِ سِرِّكَ، وَمُبَلِّغِ رِسالاتِكَ، اَفْضَلَ وَاَحْسَنَ، وَاَجْمَلَ وَاَكْمَلَ، وَاَزْكى وَاَنْمى، وَاَطْيَبَ وَاَطْهَرَ، وَاَسْنى وَاَكْثَرَ ما صَلَّيْتَ وَبارَكْتَ وَتَرَحَّمْتَ، وَتَحَنَّنْتَ وَسَلَّمْتَ عَلى اَحَد مِن عِبادِكَ وَاَنْبِيائِكَ وَرُسُلِكَ، وَصِفْوَتِكَ وَاَهْلِ الْكَرامَةِ عَلَيْكَ مِن خَلْقِكَ، اَللّـهُمَّ وَصَلِّ عَلى عَليٍّ اَميرِ الْمُؤْمِنينَ، وَوَصِيِّ رَسُولِ رَبِّ الْعالَمينَ، عَبْدِكَ وَوَليِّكَ، وَاَخي رَسُولِكَ، وَحُجَّتِكَ عَلى خَلْقِكَ، وَآيَتِكَ الْكُبْرى، وَالنَّبأِ الْعَظيمِ، وَصَلِّ عَلَى الصِّدّيقَةِ الطّاهِرَةِ فاطِمَةَ سَيِّدَةِ نِساءِ الْعالَمينَ، وَصَلِّ عَلى سِبْطَيِ الرَّحْمَةِ وَاِمامَيِ الْهُدى، الْحَسَنِ وَالْحُسَيْنِ سَيِّدَيْ شَبابِ اَهْلِ الْجَّنَةِ، وَصَلِّ عَلى اَئِمَّةِ الْمُسْلِمينَ، عَلِيِّ بْنِ الْحُسَيْنِ، وَمُحَمَّدِ ابْنِ عَلِيٍّ، وَجَعْفَرِ بْنِ مُحَمَّد، وَمُوسَى بْنِ جَعْفَر، وَعَلِيِّ بْنِ مُوسى، وَمُحَمَّدِ بْنِ عَلِيٍّ، وَعَلِيِّ بْنِ مُحَمَّد، وَالْحَسَنِ بْنِ عَلِىٍّ، وَالْخَلَفِ الْهادي الْمَهْدِيِّ، حُجَجِكَ عَلى عِبادِكَ، وَاُمَنائِكَ في بِلادِكَ صَلَاةً كَثيرَةً دائِمَةً اَللّـهُمَّ وَصَلِّ عَلى وَلِىِّ اَمْرِكَ الْقائِمِ الْمُؤَمَّلِ، وَالْعَدْلِ الْمُنْتَظَرِ، وَحُفَّهُ بِمَلائِكَتِكَ الْمُقَرَّبينَ، وَاَيِّدْهُ بِرُوحِ الْقُدُسِ يا رَبَّ الْعالَمينَ، اَللّـهُمَّ اجْعَلْهُ الدّاعِيَ اِلى كِتابِكَ، وَالْقائِمَ بِدينِكَ، اِسْتَخْلِفْهُ في الاَْرْضِ كَما اسْتَخْلَفْتَ الَّذينَ مِنْ قَبْلِهِ، مَكِّنْ لَهُ دينَهُ الَّذي ارْتَضَيْتَهُ لَهُ، اَبْدِلْهُ مِنْ بَعْدِ خَوْفِهِ اَمْناً يَعْبُدُكَ لا يُشْرِكُ بِكَ شَيْئاً، اَللّـهُمَّ اَعِزَّهُ وَاَعْزِزْ بِهِ، وَانْصُرْهُ وَانْتَصِرْ بِهِ، وَانْصُرْهُ نَصْراً عَزيزاً، وَاْفتَحْ لَهُ فَتْحاً يَسيراً، وَاجْعَلْ لَهُ مِنْ لَدُنْكَ سُلْطاناً نَصيراً، اَللّـهُمَّ اَظْهِرْ بِهِ دينَكَ، وَسُنَّةَ نَبِيِّكَ، حَتّى لا يَسْتَخْفِيَ بِشَىْء مِنَ الْحَقِّ، مَخافَةَ اَحَد مِنَ الْخَلْقِ اَللّـهُمَّ اِنّا نَرْغَبُ اِلَيْكَ في دَوْلَة كَريمَة تُعِزُّ بِهَا الاِْسْلامَ وَاَهْلَهُ، وَتُذِلُّ بِهَا النِّفاقَ وَاَهْلَهُ، وَتَجْعَلُنا فيها مِنَ الدُّعاةِ اِلى طاعَتِكَ، وَالْقادَةِ اِلى سَبيلِكَ، وَتَرْزُقُنا بِها كَرامَةَ الدُّنْيا وَالاْخِرَةِ، اَللّـهُمَّ ما عَرَّفْتَنا مِن الْحَقِّ فَحَمِّلْناهُ، وَما قَصُرْنا عَنْهُ فَبَلِّغْناهُ، اَللّـهُمَّ الْمُمْ بِهِ شَعَثَنا، وَاشْعَبْ بِهِ صَدْعَنا، وَارْتُقْ بِهِ فَتْقَنا، وَكَثِّرْبِهِ قِلَّتَنا، وَاَعْزِزْ بِهِ ذِلَّتَنا، وَاَغْنِ بِهِ عائِلَنا، وَاَقْضِ بِهِ عَنْ مَغْرَمِنا، وَاجْبُرْبِهِ فَقْرَنا، وَسُدَّ بِهِ خَلَّتَنا، وَيَسِّرْ بِهِ عُسْرَنا، وَبَيِّضْ بِهِ وُجُوهَنا، وَفُكَّ بِهِ اَسْرَنا، وَاَنْجِحْ بِهِ طَلِبَتَنا، وَاَنْجِزْ بِهِ مَواعيدَنا، وَاسْتَجِبْ بِهِ دَعْوَتَنا، وَاَعْطِنا بِهِ سُؤْلَنا، وَبَلِّغْنا بِهِ مِنَ الدُّنْيا وَالاْخِرَةِ آمالَنا، وَاَعْطِنا بِهِ فَوْقَ رَغْبَتِنا، يا خَيْرَ الْمَسْؤولينَ وَاَوْسَعَ الْمُعْطينَ، اِشْفِ بِهِ صُدُورَنا، وَاَذْهِبْ بِهِ غَيْظَ قُلُوبِنا، وَاهْدِنا بِهِ لِمَا اخْتُلِفَ فيهِ مِنَ الْحَقِّ بِاِذْنِكَ، اِنَّكَ تَهْدي مَنْ تَشاءُ اِلى صِراط مُسْتَقيم، وَانْصُرْنا بِهِ عَلى عَدُوِّكَ وَعَدُوِّنا اِلـهَ الْحَقِّ آمينَ، اَللّـهُمَّ اِنّا نَشْكُو اِلَيْكَ فَقْدَ نَبِيِّنا صَلَواتُكَ عَلَيْهِ وَآلِهِ، وَغَيْبَةَ وَلِيِّنا، وَكَثْرَةَ عَدُوِّنا، وَقِلَّةَ عَدَدِنا، وَشِدّةَ الْفِتَنِ بِنا، وَتَظاهُرَ الزَّمانِ عَلَيْنا، فَصَلِّ عَلى مُحَمَّد وَآلِهِ، وَاَعِنّا عَلى ذلِكَ بِفَتْح مِنْكَ تُعَجِّلُهُ، وَبِضُرٍّ تَكْشِفُهُ، وَنَصْر تُعِزُّهُ وَسُلْطانِ حَقٍّ تُظْهِرُهُ، وَرَحْمَة مِنْكَ تَجَلِّلُناها وَعافِيَة مِنْكَ تُلْبِسُناها، بِرَحْمَتِكَ يا اَرْحَمَ الرّاحِمينَ.',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
            ],
          ),
        ),
        bottomNavigationBar: AddCustomBottomNavigationBar(
          pushNext: Dou3a2Alsalihin.screenRoute,
          pushBack: Dou3a2MakarimAl2a5lak.screenRoute,
          soud: 'دعاء الافتتاح.mp3',
          onTap: (double fontSize) {
            // تحديث حجم الخط
            setState(() {
              isTablet ? _fontSizeTablet = fontSize : _fontSize = fontSize;
            });
            print('fontSize: $fontSize');
            // إغلاق Dialog
            Navigator.of(context).pop();
          },
          onLongPress: () {
            final snackBar = SnackBar(
              content: Center(
                child: Text(
                  '${isTablet ? _fontSizeTablet.toInt() : _fontSize.toInt()}',
                  style: TextStyle(
                    color: Colors.white,
                    fontSize: 16,
                  ),
                ),
              ),
              width: 60,
              behavior: SnackBarBehavior.floating,
              backgroundColor: Colors.blue,
              duration: Duration(seconds: 2),
              shape: ShapeBorder.lerp(
                RoundedRectangleBorder(
                  borderRadius: BorderRadius.circular(50),
                ),
                RoundedRectangleBorder(
                  borderRadius: BorderRadius.circular(50),
                ),
                1,
              ),
            );
            ScaffoldMessenger.of(context).showSnackBar(snackBar);
          },
        ),
      ),
    );
  }
}
