import 'package:flutter/material.dart';
import 'package:provider/provider.dart';
import 'package:shared_preferences/shared_preferences.dart';

import '../../../widgets/add_custom_bottom_navigation_bar.dart';
import '../../../widgets/container_scrollview.dart';
import '../../../widgets/list_of_nine_verses.dart';
import '../../favorites_provider.dart';
import '../../favorites_screen.dart';
import '../fi_a3mal_ashar_ramadan.dart';
import 'dou3a2_alsa7ar.dart';
import 'fi_2a3mal_2as7ar_ramadan.dart';

class Dou3a2Abi7amzaAlsamali extends StatefulWidget {
  static String screenRoute = 'dou3a2_abi_7amza_alsamali_screen';
  const Dou3a2Abi7amzaAlsamali({super.key});

  @override
  State<Dou3a2Abi7amzaAlsamali> createState() => _Dou3a2Abi7amzaAlsamaliState();
}

double _fontSize = 18;
double _fontSizeTablet = 30;

class _Dou3a2Abi7amzaAlsamaliState extends State<Dou3a2Abi7amzaAlsamali> {
  bool isIcon = true;
  @override
  void initState() {
    super.initState();
    _loadFavoriteState();
  }

  Future<void> _loadFavoriteState() async {
    final prefs = await SharedPreferences.getInstance();
    bool? savedState =
        prefs.getBool('isFavorite_dou3a2_abi_7amza_alsamali_screen');
    setState(() {
      isIcon = savedState ?? true;
    });
  }

  Future<void> _saveFavoriteState(bool value) async {
    final prefs = await SharedPreferences.getInstance();
    await prefs.setBool('isFavorite_dou3a2_abi_7amza_alsamali_screen', value);
  }

  Future<bool> _onWillPop() async {
    final args =
        ModalRoute.of(context)!.settings.arguments as Map<String, dynamic>?;
    final previousPage = args?['previousPage'];
    if (previousPage == 'favorite_screen') {
      Navigator.of(context).pushReplacementNamed(FavoritesScreen.screenRoute);
      return false;
    } else {
      Navigator.of(context)
          .pushReplacementNamed(FiA3malAsharRamadan.screenRoute);
      return false;
    }
  }

  @override
  Widget build(BuildContext context) {
    double size = MediaQuery.of(context).textScaleFactor;
    final screenWidth = MediaQuery.of(context).size.width;
    final isTablet = screenWidth >= 600;
    return WillPopScope(
      onWillPop: _onWillPop,
      child: Scaffold(
        appBar: AppBar(
          toolbarHeight: isTablet ? 100 : 50,
          centerTitle: true,
          leading: IconButton(
            onPressed: _onWillPop,
            icon: Icon(
              Icons.arrow_back,
              size: isTablet ? 50 : 25,
            ),
          ),
          actions: [
            IconButton(
              padding: EdgeInsets.only(left: isTablet ? 50 : 30),
              icon: Icon(
                isIcon ? Icons.favorite_border : Icons.favorite_rounded,
                size: isTablet ? 40 : 25,
                color: isIcon ? Colors.black : Colors.red,
              ),
              onPressed: () async {
                setState(() {
                  isIcon = !isIcon;
                });
                await _saveFavoriteState(isIcon);
      
                if (!isIcon) {
                  Provider.of<FavoritesProvider>(context, listen: false)
                      .addFavorite('دعاء ابي حمزة الثمالي',
                          Dou3a2Abi7amzaAlsamali.screenRoute);
                } else {
                  Provider.of<FavoritesProvider>(context, listen: false)
                      .removeFavorite(
                          'دعاء ابي حمزة الثمالي',
                          Dou3a2Abi7amzaAlsamali.screenRoute,
                          Dou3a2Abi7amzaAlsamali.screenRoute);
                }
              },
            ),
          ],
          title: Text(
            'دعاء ابي حمزة الثمالي',
            style: TextStyle(
              fontSize: isTablet
                  ? 40
                  : size > 1.0
                      ? 20
                      : 23,
              fontWeight: FontWeight.bold,
            ),
          ),
        ),
        body: ContainerScrollview(
          widget: Column(
            crossAxisAlignment: CrossAxisAlignment.start,
            children: [
              Center(
                child: Text(
                  'بسم الله الرحمن الرحيم',
                  style: TextStyle(
                    fontSize: isTablet ? _fontSizeTablet + 10 : _fontSize,
                    fontWeight: FontWeight.w900,
                  ),
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: '',
                  subtitle:
                      'إِلهِي، لا تُؤَدّبْنِي بِعُقُوبَتِكَ، وَلا تَمْكُرْ بِي فِي حِيلَتِكَ، مِنْ أَيْنَ لِيَ الْخَيْرُ يا رَبّ وَلا يُوجَدُ إِلّا مِنْ عِنْدِكَ، وَمِنْ أَيْنَ لِيَ النَّجاةُ وَلا تُسْتَطاعُ إِلّا بِكَ. لا الَّذِي أَحْسَنَ اسْتَغْنَى عَنْ عَوْنِكَ وَرَحْمَتِكَ، وَلا الَّذِي أَساءَ وَاجْتَرَأَ عَلَيْكَ وَلَمْ يُرْضِكَ خَرَجَ عَنْ قُدْرَتِكَ، يا رَبّ يا رَبّ يا رَبّ (حتى ينقطع النفس)، بِكَ عَرَفْتُكَ وَأَنْتَ دَلَلْتَنِي عَلَيْكَ، وَدَعَوْتَنِي إِلَيْكَ، وَلَوْلا أَنْتَ لَمْ أَدْرِ ما أَنْتَ. الْحَمْدُ لِلَّهِ الَّذِي أَدْعُوهُ فَيُجِيبُنِي، وَإِنْ كُنْتُ بَطِيئاً حِينَ يَدْعُونِي، وَالْحَمْدُ لِلَّهِ الَّذِي أَسْأَلُهُ فَيُعْطِينِي، وَإِنْ كُنْتُ بَخِيلاً حِينَ يَسْتَقْرِضُنِي، وَالْحَمْدُ لِلَّهِ الَّذِي أُنادِيهِ كُلَّما شِئْتُ لِحاجَتِي، وَأَخْلُو بِهِ حَيْثُ شِئْتُ لِسِرّي، بِغَيْرِ شَفِيعٍ فَيَقْضِي لِي حاجَتِي. الْحَمْدُ لِلَّهِ الَّذِي لا أَدْعُو غَيْرَهُ، وَلَوْ دَعَوْتُ غَيْرَهُ لَمْ يَسْتَجِبْ لِي دُعائِي. وَالْحَمْدُ لِلَّهِ الَّذِي لا أَرْجُو غَيْرَهُ، وَلَوْ رَجَوْتُ غَيْرَهُ لأَخْلَفَ رَجائِي. وَالْحَمْدُ لِلَّهِ الَّذِي وَكَلَنِي إِلَيْهِ فَأَكْرَمَنِي، وَلَمْ يَكِلْنِي إِلَى النَّاسِ فَيُهِينُونِي. وَالْحَمْدُ لِلَّهِ الَّذِي تَحَبَّبَ إِلَيَّ وَهُوَ غَنِيٌّ عَنّي. وَالْحَمْدُ لِلَّهِ الَّذِي يَحْلُمُ عَنِّي، حَتَّى كَأَنّي لا ذَنْبَ لِي، فَرَبّي أَحْمَدُ شَيْءٍ عِنْدِي وَأَحَقُّ بِحَمْدِي. اللّهُمَّ، إِنّي أَجِدُ سُبُلَ الْمَطالِبِ إِلَيْكَ مُشْرَعَةً، وَمَناهِلَ الرَّجاءِ إليك (لَدَيْكَ) مُتْرَعَةً، وَالْاسْتِعانَةَ بِفَضْلِكَ لِمَنْ أَمَّلَكَ مُباحَةً، وَأَبْوابَ الدُّعَاءِ إِلَيْكَ لِلصَّارِخِينَ مَفْتُوحَةً، وَأَعْلَمُ أَنَّكَ لِلرَّاجِينَ بِمَوْضِعِ إِجابَةٍ، وَلِلْمَلْهُوفِينَ بِمَرْصَدِ إِغاثَةٍ، وَأَنَّ فِي اللهْفِ إِلَى جُودِكَ وَالرّضا بِقَضائِكَ عِوَضاً مِنْ مَنْعِ الْباخِلِينَ، وَمَنْدُوحَةً عَمَّا فِي أَيْدِي المُسْتَأْثِرِينَ، وَأَنَّ الرَّاحِلَ إِلَيْكَ قَرِيبُ الْمَسافَةِ، وَأَنَّكَ لا تَحْتَجِبُ عَنْ خَلْقِكَ، إِلّا أَنْ تَحْجُبَهُمُ الْأَعْمالُ (الآمَالُ) دُونَكَ. وَقَدْ قَصَدْتُ إِلَيْكَ بِطَلِبَتِي، وَتَوَجَّهْتُ إِلَيْكَ بِحاجَتِي، وَجَعَلْتُ بِكَ اسْتِغاثَتِي، وَبِدُعائِكَ تَوَسُّلِي، مِنْ غَيْرِ اسْتِحْقاقٍ لاِسْتِماعِكَ مِنِّي، وَلا اسْتِيجابٍ لِعَفْوِكَ عَنّي؛'
                      'بَلْ لِثِقَتِي بِكَرَمِكَ، وَسُكُونِي إِلَى صِدْقِ وَعْدِكَ، وَلَجَئي إِلَى الْإِيْمانِ بِتَوْحِيدِكَ، وَيَقِينِي (وَثِقَتِي) بِمَعْرِفَتِكَ مِنِّي، أَنْ لا رَبَّ لِي غَيْرُكَ، وَلا إِلهَ (لِي) إِلّا أَنْتَ، وَحْدَكَ لا شَرِيكَ لَكَ. اللّهُمَّ، أَنْتَ الْقائِلُ وَقَوْلُكَ حَقٌّ، وَوْعْدُكَ صِدْقٌ (الصِّدْقُ)، وَاسْأَلُوا اللهَ مِنْ فَضْلِهِ، إِنَّ اللهَ كانَ بِكُمْ رَحِيماً. وَلَيْسَ مِنْ صِفاتِكَ يا سَيِّدِي، أَنْ تَأْمُرَ بِالسُّؤالِ، وَتَمْنَعَ الْعَطِيَّةَ، وَأَنْتَ الْمَنَّانُ بِالْعَطِيَّاتِ عَلَى أَهْلِ مَمْلَكَتِكَ، وَالْعائِدُ عَلَيْهِمْ بِتَحَنُّنِ رَأْفَتِكَ (بِحُسْنِ نِعْمَتِكَ). إِلهِي، رَبَّيْتَنِي فِي نِعَمِكَ وَإِحْسانِكَ صَغِيراً، وَنَوَّهْتَ بِاسْمِي كَبِيراً، فَيا مَنْ رَبَّانِي فِي الدُّنْيا بِإِحْسانِهِ وَتَفَضُّلِهِ (وَبِفَضْلِهِ) وَنِعَمِهِ، وَأَشارَ لِي فِي الآخِرَةِ إِلَى عَفْوِهِ وَكَرَمِهِ. مَعْرِفَتِي يا مَوْلايَ دَلِيلِي (دَلَّتْنِي) عَلَيْكَ، وَحُبِّي لَكَ شَفِيعِي إِلَيْكَ، وَأَنَا وَاثِقٌ مِنْ دَلِيلِي بِدَلالَتِكَ، وَساكِنٌ مِنْ شَفِيعِي إِلَى شَفاعَتِكَ. أَدْعُوكَ، يا سَيِّدِي، بِلِسانٍ قَدْ أَخْرَسَهُ ذَنْبُهُ. رَبِّ أُناجِيكَ بِقَلْبٍ قَدْ أَوْبَقَه جُرْمُهُ.'
                      'أَدْعُوكَ يا رَبِّ، راهِباً، راغِباً، راجِياً، خائِفاً. إِذَا رَأَيْتُ، مَوْلايَ، ذُنُوبِي فَزِعْتُ، وَإِذَا رَأَيْتُ كَرَمَكَ طَمِعْتُ، فَإِنْ عَفَوْتَ (غَفَرْتَ) فَخَيْرُ راحِمٍ، وَإِنْ عَذَّبْتَ فَغَيْرُ ظالِمٍ. حُجَّتِي يا اللهُ فِي جُرْأَتِي عَلَى مَسْأَلَتِكَ، مَعَ إِتْيانِي ما تَكْرَهُ، جُودُكَ وَكَرَمُكَ، وَعُدَّتِي فِي شِدَّتِي، مَعَ قِلَّةِ حَيائِي، رَأْفَتُكَ وَرَحْمَتُكَ. وَقَدْ رَجَوْتُ أَنْ لا تَخِيبَ بَيْنَ ذَيْنِ وَذَيْنِ مُنْيَتِي، فَحَقِّقْ رَجائِي، وَاسْمَعْ دُعائِي، يا خَيْرَ مَنْ دَعاهُ داعٍ، وَأَفْضَلَ مَنْ رَجاهُ راجٍ. عَظُمَ يا سَيِّدِي أَمَلِي، وَساءَ عَمَلِي، فَأَعْطِني مِنْ عَفْوِكَ بِمِقْدَارِ أَمَلِي، وَلا تُؤاخِذْنِي بِأَسْوَإِ عَمَلِي، فَإِنَّ كَرَمَكَ يَجِلُّ عَنْ مُجازاةِ الْمُذْنِبِينَ، وَحِلْمَكَ يَكْبُرُ عَنْ مُكافأَةِ الْمُقَصِّرِينَ، وَأَنَا يا سَيِّدِي عائِذٌ بِفَضْلِكَ، هارِبٌ مِنْكَ إِلَيْكَ، مُتَنَجِّزٌ ما وَعَدْتَ مِنَ الصَّفْحِ عَمَّنْ أَحْسَنَ بِكَ ظَنَّاً.'
                      'وَما أَنَا يا رَبِّ وَما خَطَرِي، هَبْنِي بِفَضْلِكَ، وَتَصَدَّقْ عَلَيَّ بِعَفْوِكَ، أَيْ رَبِّ، جَلِّلْنِي بِسِتْرِكَ، وَاعْفُ عَنْ تَوْبِيخِي بِكَرَمِ وَجْهِكَ، فَلَوِ اطَّلَعَ الْيَوْمَ عَلَى ذَنْبِي غَيْرُكَ ما فَعَلْتُهُ، وَلَوْ خِفْتُ تَعْجِيلَ الْعُقُوبَةِ لَاجْتَنَبْتُهُ، لا لأَنَّكَ أَهْوَنُ النَّاظِرِينَ (إِلَيَّ)، وَأَخَفُّ الْمُطَّلِعِينَ (عَلَيَّ)، بَلْ لأَنَّكَ، يا رَبِّ، خَيْرُ السَّاتِرِينَ، وَأَحْكَمُ الْحاكِمِينَ، (وَأَحْلَمُ الأَحْلَمِينَ)، وَأَكْرَمُ الْأَكْرَمِينَ، سَتَّارُ الْعُيُوبِ، غَفَّارُ الذُّنُوبِ، عَلّامُ الْغُيُوبِ، تَسْتُرُ الذَّنْبَ بِكَرَمِكَ، وَتُؤَخّرُ الْعُقُوبَةَ بِحِلْمِكَ، فَلَكَ الْحَمْدُ عَلَى حِلْمِكَ بَعْدَ عِلْمِكَ، وَعَلَى عَفْوِكَ بَعْدَ قُدْرَتِكَ. وَيَحْمِلُنِي وَيُجَرِّئُنِي عَلَى مَعْصِيَتِكَ، حِلْمُكَ عَنِّي، وَيَدْعُونِي إِلَى قِلَّةِ الْحَياءِ سَتْرُكَ عَلَيَّ، وَيُسْرِعُنِي إِلَى التَّوَثُّبِ عَلَى مَحارِمِكَ مَعْرِفَتِي بِسَعَةِ رَحْمَتِكَ، وَعَظِيمِ عَفْوِكَ. يا حَلِيمُ، يا كَرِيمُ، يا حَيُّ، يا قَيُّومُ، يا غافِرَ الذَّنْبِ، يا قابِلَ التَّوْبِ، يا عَظِيمَ الْمَنِّ، يا قَدِيمَ الْإِحْسانِ. أَيْنَ سَتْرُكَ الْجَمِيلُ، أَيْنَ عَفْوُكَ الْجَلِيلُ، أَيْنَ فَرَجُكَ الْقَرِيبُ، أَيْنَ غِياثُكَ السَّرِيعُ، أَيْنَ رَحْمَتُكَ الْواسِعَةُ، أَيْنَ عَطاياكَ الْفاضِلَةُ، أَيْنَ مَواهِبُكَ الْهَنِيئَةُ، أَيْنَ صَنائِعُكَ السَّنِيَّةُ، أَيْنَ فَضْلُكَ الْعَظِيمُ، أَيْنَ مَنُّكَ الْجَسِيمُ، أَيْنَ إِحْسانُكَ الْقَدِيمُ، أَيْنَ كَرَمُكَ يا كَرِيمُ، بِهِ وَبِمُحَمَّدٍ وَآلِ مُحَمَّدٍ، فَاسْتَنْقِذْنِي، وَبِرَحْمَتِكَ فَخَلِّصْنِي.'
                      'يا مُحْسِنُ، يا مُجْمِلُ، يا مُنْعِمُ، يا مُفْضِلُ. لَسْتُ أَتَّكِلُ فِي النَّجاةِ مِنْ عِقابِكَ عَلَى أَعْمالِنا، بَلْ بِفَضْلِكَ عَلَيْنا، لأَنَّكَ أَهْلُ التَّقْوَى وَأَهْلُ الْمَغْفِرَةِ. تُبْدِىءُ بِالْإِحْسانِ نِعَماً، وَتَعْفُو عَنِ الذَّنْبِ كَرَماً، فَما نَدْرِي ما نَشْكُرُ، أَجَمِيلَ ما تَنْشُرُ، أَمْ قَبِيحَ ما تَسْتُرُ، أَمْ عَظِيمَ ما أَبْلَيْتَ وَأَوْلَيْتَ، أَمْ كَثِيرَ ما مِنْهُ نَجَّيْتَ وَعافَيْتَ. يا حَبِيبَ مَنْ تَحَبَّبَ إِلَيْكَ، وَيا قُرَّةَ عَيْنِ مَنْ لاذَ بِكَ، وَانْقَطَعَ إِلَيْكَ. أَنْتَ الْمُحْسِنُ، وَنَحْنُ الْمُسِيئُونَ، فَتَجاوَزْ يا رَبِّ، عَنْ قَبِيحِ ما عِندَنا بِجَمِيلِ ما عِنْدَكَ. وَأَيُّ جَهْلٍ يا رَبِّ لا يَسَعُهُ جُودُكَ، أَوْ أَيُّ زَمانٍ أَطْوَلُ مِنْ أَناتِكَ، وَما قَدْرُ أَعْمالِنا فِي جَنْبِ نِعَمِكَ، وَكَيْفَ نَسْتَكْثِرُ أَعْمالاً نُقابِلُ بِها كَرَمَكَ (كَرَامَتكَ)؛ بَلْ كَيْفَ يَضِيقُ عَلَى الْمُذْنِبِينَ ما وَسِعَهُمْ مِنْ رَحْمَتِكَ. يا واسِعَ الْمَغْفِرَةِ، يا باسِطَ الْيَدَيْنِ بِالرَّحْمَةِ. فَوَعِزَّتِكَ، يا سَيِّدِي، لَوْ نَهَرْتَني (انْتَهَرْتَنِي) ما بَرِحْتُ مِنْ بابِكَ، وَلا كَفَفْتُ عَنْ تَمَلُّقِكَ؛ لِما انْتَهَى إِلَيَّ مِنَ الْمَعْرِفَةِ بِجُودِكَ وَكَرَمِكَ، وَأَنْتَ الْفاعِلُ لِما تَشاءُ، تُعَذِّبُ مَنْ تَشاءُ، بِما تَشاءُ، كَيْفَ تَشاءُ، وَتَرْحَمُ مَنْ تَشاءُ، بِما تَشاءُ، كَيْفَ تَشاءُ، وَلا تُسْأَلُ عَنْ فِعْلِكَ، وَلا تُنازَعُ فِي مُلْكِكَ، وَلا تُشارَكُ فِي أَمْرِكَ، وَلا تُضادُّ فِي حُكْمِكَ، وَلا يَعْتَرِضُ عَلَيْكَ أَحَدٌ فِي تَدْبِيرِكَ، لَكَ الْخَلْقُ وَالْأَمْرُ، تَبارَكَ اللهُ رَبُّ الْعالَمِينَ. يا رَبِّ، هذَا مَقامُ مَنْ لاذَ بِكَ، وَاسْتَجارَ بِكَرَمِكَ، وَأَلِفَ إِحْسانَكَ وَنِعَمَكَ، وَأَنْتَ الْجَوادُ الَّذِي لا يَضِيقُ عَفْوُكَ، وَلا يَنْقُصُ فَضْلُكَ، وَلا تَقِلُّ رَحْمَتُكَ، وَقَدْ تَوَثَّقْنا مِنْكَ بِالصَّفْحِ الْقَدِيمِ، وَالْفَضْلِ الْعَظِيمِ، وَالرَّحْمَةِ الْواسِعَةِ، أَفَتُراكَ يا رَبِّ تُخْلِفُ ظُنُونَنا، أَوْ تُخَيِّبُ آمالَنا، كَلّا يا كَرِيمُ، فَلَيْسَ هَذا ظَنُّنا بِكَ، وَلا هَذا فِيكَ طَمَعُنا، يا رَبِّ، إِنَّ لَنا فِيكَ أَمَلاً طَوِيلاً كَثِيراً، إِنَّ لَنا فِيكَ رَجاءً عَظِيماً، عَصَيْناكَ وَنَحْنُ نَرْجُو أَنْ تَسْتُرَ عَلَيْنا، وَدَعَوْناكَ وَنَحْنُ نَرْجُو أَنْ تَسْتَجِيبَ لَنا، فَحَقِّقْ رَجاءَنا مَوْلانا، فَقَدْ عَلِمْنا ما نَسْتَوْجِبُ بِأَعْمالِنا، وَلكِنْ عِلْمُكَ فِينا، وَعِلْمُنا بِأَنَّكَ لا تَصْرِفُنا عَنْكَ، (حَثَّنا عَلَى الرَّغْبَةِ إِلَيْكَ)، وَإِنْ كُنَّا غَيْرَ مُسْتَوْجِبِينَ لِرَحْمَتِكَ، فَأَنْتَ أَهْلٌ أَنْ تَجُودَ عَلَيْنا وَعَلَى الْمُذْنِبِينَ، بِفَضْلِ سَعَتِكَ، فَامْنُنْ عَلَيْنا بِما أَنْتَ أَهْلُهُ، وَجُدْ عَلَيْنا، فَإِنَّا مُحْتاجُونَ إِلَى نَيْلِكَ. يا غَفَّارُ، بِنُورِكَ اهْتَدَيْنا، وَبِفَضْلِكَ اسْتَغْنَيْنا وَبِنِعْمَتِكَ (وَفِي نِعَمِكَ) أَصْبَحْنا وَأَمْسَيْنا، ذُنُوبُنا بَيْنَ يَدَيْكَ، نَسْتَغْفِرُكَ اللّهُمَّ، مِنْها، وَنَتُوبُ إِلَيْكَ، تَتَحَبَّبُ إِلَيْنَا بِالنِّعَمِ، وَنُعارِضُكَ بِالذُّنُوبِ، خَيْرُكَ إِلَيْنا نَازِلٌ، وَشَرُّنا إِلَيْكَ صاعِدٌ، وَلَمْ يَزَلْ وَلا يزالُ، مَلَكٌ كَرِيمٌ يَأْتِيكَ عَنَّا بِعَمَلٍ قَبِيحٍ، فَلا يَمْنَعُكَ ذلِكَ مِنْ أَنْ تَحُوطَنا بِنِعَمِكَ، وَتَتَفَضَّلَ عَلَيْنا بِآلائِكَ، فَسُبْحانَكَ ما أَحْلَمَكَ، وَأَعْظَمَكَ، وَأَكْرَمَكَ، مُبْدِئاً وَمُعِيداً.'
                      'تَقَدَّسَتْ أَسْماؤُكَ، وَجَلَّ ثَناؤُكَ، وَكَرُمَ صَنائِعُكَ وَفِعالُكَ. أَنْتَ إِلهِي، أَوْسَعُ فَضْلاً، وَأَعْظَمُ حِلْماً مِنْ أَنْ تُقايِسَنِي بِفِعْلِي وَخَطِيئَتِي، فَالْعَفْوَ الْعَفْوَ الْعَفْوَ، سَيِّدِي سَيِّدِي سَيِّدِي. اللّهُمَّ، اشْغَلْنا بِذِكْرِكَ، وَأَعِذْنا مِنْ سَخَطِكَ، وَأَجِرْنا مِنْ عَذابِكَ، وَارْزُقْنا مِنْ مَواهِبِكَ، وَأَنْعِمْ عَلَيْنا مِنْ فَضْلِكَ، وَارْزُقْنا حَجَّ بَيْتِكَ، وَزِيارَةَ قَبْرِ نَبِيِّكَ، صَلَواتُكَ، وَرَحْمَتُكَ، وَمَغْفِرَتُكَ، وَرِضْوانُكَ، عَلَيْهِ وَعَلَى أَهْلِ بَيْتِهِ، إِنَّكَ قَرِيبٌ مُجِيبٌ، وَارْزُقْنا عَمَلاً بِطاعَتِكَ، وَتَوَفَّنا عَلَى مِلَّتِكَ وَسُنَّةِ نَبِيِّكَ، صَلَّى اللهُ عَلَيْهِ وَآلِهِ. اللّهُمَّ، اغْفِرْ لِي وَلِوالِدَيَّ، وَارْحَمْهُما كَما رَبَّيانِي صَغِيراً، اجْزِهِما بِالْإِحْسانِ إِحْساناً، وَبِالسَّيِّئاتِ غُفْراناً. اللّهُمَّ، اغْفِرْ لِلْمُؤْمِنِينَ وَالْمُؤْمِناتِ، الْأَحْياءِ مِنْهُمْ وَالْأَمْواتِ، وَتابِعْ بَيْنَنا وَبَيْنَهُمْ بِالْخَيْراتِ (فِي الخَيْرَاتِ). اللّهُمَّ، اغْفِرْ لِحَيِّنا وَمَيِّتِنا، وَشاهِدِنا وَغائِبِنا، ذَكَرِنا وَأُنْثانا (وإِنَاثِنَا)، صَغِيرِنا وَكَبِيرِنا، حُرّنا وَمَمْلُوكِنا، كَذَبَ الْعادِلُونَ بِاللهِ، وَضَلُّوا ضَلالاً بَعِيداً، وَخَسِرُوا خُسْراناً مُبِيناً. اللّهُمَّ، صَلِّ عَلَى مُحَمَّدٍ وَآلِ مُحَمَّدٍ، وَاخْتِمْ لِي بِخَيْرٍ، وَاكْفِنِي ما أَهَمَّنِي، مِنْ أَمْرِ دُنْيايَ وَآخِرَتِي، وَلا تُسَلِّطْ عَلَيَّ مَنْ لا يَرْحَمُنِي، وَاجْعَلْ عَلَيَّ مِنْكَ واقِيَةً باقِيةً، وَلا تَسْلُبْنِي صالِحَ ما أَنْعَمْتَ بِهِ عَلَيَّ،'
                      'وَارْزُقْنِي مِنْ فَضْلِكَ، رِزْقاً واسِعاً حَلالاً طَيِّباً. اللّهُمَّ، احْرُسْنِي بِحَراسَتِكَ، وَاحْفَظْنِي بِحِفْظِكَ، وَاكْلأْنِي بِكَلاءَتِكَ، وَارْزُقْنِي حَجَّ بَيْتِكَ الْحَرامِ، فِي عامِنا هَذا وَفِي كُلِّ عامٍ، وَزِيارَةَ قَبْرِ نَبِيِّكَ وَالْأَئِمَّةِ عَلَيْهِمُ السَّلامُ، وَلا تُخْلِنِي، يا رَبِّ، مِنْ تِلْكَ الْمَشاهِدِ الشَّرِيفَةِ، وَالْمَواقِفِ الْكَرِيمَةِ. اللّهُمَّ، تُبْ عَلَيَّ حَتَّى لا أَعْصِيَكَ، وَأَلْهِمْنِي الْخَيْرَ وَالْعَمَلَ بِهِ، وَخَشْيَتَكَ بِاللَّيْلِ وَالنَّهارِ ما أَبْقَيْتَنِي، يا رَبَّ الْعالَمِينَ. اللّهُمَّ، إِنِّي كُلَّما قُلْتُ قَدْ تَهَيَّأْتُ، وَتَعَبَّأْتُ، وَقُمْتُ لِلصَّلاةِ بَيْنَ يَدَيْكَ، وَناجَيْتُكَ، أَلْقَيْتَ عَلَيَّ نُعاساً إِذَا أَنَا صَلَّيْتُ، وَسَلَبْتَنِي مُناجاتِكَ إِذَا أَنَا ناجَيْتُ. ما لي كُلَّما قُلْتُ قَدْ صَلُحَتْ سَرِيرَتِي، وَقَرُبَ مِنْ مَجالِسِ التَّوابِينَ مَجْلِسِي، عَرَضَتْ لِي بَلِيَّةٌ أَزَالَتْ قَدَمِي، وَحالَتْ بَيْنِي وَبَيْنَ خِدْمَتِكَ. سَيِّدِي، لَعَلَّكَ عَنْ بابِكَ طَرَدْتَنِي، وَعَنْ خِدْمَتِكَ نَحَّيْتَنِي، أَوْ لَعَلَّكَ رَأَيْتَنِي مُسْتَخِفّاً بِحَقِّكَ فَأَقْصَيْتَنِي، أَوْ لَعَلَّكَ رَأَيْتَنِي مُعْرِضاً عَنْكَ فَقَلَيْتَنِي، أَوْ لَعَلَّكَ وَجَدْتَنِي فِي مَقامِ الْكاذِبِينَ (الكَذّابِينَ) فَرَفَضْتَنِي، أَوْ لَعَلَّكَ رَأَيْتَنِي غَيْرَ شاكِرٍ لِنَعْمائِكَ فَحَرَمْتَنِي، أَوْ لَعَلَّكَ فَقَدْتَنِي مِنْ مَجالِسِ الْعُلَماءِ فَخَذَلْتَنِي، أَوْ لَعَلَّكَ رَأَيْتَنِي فِي الْغافِلِينَ فَمِنْ رَحْمَتِكَ آيَسْتَنِي، أَوْ لَعَلَّكَ رَأَيْتَنِي آلَفُ مَجالِسَ الْبَطَّالِينَ، فَبَيْنِي وَبَيْنَهُمْ خَلَّيْتَنِي، أَوْ لَعَلَّكَ لَمْ تُحِبَّ أَنْ تَسْمَعَ دُعائِي فَباعَدْتَنِي، أَوْ لَعَلَّكَ بِجُرْمِي وَجَرِيرَتِي كافَيْتَنِي، أَوْ لَعَلَّكَ بِقِلَّةِ حَيائِي مِنْكَ جازَيْتَنِي، فَإِنْ عَفَوْتَ يا رَبِّ، فَطالَما'
                      'عَفَوْتَ عَنِ الْمُذْنِبِينَ قَبْلِي، لأَنَّ كَرَمَكَ، أَيْ رَبِّ، يَجِلُّ عَنْ مُكافَاةِ الْمُقَصِّرِين. وَأَنا عائِذٌ بِفَضْلِكَ، هارِبٌ مِنْكَ إِلَيْكَ، مُتَنَجِّزٌ (مُنْتَجِزٌ) ما وَعَدْتَ مِنَ الصَّفْحِ عَمَّنْ أَحْسَنَ بِكَ ظَنّاً. إِلهِي، أَنْتَ أَوْسَعُ فَضْلاً، وَأَعْظَمُ حِلْماً مِنْ أَنْ تُقايِسَنِي بِعَمَلِي، أَوْ أَنْ تَسْتَزِلَّنِي بِخَطِيئَتِي، وَما أَنَا يا سَيِّدِي وَما خَطَرِي، هَبْنِي بِفَضْلِكَ سَيِّدِي، وَتَصَدَّقْ عَلَيَّ بِعَفْوِكَ، وَجَلِّلْنِي بِسِتْرِكَ، وَاعْفُ عَنْ تَوْبِيخِي بِكَرِمِ وَجْهِكَ. سَيِّدِي، أَنَا الصَّغِيرُ الَّذِي رَبَّيْتَهُ، وَأَنَا الْجاهِلُ الَّذِي عَلَّمْتَهُ، وَأَنَا الضَّالُّ الَّذِي هَدَيْتَهُ، وَأَنَا الْوَضِيعُ الَّذِي رَفَعْتَهُ، وَأَنَا الْخائِفُ الَّذِي آمَنْتَهُ، وَالْجائِعُ الَّذِي أَشْبَعْتَهُ، وَالْعَطْشانُ الَّذِي أَرْوَيْتَهُ، وَالْعارِي الَّذِي كَسَوْتَهُ، وَالْفَقِيرُ الَّذِي أَغْنَيْتَهُ، وَالضَّعِيفُ الَّذِي قَوَّيْتَهُ، وَالذَّلِيلُ الَّذِي أَعْزَزْتَهُ، وَالسَّقِيمُ الَّذِي شَفَيْتَهُ، وَالسَّائِلُ الَّذِي أَعْطَيْتَهُ، وَالْمُذْنِبُ الَّذِي سَتَرْتَهُ، وَالْخاطِىءُ الَّذِي أَقَلْتَهُ، وَأَنَا الْقَلِيلُ الَّذِي كَثَّرْتَهُ، وَالْمُسْتَضْعَفُ الَّذِي نَصَرْتَهُ، وَأَنَا الطَّرِيدُ الَّذِي آوَيْتَهُ. أَنَا يا رَبِّ الَّذِي لَمْ أَسْتَحْيِكَ فِي الْخلاءِ، وَلَمْ أُراقِبْكَ فِي الْمَلإِ، أَنَا صاحِبُ الدَّواهِي الْعُظْمَى، أَنَا الَّذِي عَلَى سَيِّدِهِ اجْتَرَأَ، أَنَا الَّذِي عَصَيْتُ جَبَّارَ السَّماءِ، أَنَا الَّذِي أَعْطَيْتُ عَلَى مَعَاصِي الْجَلِيلِ الرُّشَى (المَعَاصِي جَلِيلَ الرُشَى)، أَنَا الَّذِي حِينَ بُشِّرْتُ بِها خَرَجْتُ إِلَيْها أَسْعَى، أَنَا الَّذِي أَمْهَلْتَنِي فَما ارْعَوَيْتُ، وَسَتَرْتَ عَلَيَّ فَما اسْتَحْيَيْتُ، وَعَمِلْتُ (وَعَلِمْتُ) بِالْمَعاصِي'
                      'فَتَعَدَّيْتُ، وَأَسْقَطْتَنِي مِنْ عَيْنِكَ (مِنْ عِنْدِكَ) فَما بالَيْتُ، فِبِحِلْمِكَ أَمْهَلْتَنِي، وَبِسِتْرِكَ سَتَرْتَنِي، حَتَّى كَأَنَّكَ أَغْفَلْتَنِي، وَمِنْ عُقُوباتِ الْمَعاصِي جَنَّبْتَنِي، حَتَّى كَأَنَّكَ اسْتَحْيَيْتَنِي. إِلهِي، لَمْ أَعْصِكَ حِينَ عَصَيْتُكَ وَأَنَا بِرُبُوبِيَّتِكَ جاحِدٌ، وَلا بِأَمْرِكَ مُسْتَخِفٌ، وَلا لِعُقُوبَتِكَ مُتَعَرِّضٌ، وَلا لِوَعِيدِكَ مُتَهاوِنٌ، لكِنْ خَطِيئَةٌ عَرَضَتْ، وَسَوَّلَتْ لِي نَفْسِي، وَغَلَبَني هَوَايَ، وَأَعانَنِي عَلَيْها شِقْوَتِي، وَغَرَّنِي سِتْرُكَ الْمُرْخَى عَلَيَّ، فَقَدْ عَصَيْتُكَ وَخَالَفْتُكَ بِجُهْدِي، فَالآنَ مِنْ عَذابِكَ مَنْ يَسْتَنْقِذُنِي، وَمِنْ أَيْدِي الْخُصَماءِ غَداً مَنْ يُخَلِّصُنِي، وَبِحَبْلِ مَنْ أَتَّصِلُ إِنْ أَنْتَ قَطَعْتَ حَبْلَكَ عَنِّي، فَوَاسَوْأَتا (فوَاأَسَفَا) عَلَى ما أَحْصَى كِتابُكَ مِنْ عَمَلِي، الَّذِي لَوْلا ما أَرْجُو مِنْ كَرَمِكَ، وَسَعَةِ رَحْمَتِكَ، وَنَهْيِكَ إِيَّايَ عَنِ الْقُنُوطِ، لَقَنَطْتُ عِنْدَما أَتَذَكَّرُها، يا خَيْرَ مَنْ دَعاهُ داعٍ، وَأَفْضَلَ مَنْ رَجاهُ راجٍ. اللّهُمَّ، بِذِمَّةِ الْإِسْلامِ أَتَوَسَّلُ إِلَيْكَ، وَبِحُرْمَةِ الْقُرْآنِ أَعْتَمِدُ عَلَيْكَ، وَبِحُبِّي النَّبِيَّ الْأُمِّيَّ، الْقُرَشِيَّ، الْهاشِمِيَّ، الْعَرَبِيَّ، التِّهامِيَّ، الْمَكِّيَّ، الْمَدَنِيَّ، أَرْجُو الزُّلْفَةَ لَدَيْكَ، فَلا تُوحِشِ'
                      'اسْتِئْناسَ إِيْمانِي، وَلا تَجْعَلْ ثَوابِي ثَوابَ مَنْ عَبَدَ سِواكَ، فَإِنَّ قَوْماً آمَنُوا بِأَلْسِنَتِهِمْ. لِيَحْقِنُوا بِهِ دِماءَهُمْ، فَأَدْرَكُوا ما أَمَّلُوا، وَإِنَّا آمَنَّا بِكَ بِأَلْسِنَتِنا وَقُلُوبِنا، لِتَعْفُوَ عَنَّا، فَأَدْرِكْنا (فَأَدْرِكْ بِنَا) ما أَمَّلْنا، وَثَبِّتْ رَجاءَكَ فِي صُدُورِنا، وَلا تُزِغْ قُلُوبَنا بَعْدَ إِذْ هَدَيْتَنا، وَهَبْ لَنا مِنْ لَدُنْكَ رَحْمَةً، إِنَّكَ أَنْتَ الْوَهَّابُ. فَوَعِزَّتِكَ لَوِ انْتَهَرْتَنِي ما بَرِحْتُ مِنْ بابِكَ، وَلا كَفَفْتُ عَنْ تَمَلُّقِكَ؛ لِما أُلْهِمَ قَلْبِي (يَا سَيّدِي) مِنَ الْمَعْرِفَةِ بِكَرَمِكَ، وَسَعَةِ رَحْمَتِكَ. إِلَى مَنْ يَذْهَبُ الْعَبْدُ إِلّا إِلَى مَوْلاهُ، وَإِلَى مَنْ يَلْتَجِىءُ الْمَخْلُوقُ إِلّا إِلَى خالِقِهِ. إِلهِي، لَوْ قَرَنْتَنِي بِالْأَصْفاد، وَمَنَعْتَنِي سَيْبَكَ مِنْ بَيْنِ الْأَشْهادِ، وَدَلَلْتَ عَلَى فَضائِحِي عُيُونَ الْعِبادِ، وَأَمَرْتَ بِي إِلَى النَّارِ، وَحُلْتَ بَيْنِي وَبَيْنَ الْأَبْرارِ، ما قَطَعْتُ رَجائِي مِنْكَ، وَما صَرَفْتُ تَأْمِيلِي لِلْعَفْوِ عَنْكَ، وَلا خَرَجَ حُبُّكَ مِنْ قَلْبِي. أَنَا لا أَنْسَى أَيادِيَكَ عِنْدِي، وَسَتْرَكَ عَلَيَّ فِي دارِ الدُّنْيا. سَيِّدِي، أَخْرِجْ حُبَّ الدُّنْيا مِنْ قَلْبِي، وَاجْمَعْ بَيْنِي وَبَيْنَ الْمُصْطَفَى وَآلِهِ، خِيرَتِكَ مِنْ خَلْقِكَ، وَخاتَمِ النَّبِيِّينَ مُحَمَّدٍ صَلَّى اللهُ عَلَيْهِ وَآلِهِ، وَانْقُلْنِي إِلَى دَرَجَةِ التَّوْبَةِ إِلَيْكَ، وَأَعِنِّي بِالْبُكاءِ عَلَى نَفْسِي، فَقَدْ أَفْنَيْتُ بِالتَّسْوِيفِ وَالآمالِ عُمْرِي، وَقَدْ نَزَلْتُ مَنْزِلَةَ الآيِسِينَ مِنْ خَيْرِي (مِنْ حَيَاتِي)، فَمَنْ يَكُونُ أَسْوَأَ حالاً مِنِّي، إِنْ أَنَا نُقِلْتُ عَلَى مِثْلِ حالِي إِلَى قَبْري (إِلى قَبْرٍ) لَمْ أُمَهِّدْهُ لِرَقْدَتِي، وَلَمْ أَفْرُشْهُ بِالْعَمَلِ الصَّالِحِ لِضَجْعَتِي. وَما لِي لا أَبْكِي، وَلا أَدْرِي إِلَى ما يَكُونُ مَصِيرِي، وَأَرى نَفْسِي تُخادِعُنِي، وَأَيَّامِي تُخاتِلُنِي، وَقَدْ خَفَقَتْ عِنْدَ (فَوْقَ) رَأْسِي أَجْنِحَةُ الْمَوْتِ، فَما لِي لا أَبْكِي، أَبْكِي لِخُرُوجِ'
                      'نَفْسِي، أَبْكِي لِظُلْمَةِ قَبْرِي، أَبْكِي لِضِيقِ لَحْدِي، أَبْكِي لِسُؤالِ مُنْكَرٍ وَنَكِيرٍ إِيَّايَ، أَبْكِي لِخُرُوجِي مِنْ قَبْرِي، عُرْياناً ذَلِيلاً، حامِلاً ثِقْلِي عَلَى ظَهْرِي، أُنْظُرُ مَرَّةً عَنْ يَمِينِي، وَأُخْرَى عَنْ شِمالِي. إِذِ الْخَلائِقُ فِي شأْنٍ غَيْرِ شَأْنِي، لِكُلِّ امْرِىءٍ مِنْهُمْ يَوْمَئِذٍ شأْنٌ يُغْنِيهِ، وُجُوهٌ يَوْمَئِذٍ مُسْفِرَةٌ، ضاحِكَةٌ مُسْتَبْشِرَةٌ، وَوُجُوهٌ يَوْمَئِذٍ عَلَيْها غَبَرَةٌ، تَرْهَقُها قَتَرَةٌ وَذِلَّةٌ. سَيِّدِي، عَلَيْكَ مُعَوَّلِي وَمُعْتَمَدِي، وَرَجائِي وَتَوَكُّلِي، وَبِرَحْمَتِكَ تَعَلُّقِي، تُصِيبُ بِرَحْمَتِكَ مَنْ تَشاءُ، وَتَهْدِي بِكَرامَتِكَ مَنْ تُحِبُّ، فَلَكَ الْحَمْدُ عَلَى ما نَقَّيْتَ مِنَ الشِّرْكِ قَلْبِي، وَلَكَ الْحَمْدُ عَلَى بَسْطِ لِسانِي، أَفَبِلِسانِي هَذا الْكالِّ أَشْكُرُكَ، أَمْ بِغايَةِ جُهْدِي فِي عَمَلِي أُرْضِيكَ، وَما قَدْرُ لِسانِي، يا رَبِّ، فِي جَنْبِ شُكْرِكَ، وَما قَدْرُ عَمَلِي فِي جَنْبِ نِعَمِكَ وَإِحْسانِكَ (إِليَّ). إِلهِي، إِنَّ جُودَكَ (إِلّا أَنَّ جُودَكَ) بَسَطَ أَمَلِي، وَشُكْرَكَ قَبِلَ عَمَلِي. سَيِّدِي، إِلَيْكَ رَغْبَتِي، وَإِلَيْكَ (وَمِنْكَ) رَهْبَتِي، وَإِلَيْكَ تَأْمِيلِي، وَقَدْ ساقَنِي إِلَيْكَ أَمَلِي، وَعَلَيْكَ (وإِليكَ) يا واحِدِي عَكَفَتْ (عَلِقَتْ) هِمَّتِي، وَفِيما عِنْدَكَ انْبَسَطَتْ رَغْبَتِي، وَلَكَ خالِصُ رَجائِي وَخَوْفِي، وَبِكَ أَنِسَتْ مَحَبَّتِي، وَإِلَيْكَ أَلْقَيْتُ بِيَدِي، وَبِحَبْلِ طاعَتِكَ مَدَدْتُ رَهْبَتِي. يا مَوْلايَ، بِذِكْرِكَ عاشَ قَلْبِي، وَبِمُناجاتِكَ بَرَّدْتُ أَلَمَ الْخَوْفِ عَنِّي، فَيا مَوْلايَ، وَيا مُؤَمَّلِي، وَيا مُنْتَهَى سُؤْلِي، فَرِّقْ بَيْنِي وَبَيْنَ ذَنْبِيَ الْمانِعِ لِي مِنْ لُزُومِ طاعَتِكَ، فَإِنَّما أَسْأَلُكَ لِقَدِيمِ الرَّجاءِ فِيكَ، وَعَظِيمِ الطَّمَعِ مِنْكَ، الَّذِي أَوْجَبْتَهُ عَلَى نَفْسِكَ مِنَ الرَّأْفَةِ وَالرَّحْمَةِ،'
                      'فَالْأَمْرُ لَكَ وَحْدَكَ لا شَرِيكَ لَكَ، وَالْخَلْقُ كُلُّهُمْ عِيالُكَ وَفِي قَبْضَتِكَ، وَكُلُّ شَيْءٍ خاضِعٌ لَكَ، تَبارَكْتَ يا رَبَّ الْعالَمِينَ. إِلهِي، ارْحَمْنِي إِذَا انْقَطَعَتْ حُجَّتِي، وَكَلَّ عَنْ جَوابِكَ لِسانِي، وَطاشَ عِنْدَ سُؤالِكَ إِيَّايَ لُبِّي، فَيا عَظِيمَ رَجائِي لا تُخَيِّبْنِي إِذَا اشْتَدَّتْ فاقَتِي، وَلا تَرُدَّنِي لِجَهْلِي، وَلا تَمْنَعْنِي لِقِلَّةِ صَبْرِي. أَعْطِنِي لِفَقْرِي، وَارْحَمْنِي لِضَعْفِي. سَيِّدِي، عَلَيْكَ مُعْتَمَدِي وَمُعَوَّلِي، وَرَجائِي وَتَوَكُّلِي، وَبِرَحْمَتِكَ تَعَلُّقِي، وَبِفِنائِكَ أَحُطُّ رَحْلِي، وَبِجُودِكَ أَقْصِدُ (أَقْصُرُ) طَلِبَتِي، وَبِكَرَمِكَ، أَيْ رَبِّ، أَسْتَفْتِحُ دُعائِي، وَلَدَيْكَ أَرْجُو فاقَتِي (ضِيَافَتِي)، وَبِغِناكَ أَجْبُرُ عَيْلَتِي، وَتَحْتَ ظِلِّ عَفْوِكَ قِيامِي، وَإِلَى جُودِكَ وَكَرَمِكَ أَرْفَعُ بَصَرِي، وَإِلَى مَعْرُوفِكَ أُدِيمُ نَظَرِي، فَلا تُحْرِقْنِي بِالنَّارِ وَأَنْتَ مَوْضِعُ أَمَلِي، وَلا تُسْكِنِّي الْهاوِيَةَ فَإِنَّكَ قُرَّةُ عَيْنِي. يا سَيِّدِي، لا تُكَذِّبْ ظَنِّي بِإِحْسانِكَ وَمَعْرُوفِكَ، فَإِنَّكَ ثِقَتِي، وَلا تَحْرِمْنِي ثَوابَكَ فَإِنَّكَ الْعارِفُ بِفَقْرِي. إِلهِي، إِنْ كانَ قَدْ دَنا أَجَلِي، وَلَمْ يُقَرِّبْنِي مِنْكَ عَمَلِي، فَقَدْ جَعَلْتُ الْاعْتِرَافَ إِلَيْكَ بِذَنْبِي وَسائِلَ عِلَلِي. إِلهِي، إِنْ عَفَوْتَ فَمَنْ أَوْلَى مِنْكَ بِالْعَفْوِ، وَإِنْ عَذَّبْتَ فَمَنْ أَعْدَلُ مِنْكَ فِي الْحُكْمِ. ارْحَمْ فِي هَذِهِ الدُّنْيا غُرْبَتِي، وَعِنْدَ الْمَوْتِ كُرْبَتِي، وَفِي الْقَبْرِ وَحْدَتِي، وَفِي اللَّحْدِ وَحْشَتِي، وَإِذَا نُشِرْتُ لِلْحِسابِ بَيْنَ يَدَيْكَ ذُلَّ مَوْقِفِي، وَاغْفِرْ لِي ما خَفِيَ عَلَى الآدَمِيِّينَ مِنْ عَمَلِي، وَأَدِمْ لِي ما بِهِ سَتَرْتَنِي، وَارْحَمْنِي صَرِيعاً عَلَى الْفِراشِ، تُقَلِّبُنِي أَيْدِي أَحِبَّتِي، وَتَفَضَّلْ عَلَيَّ مَمْدُوداً عَلَى الْمُغْتَسَلِ، يُقَلِّبُنِي (يُغَسِّلُنِي) صالِحُ جِيرَتِي، وَتَحَنَّنْ عَلَيَّ مَحْمُولاً قَدْ تَناوَلَ الْأَقْرِباءُ أَطْرافَ جَنازَتِي، وَجُدْ عَلَيَّ مَنْقُولاً قَدْ نَزَلْتُ بِكَ وَحِيداً فِي حُفْرَتِي، وَارْحَمْ فِي ذلِكَ الْبَيْتِ الْجَدِيدِ غُرْبَتِي، حَتَّى لا أَسْتَأْنِسَ بِغَيْرِكَ. يا سَيِّدِي، إِنْ وَكَلْتَنِي إِلَى نَفْسِي هَلَكْتُ، سَيِّدِي، فَبِمَنْ أَسْتَغِيثُ إِنْ لَمْ تُقِلْنِي عَثْرَتِي، وَإِلَى مَنْ أَفْزَعُ إِنْ فَقَدْتُ عِنايَتَكَ فِي ضَجْعَتِي، وَإِلَى مَنْ أَلْتَجِىءُ إِنْ لَمْ تُنَفِّسْ كُرْبَتِي. سَيِّدِي، مَنْ لِي وَمَنْ يَرْحَمُنِي إِنْ لَمْ تَرْحَمْنِي، وَفَضْلَ مَنْ أُؤَمِّلُ إِنْ عَدِمْتُ فَضْلَكَ يَوْمَ فاقَتِي، وَإِلَى مَنِ الْفِرارُ مِنَ الذُّنُوبِ إِذَا انْقَضَى أَجَلِي. سَيِّدِي، لا تُعَذِّبْنِي وَأَنَا أَرْجُوكَ. إِلهِي (اللّهُمَّ)، حَقِّقْ رَجائِي، وَآمِنْ خَوْفِي، فَإِنَّ كَثْرَةَ ذُنُوبِي لا أَرْجُو فِيها (لَهَا) إِلّا عَفْوَكَ. سَيِّدِي، أَنَا أَسْأَلُكَ ما لا أَسْتَحِقُّ، وَأَنْتَ أَهْلُ التَّقْوَى وَأَهْلُ الْمَغْفِرَةِ، فَاغْفِرْ لِي وَأَلْبِسْنِي مِنْ نَظَرِكَ ثَوْباً يُغَطِّي عَلَيَّ التَّبِعاتِ وَتَغْفِرُها لِي، وَلا أُطالَبُ بِها، إِنَّكَ ذُو مَنٍّ قَدِيمٍ، وَصَفْحٍ عَظِيمٍ، وَتَجاوُزٍ كَرِيمٍ. إِلهِي، أَنْتَ الَّذِي تُفِيضُ سَيْبَكَ عَلَى مَنْ لا يَسْأَلُكَ، وَعَلَى الْجاحِدِينَ بِرُبُوبِيَّتِكَ، فَكَيْفَ سَيِّدِي بِمَنْ سَأَلَكَ'
                      'وَأَيْقَنَ أَنَّ الْخَلْقَ لَكَ وَالْأَمْرَ إِلَيْكَ، تَبارَكْتَ وَتَعالَيْتَ يا رَبَّ الْعالَمِينَ. سَيِّدِي عَبْدُكَ بِبابِكَ، أَقامَتْهُ الْخَصَاصَةُ بَيْنَ يَدَيْكَ، يَقْرَعُ بابَ إِحْسانِكَ بِدُعائِهِ، (ويَسْتَعْطِفُ جَمِيلَ نَظَرِكَ بِمَكْنُونِ رَجَائِكَ) فَلا تُعْرِضْ بِوَجْهِكَ الْكَرِيمِ عَنِّي، وَاقْبَلْ مِنِّي ما أَقُولُ، فَقَدْ دَعَوْتُ (دَعَوْتُكَ) بِهَذا الدُّعَاءِ، وَأَنَا أَرْجُو أَنْ لا تَرُدَّنِي؛ مَعْرِفَةً مِنِّي بِرَأْفَتِكَ وَرَحْمَتِكَ. إِلهِي، أَنْتَ الَّذِي لا يُحْفِيكَ سائِلٌ، وَلا يَنْقُصُكَ نائِلٌ، أَنْتَ كَما تَقُولُ، وَفَوْقَ ما نَقُولُ. اللّهُمَّ، إِنِّي أَسْأَلُكَ صَبْراً جَمِيلاً، وَفَرَجاً قَرِيباً، وَقَوْلاً صادِقاً، وَأَجْراً عَظِيماً. أَسْأَلُكَ، يا رَبِّ، مِنَ الْخَيْرِ كُلِّهِ، ما عَلِمْتُ مِنْهُ وَما لَمْ أَعْلَمْ. أَسْأَلُكَ، اللّهُمَّ، مِنْ خَيْرِ ما سَأَلَكَ مِنْهُ عِبادُكَ الصَّالِحُونَ، يا خَيْرَ مَنْ سُئِلَ، وَأَجْوَدَ مَنْ أَعْطَى، أَعْطِنِي سُؤْلِي فِي نَفْسِي وَأَهْلِي، وَوالِدَيَّ وَوُلْدِي (وَوَلَدِي)، وَأَهْلِ حُزانَتِي وَإِخْوانِي فِيكَ، وَأَرْغِدْ عَيْشِي، وَأَظْهِرْ مُرُوَّتِي، وَأَصْلِحْ جَمِيعَ أَحْوالِي، وَاجْعَلْنِي مِمَّنْ أَطَلْتَ عُمْرَهُ، وَحَسَّنْتَ عَمَلَهُ، وَأَتْمَمْتَ عَلَيْهِ نِعْمَتَكَ، وَرَضِيتَ عَنْهُ، وَأَحْيَيْتَهُ حَياةً طَيِّبَةً، فِي أَدْومِ السُّرُورِ، وَأَسْبِغِ الْكَرامَةِ، وَأَتَمِّ الْعَيْشِ، إِنَّكَ تَفْعَلُ ما تَشاءُ، وَلا يَفْعَلُ (ولا تَفْعَلُ) ما يَشاءُ غَيْرُكَ. اللّهُمَّ، خُصَّنِي مِنْكَ بِخاصَّةِ ذِكْرِكَ، وَلا تَجْعَلْ شَيْئاً مِمَّا أَتَقَرَّبُ بِهِ فِي آنَاءِ اللَّيْلِ وَأَطْرافِ النَّهارِ رِياءً وَلا سُمْعَةً، وَلا أَشَرَاً وَلا بَطَرَاً، وَاجْعَلْنِي لَكَ مِنَ الْخاشِعِينَ. اللّهُمَّ، أَعْطِنِي السَّعَةَ فِي الرِّزْقِ، وَالْأَمْنَ فِي الْوَطَنِ، وَقُرَّةَ الْعَيْنِ فِي الْأَهْلِ وَالْمالِ وَالْوَلَدِ، وَالْمُقامَ فِي نِعَمِكَ عِنْدِي، وَالصِّحَّةَ فِي الْجِسْمِ، وَالْقُوَّةَ فِي الْبَدَنِ، وَالسَّلامَةَ فِي الدِّينِ، وَاسْتَعْمِلْنِي بِطاعَتِكَ وَطاعَةِ رَسُولِكَ مُحَمَّدٍ صَلَّى اللهُ عَلَيْهِ وَآلِهِ، أَبَداً ما أَسْتَعْمَرْتَنِي، وَاجْعَلْنِي مِنْ أَوْفَرِ عِبادِكَ عِنْدَكَ نَصِيباً، فِي كُلِّ خَيْرٍ أَنْزَلْتَهُ وَتُنْزِلُهُ فِي شَهْرِ رَمَضانَ، فِي لَيْلَةِ الْقَدْرِ، وَما أَنْتَ مُنْزِلُهُ فِي كُلِّ سَنَةٍ، مِنْ رَحْمَةٍ تَنْشُرُها، وَعافِيَةٍ تُلْبِسُها، وَبَلِيَّةٍ تَدْفَعُها، وَحَسَناتٍ تَتَقَبَّلُها، وَسَيِّئاتٍ تَتَجاوَزُ عَنْها. وَارْزُقْنِي حَجَّ بَيْتِكَ الْحَرامِ، فِي عامِنا (عَامِي) هَذا وَفِي كُلِّ عامٍ، وَارْزُقْنِي رِزْقاً واسِعاً مِنْ فَضْلِكَ الْواسِعِ، وَاصْرِفْ عَنِّي، يا سَيِّدِي، الْأَسْواءَ، وَاقْضِ عَنِّي'
                      'لدَّيْنَ وَالظُّلاماتِ، حَتَّى لا أَتَأَذَّى بِشَيْءٍ مِنْهُ، وَخُذْ عَنِّي بِأَسْماعِ وَأَبْصارِ أَعْدائِي وَحُسَّادِي وَالْباغِينَ عَلَيَّ، وَانْصُرْنِي عَلَيْهِمْ، وَأَقِرَّ عَيْنِي، (وَحَقِّقْ ظَنِّي)، وَفَرِّحْ قَلْبِي، وَاجْعَلْ لِي مِنْ هَمِّي وَكَرْبِي فَرَجَاً وَمَخْرَجاً، وَاجْعَلْ مَنْ أَرادَنِي بِسُوءٍ مِنْ جَمِيعِ خَلْقِكَ تَحْتَ قَدَمَيَّ، وَاكْفِنِي شَرَّ الشَّيْطانِ، وَشَرَّ السُّلْطانِ، وَسَيِّئاتِ عَمَلِي، وَطَهِّرْنِي مِنَ الذُّنُوبِ كُلِّها، وَأَجِرْنِي مِنَ النَّارِ بِعَفْوِكَ، وَأَدْخِلْنِي الجَنَّةَ بِرَحْمَتِكَ وَزَوِّجْنِي مِنَ الْحُورِ الْعِينِ بِفَضْلِكَ وَأَلْحِقْنِي بِأَوْلِيائِكَ الصَّالِحِينَ، مُحَمَّدٍ وَآلِهِ الْأَبْرارِ الطَّيِّبِينَ الطَّاهِرِينَ الْأَخْيارِ، صَلَواتُكَ عَلَيْهِمْ، وَعَلَى أَجْسادِهِمْ وَأَرْواحِهِمْ، وَرَحْمَةُ اللهِ وَبَرَكاتُهُ. إِلهِي وَسَيِّدِي، وَعِزَّتِكَ وَجَلالِكَ، لَئِنْ طالَبْتَنِي بِذُنُوبِي لأُطالِبَنَّكَ بِعَفْوِكَ، وَلَئِنْ طالَبْتَنِي بِلُؤْمِي لأُطالِبَنَّكَ بِكَرَمِكَ، وَلَئِنْ أَدْخَلْتَنِي النَّارَ لأُخْبِرَنَّ أَهْلَ النَّارِ بِحُبِّي لَكَ. إِلهِي وَسَيِّدِي، إِنْ كُنْتَ لا تَغْفِرُ إِلّا لأَوْلِيائِكَ وَأَهْلِ طاعَتِكَ، فَإِلَى مَنْ يَفْزَعُ الْمُذْنِبُونَ، وَإِنْ كُنْتَ لا تُكْرِمُ إِلّا أَهْلَ الْوَفاءِ بِكَ، فَبِمَنْ يَسْتَغِيْثُ الْمُسِيئُونَ. إِلهِي، إِنْ أَدْخَلْتَنِي النَّارَ فَفِي ذلِكَ سُرُورُ عَدُوِّكَ، وَإِنْ أَدْخَلْتَنِي الجَنَّةَ فَفِي ذلِكَ سُرُورُ نَبِيِّكَ، وَأَنَا، وَاللهِ، أَعْلَمُ أَنَّ سُرُورَ نَبِيِّكَ أَحَبُّ إِلَيْكَ مِنْ سُرُورِ عَدُوِّكَ. اللّهُمَّ، إِنِّي أَسْأَلُكَ أَنْ تَمْلأَ قَلْبِي حُبّاً لَكَ، وَخَشْيَةً مِنْكَ، وَتَصْدِيقاً بِكِتابِكَ، وَإِيماناً بِكَ، وَفَرَقاً مِنْكَ، وَشَوْقاً إِلَيْكَ. يا ذا الْجَلالِ وَالْإِكْرامِ حَبِّبْ إِلَيَّ لِقاءَكَ، وَأَحْبِبْ لِقائِي، وَاجْعَلْ لِي فِي لِقائِكَ الرَّاحَةَ وَالْفَرَجَ وَالْكَرَامَةَ. اللّهُمَّ، أَلْحِقْني بِصالِحِ مَنْ مَضَى، وَاجْعَلْنِي مِنْ صالِحِ مَنْ بَقِيَ، وَخُذْ بِي سَبِيلَ الصَّاِلحِينَ، وَأَعِنِّي عَلَى نَفْسِي بِما تُعِينُ بِهِ الصَّالِحِينَ عَلَى أَنْفُسِهِمْ، وَاخْتِمْ عَمَلِي بِأَحْسَنِهِ، وَاجْعَلْ ثَوابِي مِنْهُ الْجَنَّةَ بِرَحْمَتِكَ، وَأَعِنِّي عَلَى صالِحِ ما أَعْطَيْتَنِي، وَثَبِّتْنِي، يا رَبِّ، وَلا تَرُدَّنِي فِي سُوءٍ اسْتَنْقَذْتَنِي مِنْهُ، يا رَبَّ الْعالَمِينَ. اللّهُمَّ، إِنِّي أَسْأَلُكَ إِيماناً لا أَجَلَ لَهُ دُونَ لِقائِكَ، أَحْيِنِي ما أَحْيَيْتَنِي عَلَيْهِ، وَتَوَفَّنِي إِذَا تَوَفَّيْتَنِي عَلَيْهِ، وَابْعَثْنِي إِذَا بَعَثْتَنِي عَلَيْهِ، وأَبْرِىءْ قَلْبِي مِنَ الرِّياءِ وَالشَّكِّ وَالسُّمْعَةِ فِي دِينِكَ، حَتَّى يَكُونَ عَمَلِي خالِصاً لَكَ. اللّهُمَّ، أَعْطِنِي بَصِيرَةً فِي دِينِكَ، وَفَهْماً فِي حُكْمِكَ، '
                      'وَفِقْهاً فِي عِلْمِكَ، وَكِفْلَيْنِ مِنْ رَحْمَتِكَ، وَوَرَعاً يَحْجُزُنِي عَنْ مَعاصِيكَ، وَبَيِّضْ وَجْهِي بِنُورِكَ، وَاجْعَلْ رَغْبَتِي فِيما عِنْدَكَ، وَتَوَفَّنِي فِي سَبِيلِكَ وَعَلَى مِلَّةِ رَسُولِكَ صَلَّى اللهُ عَلَيْهِ وَآلِهِ. اللّهُمَّ، إِنِّي أَعُوذُ بِكَ مِنَ الْكَسَلِ وَالْفَشَلِ، وَالْهَمِّ وَالْجُبْنِ وَالْبُخْلِ، وَالْغَفْلَةِ وَالْقَسْوَةِ (والذِلَّةِ) وَالْمَسْكَنَةِ، وَالْفَقْرِ وَالْفاقَةِ، وَكُلِّ بَلِيَّةٍ، وَالْفَواحِشِ ما ظَهَرَ مِنْها وَما بَطَنَ، وَأَعُوذُ بِكَ مِنْ نَفْسٍ لا تَقْنَعُ، وَبَطْنٍ لا يَشْبَعُ، وَقَلْبٍ لا يَخْشَعُ، وَدُعاءٍ لا يُسْمَعُ، وَعَمَلٍ لا يَنْفَعُ. وَأَعُوذُ بِكَ، يا رَبِّ، عَلَى نَفْسِي وَدِينِي وَمالِي، وَعَلَى جَمِيعِ ما رَزَقْتَنِي، مِنَ الشَّيْطانِ الرَّجِيمِ، إِنَّكَ أَنْتَ السَّمِيعُ الْعَلِيمُ. اللّهُمَّ، إِنَّهُ لا يُجِيرُنِي مِنْكَ أَحَدٌ، وَلا أَجِدُ مِنْ دُونِكَ مُلْتَحَداً، فَلا تَجْعَلْ نَفْسِي فِي شَيْءٍ مِنْ عَذابِكَ، وَلا تَرُدَّنِي بِهَلَكَةٍ، وَلا تَرُدَّنِي بِعَذابٍ أَلِيمٍ. اللّهُمَّ، تَقَبَّلْ مِنِّي، وَأَعْلِ ذِكْرِي، وَارْفَعْ دَرَجَتِي، وَحُطَّ وِزْرِي، وَلا تَذْكُرْنِي بِخَطِيئَتِي، وَاجْعَلْ ثَوابَ مَجْلِسِي وَثَوابَ مَنْطِقِي وَثَوابَ دُعائِي رِضاكَ وَالْجَنَّةَ، وَأَعْطِنِي، يا رَبِّ، جَمِيعَ ما سَأَلْتُكَ، وَزِدْنِي مِنْ فَضْلِكَ، إِنِّي إِلَيْكَ راغِبٌ، يا رَبَّ الْعالَمِينَ. اللّهُمَّ، إِنَّكَ أَنْزَلْتَ فِي كِتابِكَ (العَفْوَ وأَمَرْتَنَا) أَنْ نَعْفُوَ عَمَّنْ ظَلَمَنا، وَقَدْ ظَلَمْنا أَنْفُسَنا، فَاعْفُ عَنَّا، فَإِنَّكَ أَوْلَى بِذلِكَ مِنَّا، وَأَمَرْتَنا أَنْ لا نَرُدَّ سائِلاً عَنْ أَبْوابِنا، وَقَدْ جِئْتُكَ سائِلاً، فَلا تَرُدَّنِي إِلّا بِقَضاءِ حاجَتِي. وَأَمَرْتَنا بِالْإِحْسانِ إِلَى ما مَلَكَتْ أَيْمانُنا، وَنَحْنُ '
                      '(والذِلَّةِ) وَالْمَسْكَنَةِ، وَالْفَقْرِ وَالْفاقَةِ، وَكُلِّ بَلِيَّةٍ، وَالْفَواحِشِ ما ظَهَرَ مِنْها وَما بَطَنَ، وَأَعُوذُ بِكَ مِنْ نَفْسٍ لا تَقْنَعُ، وَبَطْنٍ لا يَشْبَعُ، وَقَلْبٍ لا يَخْشَعُ، وَدُعاءٍ لا يُسْمَعُ، وَعَمَلٍ لا يَنْفَعُ. وَأَعُوذُ بِكَ، يا رَبِّ، عَلَى نَفْسِي وَدِينِي وَمالِي، وَعَلَى جَمِيعِ ما رَزَقْتَنِي، مِنَ الشَّيْطانِ الرَّجِيمِ، إِنَّكَ أَنْتَ السَّمِيعُ الْعَلِيمُ. اللّهُمَّ، إِنَّهُ لا يُجِيرُنِي مِنْكَ أَحَدٌ، وَلا أَجِدُ مِنْ دُونِكَ مُلْتَحَداً، فَلا تَجْعَلْ نَفْسِي فِي شَيْءٍ مِنْ عَذابِكَ، وَلا تَرُدَّنِي بِهَلَكَةٍ، وَلا تَرُدَّنِي بِعَذابٍ أَلِيمٍ. اللّهُمَّ، تَقَبَّلْ مِنِّي، وَأَعْلِ ذِكْرِي، وَارْفَعْ دَرَجَتِي، وَحُطَّ وِزْرِي، وَلا تَذْكُرْنِي بِخَطِيئَتِي، وَاجْعَلْ ثَوابَ مَجْلِسِي وَثَوابَ مَنْطِقِي وَثَوابَ دُعائِي رِضاكَ وَالْجَنَّةَ، وَأَعْطِنِي، يا رَبِّ، جَمِيعَ ما سَأَلْتُكَ، وَزِدْنِي مِنْ فَضْلِكَ، إِنِّي إِلَيْكَ راغِبٌ، يا رَبَّ الْعالَمِينَ. اللّهُمَّ، إِنَّكَ أَنْزَلْتَ فِي كِتابِكَ (العَفْوَ وأَمَرْتَنَا) أَنْ نَعْفُوَ عَمَّنْ ظَلَمَنا، وَقَدْ ظَلَمْنا أَنْفُسَنا، فَاعْفُ عَنَّا، فَإِنَّكَ أَوْلَى بِذلِكَ مِنَّا، وَأَمَرْتَنا أَنْ لا نَرُدَّ سائِلاً عَنْ أَبْوابِنا، وَقَدْ جِئْتُكَ سائِلاً، فَلا تَرُدَّنِي إِلّا بِقَضاءِ حاجَتِي. وَأَمَرْتَنا بِالْإِحْسانِ إِلَى ما مَلَكَتْ أَيْمانُنا، وَنَحْنُ أَرِقَّاؤُكَ، فَاعْتِقْ رِقابَنا مِنَ النَّارِ. يا مَفْزَعِي عِنْدَ كُرْبَتِي، وَيا غَوْثِي عِنْدَ شِدَّتِي، إِلَيْكَ فَزِعْتُ، وَبِكَ اسْتَغَثْتُ وَلُذْتُ، لا أَلُوذُ بِسِواكَ، وَلا أَطْلُبُ الْفَرَجَ إِلّا مِنْكَ، فَأَغِثْنِي وَفَرِّجْ عَنِّي (يَا مَنْ يَفُكُّ الأَسِيرَ). يا مَنْ يَقْبَلُ الْيَسِيرَ، وَيَعْفُو عَنِ الْكَثِيرِ، اقْبَلْ مِنِّي الْيَسِيرَ، وَاعْفُ عَنِّي الْكَثِيرَ، إِنَّكَ أَنْتَ الرَّحِيمُ الْغَفُورُ. اللّهُمَّ، إِنِّي أَسْأَلُكَ إِيماناً تُباشِرُ بِهِ قَلْبِي، وَيَقِيناً صادِقاً حَتَّى أَعْلَمَ أَنَّهُ لَنْ يُصِيبَنِي إِلّا ما كَتَبْتَ لِي، وَرَضّنِي مِنَ الْعَيْشِ بِما قَسَمْتَ لِي، يا أَرْحَمَ الرَّاحِمِينَ.',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
            ],
          ),
        ),
        bottomNavigationBar: AddCustomBottomNavigationBar(
          pushNext: Dou3a2Alsa7ar.screenRoute,
          pushBack: Fi2a3mal2as7arRamadan.screenRoute,
          soud: 'https://cdn.jsdelivr.net/gh/SounaDiab/image_audio@master/audio/abi_hamza_alsamali.mp3',
          onTap: (double fontSize) {
            // تحديث حجم الخط
            setState(() {
              isTablet ? _fontSizeTablet = fontSize : _fontSize = fontSize;
            });
            print('fontSize: $fontSize');
            // إغلاق Dialog
            Navigator.of(context).pop();
          },
          onLongPress: () {
            final snackBar = SnackBar(
              content: Center(
                child: Text(
                  '${isTablet ? _fontSizeTablet.toInt() : _fontSize.toInt()}',
                  style: TextStyle(
                    color: Colors.white,
                    fontSize: 16,
                  ),
                ),
              ),
              width: 60,
              behavior: SnackBarBehavior.floating,
              backgroundColor: Colors.blue,
              duration: Duration(seconds: 2),
              shape: ShapeBorder.lerp(
                RoundedRectangleBorder(
                  borderRadius: BorderRadius.circular(50),
                ),
                RoundedRectangleBorder(
                  borderRadius: BorderRadius.circular(50),
                ),
                1,
              ),
            );
            ScaffoldMessenger.of(context).showSnackBar(snackBar);
          },
        ),
      ),
    );
  }
}
