import 'package:flutter/material.dart';
import 'package:maktabat_almoslim/widgets/container_scrollview.dart';
import 'package:provider/provider.dart';
import 'package:shared_preferences/shared_preferences.dart';

import '../../../../widgets/add_custom_bottom_navigation_bar.dart';
import '../../../../widgets/list_of_nine_verses.dart';
import '../../../favorites_provider.dart';
import '../../../favorites_screen.dart';
import '../ziyarat_alhoussein_wa2adabiha.dart';
import 'alsadbi3a_almo5asasa.dart';
import 'alsamina_almo5asasa.dart';

class Alsadbi3aAlmo5asasaAlsania extends StatefulWidget {
  static String screenRoute = 'alsadbi3a_almo5asasa_alsania_screen';
  const Alsadbi3aAlmo5asasaAlsania({super.key});

  @override
  State<Alsadbi3aAlmo5asasaAlsania> createState() =>
      _Alsadbi3aAlmo5asasaAlsaniaState();
}

double _fontSize = 18;
double _fontSizeTablet = 30;

class _Alsadbi3aAlmo5asasaAlsaniaState
    extends State<Alsadbi3aAlmo5asasaAlsania> {
  bool isIcon = true;
  @override
  void initState() {
    super.initState();
    _loadFavoriteState();
  }

  Future<void> _loadFavoriteState() async {
    final prefs = await SharedPreferences.getInstance();
    bool? savedState =
        prefs.getBool('isFavorite_alsadbi3a_almo5asasa_alsania_screen');
    setState(() {
      isIcon = savedState ?? true;
    });
  }

  Future<void> _saveFavoriteState(bool value) async {
    final prefs = await SharedPreferences.getInstance();
    await prefs.setBool(
        'isFavorite_alsadbi3a_almo5asasa_alsania_screen', value);
  }

  Future<bool> _onWillPop() async {
    final args =
        ModalRoute.of(context)!.settings.arguments as Map<String, dynamic>?;
    final previousPage = args?['previousPage'];
    if (previousPage == 'favorite_screen') {
      Navigator.of(context).pushReplacementNamed(FavoritesScreen.screenRoute);
      return false;
    } else {
      Navigator.of(context)
          .pushReplacementNamed(ZiyaratAlhousseinWa2adabiha.screenRoute);
      return false;
    }
  }

  @override
  Widget build(BuildContext context) {
    double size = MediaQuery.of(context).textScaleFactor;
    final screenWidth = MediaQuery.of(context).size.width;
    final isTablet = screenWidth >= 600;
    return WillPopScope(
      onWillPop: _onWillPop,
      child: Scaffold(
        appBar: AppBar(
          toolbarHeight: isTablet ? 100 : 50,
          centerTitle: true,
          leading: IconButton(
            onPressed: _onWillPop,
            icon: Icon(
              Icons.arrow_back,
              size: isTablet ? 50 : 25,
            ),
          ),
          actions: [
            IconButton(
              padding: EdgeInsets.only(left: isTablet ? 50 : 30),
              icon: Icon(
                isIcon ? Icons.favorite_border : Icons.favorite_rounded,
                size: isTablet ? 40 : 25,
                color: isIcon ? Colors.black : Colors.red,
              ),
              onPressed: () async {
                setState(() {
                  isIcon = !isIcon;
                });
                await _saveFavoriteState(isIcon);

                if (!isIcon) {
                  Provider.of<FavoritesProvider>(context, listen: false)
                      .addFavorite(
                          'السابعة المخصوصة: زيارة عاشوراء الثانية غير المشهورة',
                          Alsadbi3aAlmo5asasaAlsania.screenRoute);
                } else {
                  Provider.of<FavoritesProvider>(context, listen: false)
                      .removeFavorite(
                          'السابعة المخصوصة: زيارة عاشوراء الثانية غير المشهورة',
                          Alsadbi3aAlmo5asasaAlsania.screenRoute,
                          Alsadbi3aAlmo5asasaAlsania.screenRoute);
                }
              },
            ),
          ],
          title: Text(
            'السابعة المخصوصة: زيارة عاشوراء الثانية غير المشهورة',
            style: TextStyle(
              fontSize: isTablet
                  ? 40
                  : size > 1.0
                      ? 20
                      : 23,
              fontWeight: FontWeight.bold,
            ),
          ),
        ),
        body: ContainerScrollview(
          widget: Column(
            crossAxisAlignment: CrossAxisAlignment.start,
            children: [
              Container(
                child: Column(
                  children: [
                    Center(
                      child: Text(
                        'بسم الله الرحمن الرحيم',
                        style: TextStyle(
                          fontSize: isTablet ? _fontSizeTablet : _fontSize,
                          fontWeight: FontWeight.w900,
                        ),
                      ),
                    ),
                    Center(
                      child: Text(
                        'اللهم صلِّ على محمد وآل محمد',
                        style: TextStyle(
                          fontSize: isTablet ? _fontSizeTablet : _fontSize,
                          fontWeight: FontWeight.w900,
                        ),
                      ),
                    ),
                  ],
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: '',
                  subtitle:
                      'وهي تناظر الزّيارة المشهُورة المتداولة في الاجر والثّواب خلوّاً من عناء اللّعن والسّلام مائة مرّة، وهي فوز عظيم لمن يشغله عن تلك الزّيارة شاغل هام، وكيفيّتها على ما في كتاب المزار القديم من دون الشّرح كما يلي : من أحبّ أن يزوره (عليه السلام) من بُعد البلاد أو قُربها فليغتسل ويبرز الى الصّحراء أو يصعد سطح داره فيصلّي ركعتين يقرأ فيهما سورة قُلْ هُوَ اللهُ اَحَدٌ فاذا سلّم أومأ اليه بالسّلام وليتوجّه بالسّلام والايماء والنيّة الى جهة قبر أبي عبد الله الحسين (عليه السلام) ، ثمّ يقول بخشوع واستكانة :\n\n'
                      'اَلسَّلامُ عَلَيْكَ يَا بْنَ رَسُولِ اللهِ، اَلسَّلامُ عَلَيْكَ يَا بْنَ الْبَشيرِ النَّذيرِ وَابْنَ سَيِّدِ الْوَصِيّينَ، اَلسَّلامُ عَلَيْكَ يَا بْنَ فاطِمَةَ سَيِّدَةِ نِساءِ الْعالَمينَ، اَلسَّلامُ عَلَيْكَ يا خِيَرَةِ اللهِ وَابْنَ خِيَرَتِهِ، اَلسَّلامُ عَلَيْكَ يا ثارَ اللهِ وَابْنَ ثارِهِ، اَلسَّلامُ عَلَيْكَ اَيُّهَا الْوِتْرُ الْمَوْتُور، اَلسَّلامُ عَلَيْكَ اَيُّهَا الاِْمامُ الْهادِي الزَّكيُّ وَعَلى اَرْواح حَلَّتْ بِفَنائِكَ وَاَقامَتْ فِي جَوارِكَ وَوَفَدَتْ مَعَ زُوّارِكَ، اَلسَّلامُ عَلَيْكَ مِنّي ما بَقيتُ وَبَقِيَ اللَّيْلُ وَالنَّهارُ، فَلَقَدْ عَظُمَتْ بِكَ الرَّزِيَّةُ وَجَلَّتْ فِي الْمُؤْمِنينَ وَالْمُسْلِمينَ وَفِي اَهْلِ السَّماواتِ وَاَهْلِ الاَْرَضينَ اَجْمَعينَ، فَاِنّا للهِ وَاِنّا اِلَيْهِ راجِعُونَ صَلَواتُ اللهِ وَبَرَكاتُهُ وَتَحِيّاتُهُ عَلَيْكَ يا اَبا عَبْدِاللهِ الْحُسَيْنَ وَعَلى آبائِكَ الطَّيِّبينَ الْمُنْتَجَبينَ وَعَلى ذُرِّيّاتِكُمُ الْهُداةِ الْمَهْدِيّينَ، لَعَنَ اللهُ اُمَّةً خَذَلَتْكَ وَتَرَكَتْ نُصْرَتَكَ وَمَعُونَتَكَ، وَلَعَنَ اللهُ اُمَّةً اَسَّسَتْ اَساسَ الظُّلْمِ لَكُمْ وَمَهَّدَتِ الْجَوْرَ عَلَيْكُمْ، وَطَرَّقَتْ اِلى اَذِيَّتِكُمْ وَتَحَيُّفِكُمْ وَجارَتْ ذلِكَ فِي دِيارِكُمْ وَاَشْياعِكُمْ، بَرِئْتُ اِلَى اللهِ عَزَّوَجَلَّ وَاِلَيْكُمْ يا '
                      'ساداتي وَمَوالِيَّ وَاَئِمَّتي مِنْهُمْ وَمِنْ اَشْياعِهِمْ وَاَتْباعِهِمْ وَاَسْألُ اللهَ الذي أَكْرَمَ يا مَوالِيَّ مَقامَكُمْ وَشَرَّفَ مَنْزِلَتَكُمْ وَشَأنَكُمْ اَنْ يُكْرِمَني بِوِلايَتِكُمْ وَمَحَبَّتِكُمْ وَالاْئتِمامِ بِكُمْ وَبِالْبَراءَةِ مِنْ اَعْدائِكُمْ وَاَسْألُ اللهَ الْبَرَّ الرَّحيمَ اَنْ يَرْزُقَني مَوَدَّتَكُمْ، وَاَنْ يُوَفِّقَني لِلطَّلَبِ بِثارِكُمْ مَعَ الاِْمامِ الْمُنْتَظَرِ الْهادي مِنْ آلِ مُحَمَّد، وَاَنْ يَجْعَلَني مَعَكُمْ فِي الدُّنْيا وَالاْخِرَةِ، وَاَنْ يُبَلِّغَنِي الْمَقامَ الَْمحْمُودَ لَكُمْ عِنْدَ اللهِ وَاَسْألُ اللهَ عَزَّوَجَلَّ بِحَقِّكُمْ وَبِالشَّأْنِ الَّذي جَعَلَ اللهُ لَكُمْ اَنْ يُعْطِيَني بِمُصابي بِكُمْ اَفْضَلَ ما اَعْطى مُصاباً بِمُصيبَة، اِنّا للهِ وَاِنّا اِلَيْهِ راجِعُونَ، يا لَها مِنْ مُصيبَة ما اَفْجَعَها وَاَنْكاها لِقُلُوبِ الْمُؤْمِنينَ وَالْمُسْلِمينَ، فَاِنّا للهِ وَاِنّا اِلَيْهِ راجِعُونَ، اَللّـهُمَّ صَلِّ عَلى مُحَمَّد وَآلِ مُحَمَّد وَاجْعَلْني فِي مَقامي مِمَّنْ تَنالُهُ مِنْكَ '
                      'صَلَواتٌ وَرَحْمَةٌ وَمَغْفِرَةٌ وَاجْعَلْني عِنْدَكَ وَجيهاً فِي الدُّنْيا وَالاْخِرَةِ وَمِنَ الْمُقَرَّبينَ، فَاِنّي اَتَقَرَّبُ اِلَيْكَ بِمُحَمَّد وَآلِ مُحَمَّد صَلَواتُكَ عَلَيْهِ وَعَلَيْهِمْ اَجْمَعينَ، اَللّـهُمَّ وَاِنّي اَتَوَسَّلُ وَاَتَوَجَّهُ بِصَفْوَتِكَ مِنْ خَلْقِكَ وَخِيَرَتِكَ مِنْ خَلْقِكَ مُحَمَّد وَعَلِيٍّ وَالطَّيّبينَ مِنْ ذُرّيَّتِهِما، اَللّـهُمَّ فَصَلِّ عَلى مُحَمَّد وَآلِ مُحَمَّد وَاجْعَلْ مَحْياىَ مَحْياهُمْ وَمَماتي مَماتَهُمْ وَلا تُفَرِّقْ بَيْني وَبَيْنَهُمْ فِي الدُّنْيا وَالاْخِرَةِ اِنَّكَ سَميعُ الدُّعاءِ، اَللّـهُمَّ وَهذا يَوْمٌ تُجَدَّدُ فيهِ النِّقْمَةُ وَتُنَزَّلَ فيهِ اللَّعْنَةُ عَلَى اللَّعينِ يَزيدَ وَعَلى آلِ يَزيدَ وَعَلى آلِ زِياد وَعُمَرَ بْنِ '
                      'سَعْد وَالشِّمْرِ، اَللّـهُمَّ الْعَنْهُمْ وَالْعَنْ مَنْ رَضِيَ بِقَوْلِهِمْ وَفِعْلِهِمْ مِنْ اَوَّل وَآخِر لَعْناً كَثيراً وَاَصْلِهِمْ حَرَّ نارِكَ، وَاَسْكِنْهُمْ جَهَنَّمَ وَساءَتْ مَصيراً وَاَوْجِبْ عَلَيْهِمْ وَعَلى كُلِّ مَنْ شايَعَهُمْ وَبايَعَهُمْ وَتابَعَهُمْ وَساعَدَهُمْ وَرَضِيَ بِفِعْلِهِمْ وَافْتَحْ لَهُمْ وَعَلَيْهِمْ وَعَلى كُلِّ مَنْ رَضِيَ بِذلِكَ لَعَناتِكَ الَّتي لَعَنْتَ بِها كُلَّ ظالِم وَكُلَّ غاصِب وَكُلَّ جاحِد وَكُلَّ كافِر وَكُلَّ مُشْرِك وَكُلَّ شَيْطان رَجيم وَكُلَّ جَبّار عَنيد، اَللّـهُمَّ الْعَنْ يَزيدَ وَآلَ يَزيدَ وَبَني مَرْوانَ جَميعاً، '
                      'اَللّـهُمَّ وَضَعِّفْ غَضَبَكَ وَسَخَطَكَ وَعَذابَكَ وَنَقِمَتَكَ عَلى اَوَّلِ ظالِم ظَلَمَ اَهْلَ بَيْتِ نَبِيِّكَ، اَللّـهُمَّ وَالْعَنْ جَميعَ الظّالِمينَ لَهُمْ وَانْتَقِمْ مِنْهُمْ اِنَّكَ ذوُ نِقْمَة مِنَ الُْمجْرِمينَ، اَللّـهُمَّ وَالْعَنْ اَوَّلَ ظالِم ظَلَمَ آلَ بَيْتِ مُحَمَّد، وَالْعَنْ اَرْواحَهُمْ وَدِيارَهُمْ وَقُبُورَهُمْ، وَالْعَنِ اللّهُمَّ الْعِصابَةَ الَّتي نازَلَتِ الْحُسَيْنِ بْنِ بِنْتَ نَبِيِّكَ وَحارَبَتْهُ وَقَتَلَتْ اَصْحابَهُ وَاَنْصارَهُ وَاَعْوانَهُ وَاَوْلِيائَهُ وَشيعَتَهُ وَمُحِبّيهِ وَاَهْلَ بَيْتِهِ وَذُرِّيَتَهُ، وَالْعَنِ اَللّـهُمَّ الَّذينَ نَهَبُوا مالَهُ وَسَلَبُوا حَريمَهُ وَلَمْ يَسْمَعُوا كَلامَهُ وَلا مَقالَهُ، اللّهُمَّ وَالْعَنْ كُلَّ مَنْ بَلَغَهُ ذلِكَ فَرَضِيَ بِهِ مِنَ الاَْوَّلينَ وَالاْخِرينَ وَالْخَلائِقِ اَجْمَعينَ اِلى يَوْمِ الدّينِ، اَلسَّلامُ عَلَيْكَ يا اَبا عَبْدِاللهِ الْحُسَيْنَ وَعَلى مَنْ ساعَدَكَ وَعاوَنَكَ وَواساكَ بِنَفْسِهِ وَبَذَلَ مُهْجَتَهُ فِي الذَّبِّ عَنْكَ، السَّلامُ عَلَيْكَ يا '
                      'مَوْلايَ وَعَلَيْهِمْ وَعَلى رُوحِكَ وَعَلى اَرْواحِهِمْ وَعَلى تُرْبَتِكَ وَعَلى تُرْبَتِهِمْ، اَللّـهُمَّ لَقِّهِمْ رَحْمَةً وَرِضْواناً وَروُحاً وَرَيْحانا، السَّلامُ عَلَيْكَ يا مَوْلايَ يا اَبا عَبْدِاللهِ يَا بْنَ خاتَمِ النَّبِيّينَ وَيَا بْنَ سَيِّدِ الْوَصِيّينَ، وَيَا بْنَ سَيِّدَةِ نِساءِ الْعالَمينَ، السَّلامُ عَلَيْكَ يا شَهيدُ يَا بْنَ الشَّهيدِ، اَللّـهُمَّ بَلّغْهُ عَنّي فِي هذِهِ السّاعَةِ وَفِي هذَا الْيَوْمِ وَفِي هذَا الْوَقْتِ وَكُلِّ وَقْت تَحِيَّةً وَسَلاماً، السَّلامُ عَلَيْكَ يَا بْنَ سَيِّدِ الْعالَمينَ وَعَلَى الْمُسْتَشْهَدينَ مَعَكَ سَلاماً مُتَّصِلاً مَا اتَّصَلَ اللَّيْلُ وَالنَّهارُ، السَّلامُ عَلَى الْحُسَيْنِ بْنِ عَلِىِّ الشَّهيدِ، السَّلامُ على عليِّ بنِ الحُسَينِ الشَهيد، السَّلامُ على العباسِ بنِ أميرِ المؤمِنينَ الشَهيدِ، السَّلامُ عَلَى الشُّهَداءِ مِنْ وُلْدِ اَميرِ '
                      'الْمُؤْمِنينَ، السَّلامُ عَلَى الشُّهَداءِ مِنْ وُلْدِ جَعْفَر وَعَقيل، السَّلامُ عَلى كُلِّ مُسْتَشْهَد مِنَ الْمُؤْمِنينَ، اَللّـهُمَّ صَلِّ عَلى مُحَمَّد وَآلِ مُحَمَّد وَبَلِّغْهُمْ عَنّي تَحِيَّةً وَسَلاماً، السَّلامُ عَلَيْكَ يا رَسُولَ اللهِ وَعَلَيْكَ السَّلامُ وَرَحْمَةُ اللهِ وَبَرَكاتُهُ، اَحْسَنَ اللهُ لَكَ الْعَزاءَ فِي وَلَدِكَ الْحُسَيْنِ عَلَيْهِ السَّلامُ السَّلامُ عَلَيْكَ يا اَبَا الْحَسَنِ يا اَميرَ الْمُؤْمِنينَ وَعَلَيْكَ السَّلامُ وَرَحْمَةُ اللهِ وَبَرَكاتُهُ، اَحْسَنَ اللهُ لَكَ الْعَزاءَ فِي وَلَدِكَ الْحُسَيْنِ السَّلامُ عَلَيْكِ يا فاطِمَةُ يا بِنْتَ رَسُولِ رَبِّ الْعالَمينَ وَعَلَيْكِ السَّلامُ وَرَحْمَةُ اللهِ وَبَرَكاتُهُ، اَحْسَنَ اللهُ لَكِ الْعَزاءَ فِي وَلَدِكِ الْحُسَيْنِ، السَّلامُ عَلَيْكَ يا اَبا مُحَمَّد الْحَسَنَ '
                      'وَعَلَيْكَ السَّلامُ وَرَحْمَةُ اللهِ وَبَرَكاتُهُ، اَحْسَنَ اللهُ لَكَ الْعَزاءَ فِي اَخيكَ الْحُسَيْنِ، السَّلامُ عَلى اَرْواحِ الْمُؤْمِنينَ وَالْمُؤْمِناتِ الاَْحْياءِ مِنْهُمْ وَالاَْمْواتِ وَعَلَيْهِمُ السَّلامُ وَرَحْمَةُ اللهِ وَبَرَكاتُهُ، اَحْسَنَ اللهُ لَهُمُ الْعَزاءَ فِي مَوْلاهُمُ الْحُسَيْنِ، اللّهُمَّ اجْعَلْنا مِنَ الطّالِبينَ بِثارِهِ مَعَ اِمام عَدْل تُعِزُّ بِهِ الاِْسْلامَ وَاَهْلَهُ يا رَبَّ الْعالَمينَ.\n\n'
                      'ثمّ اسجد وقل :\n\n'
                      'اَللّـهُمَّ لَكَ الْحَمْدُ عَلى جَميعِ ما نابَ مِنْ خَطْب، وَلَكَ الْحَمْدُ عَلى كُلِّ اَمْر، وَإلَيْكَ الْمُشْتَكى فِي عَظيمِ الْمُهِمّاتِ بِخِيَرَتِكَ وَاَوْلِيائِكَ وَذلِكَ لِما اَوْجَبْتَ لَهُمْ مِنَ الْكَرامَةِ وَالْفَضْلِ الْكَثيرِ، اَللّـهُمَّ فَصَلِّ عَلى مُحَمَّد وَآلِ مُحَمَّد وَارْزُقْني شَفاعَةَ الْحُسَيْنِ عَلَيْهِ السَّلامُ يَوْمَ الْوُرُودِ وَالْمَقامِ الْمَشْهُودِ وَالْحَوْضِ الْمَوْرُودِ، وَاجْعَلْ لي قَدَمَ صِدْق عِنْدَكَ مَعَ الْحُسَيْنِ وَاَصْحابِ الْحُسَيْنِ عَلَيْهِ السَّلامُ الَّذينَ واسَوْهُ بِاَنْفُسِهِمْ وَبَذَلُو دُونَهُ مُهَجَهُمْ وَجاهَدوُا مَعَهُ اَعْداءَكَ ابْتِغاءَ مَرْضاتِكَ وَرَجاءَكَ وَتَصْديقاً بِوَعْدِكَ وَخَوْفاً مِنْ وَعيدِكَ اِنَّكَ لَطيفٌ لِما تَشاءُ يا اَرْحَمَ الرّاحِمينَ.',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
            ],
          ),
        ),
        bottomNavigationBar: AddCustomBottomNavigationBar(
          pushNext: AlsaminaAlmo5asasa.screenRoute,
          pushBack: Alsadbi3aAlmo5asasa.screenRoute,
          soud: 'https://cdn.jsdelivr.net/gh/SounaDiab/image_audio@master/audio/السابعة المخصصة الثانية.mp3',
          onTap: (double fontSize) {
            // تحديث حجم الخط
            setState(() {
              isTablet ? _fontSizeTablet = fontSize : _fontSize = fontSize;
            });
            print('fontSize: $fontSize');
            // إغلاق Dialog
            Navigator.of(context).pop();
          },
          onLongPress: () {
            final snackBar = SnackBar(
              content: Center(
                child: Text(
                  '${isTablet ? _fontSizeTablet.toInt() : _fontSize.toInt()}',
                  style: TextStyle(
                    color: Colors.white,
                    fontSize: 16,
                  ),
                ),
              ),
              width: 60,
              behavior: SnackBarBehavior.floating,
              backgroundColor: Colors.blue,
              duration: Duration(seconds: 2),
              shape: ShapeBorder.lerp(
                RoundedRectangleBorder(
                  borderRadius: BorderRadius.circular(50),
                ),
                RoundedRectangleBorder(
                  borderRadius: BorderRadius.circular(50),
                ),
                1,
              ),
            );
            ScaffoldMessenger.of(context).showSnackBar(snackBar);
          },
        ),
      ),
    );
  }
}
