import 'package:flutter/material.dart';
import 'package:maktabat_almoslim/widgets/container_scrollview.dart';
import 'package:provider/provider.dart';
import 'package:shared_preferences/shared_preferences.dart';

import '../../../../widgets/add_custom_bottom_navigation_bar.dart';
import '../../../../widgets/list_of_nine_verses.dart';
import '../../../favorites_provider.dart';
import '../../../favorites_screen.dart';
import '../ziyarat_alhoussein_wa2adabiha.dart';
import 'alsadbi3a_almo5asasa_alsania.dart';
import 'alsadisa_almo5asasa.dart';

class Alsadbi3aAlmo5asasa extends StatefulWidget {
  static String screenRoute = 'alsadbi3a_almo5asasa_screen';
  const Alsadbi3aAlmo5asasa({super.key});

  @override
  State<Alsadbi3aAlmo5asasa> createState() => _Alsadbi3aAlmo5asasaState();
}

double _fontSize = 18;
double _fontSizeTablet = 30;

class _Alsadbi3aAlmo5asasaState extends State<Alsadbi3aAlmo5asasa> {
  bool isIcon = true;
  @override
  void initState() {
    super.initState();
    _loadFavoriteState();
  }

  Future<void> _loadFavoriteState() async {
    final prefs = await SharedPreferences.getInstance();
    bool? savedState = prefs.getBool('isFavorite_alsadbi3a_almo5asasa_screen');
    setState(() {
      isIcon = savedState ?? true;
    });
  }

  Future<void> _saveFavoriteState(bool value) async {
    final prefs = await SharedPreferences.getInstance();
    await prefs.setBool('isFavorite_alsadbi3a_almo5asasa_screen', value);
  }

  Future<bool> _onWillPop() async {
    final args =
        ModalRoute.of(context)!.settings.arguments as Map<String, dynamic>?;
    final previousPage = args?['previousPage'];
    if (previousPage == 'favorite_screen') {
      Navigator.of(context).pushReplacementNamed(FavoritesScreen.screenRoute);
      return false;
    } else {
      Navigator.of(context)
          .pushReplacementNamed(ZiyaratAlhousseinWa2adabiha.screenRoute);
      return false;
    }
  }

  @override
  Widget build(BuildContext context) {
    double size = MediaQuery.of(context).textScaleFactor;
    final screenWidth = MediaQuery.of(context).size.width;
    final isTablet = screenWidth >= 600;
    return WillPopScope(
      onWillPop: _onWillPop,
      child: Scaffold(
        appBar: AppBar(
          toolbarHeight: isTablet ? 100 : 50,
          centerTitle: true,
          leading: IconButton(
            onPressed: _onWillPop,
            icon: Icon(
              Icons.arrow_back,
              size: isTablet ? 50 : 25,
            ),
          ),
          actions: [
            IconButton(
              padding: EdgeInsets.only(left: isTablet ? 50 : 30),
              icon: Icon(
                isIcon ? Icons.favorite_border : Icons.favorite_rounded,
                size: isTablet ? 40 : 25,
                color: isIcon ? Colors.black : Colors.red,
              ),
              onPressed: () async {
                setState(() {
                  isIcon = !isIcon;
                });
                await _saveFavoriteState(isIcon);

                if (!isIcon) {
                  Provider.of<FavoritesProvider>(context, listen: false)
                      .addFavorite(
                          'السابعة المخصوصة: زيارة عاشوراء الزيارة الأولى',
                          Alsadbi3aAlmo5asasa.screenRoute);
                } else {
                  Provider.of<FavoritesProvider>(context, listen: false)
                      .removeFavorite(
                          'السابعة المخصوصة: زيارة عاشوراء الزيارة الأولى',
                          Alsadbi3aAlmo5asasa.screenRoute,
                          Alsadbi3aAlmo5asasa.screenRoute);
                }
              },
            ),
          ],
          title: Text(
            'السابعة المخصوصة: زيارة عاشوراء الزيارة الأولى',
            style: TextStyle(
              fontSize: isTablet
                  ? 40
                  : size > 1.0
                      ? 20
                      : 23,
              fontWeight: FontWeight.bold,
            ),
          ),
        ),
        body: ContainerScrollview(
          widget: Column(
            crossAxisAlignment: CrossAxisAlignment.start,
            children: [
              Container(
                child: Column(
                  children: [
                    Center(
                      child: Text(
                        'بسم الله الرحمن الرحيم',
                        style: TextStyle(
                          fontSize: isTablet ? _fontSizeTablet : _fontSize,
                          fontWeight: FontWeight.w900,
                        ),
                      ),
                    ),
                    Center(
                      child: Text(
                        'اللهم صلِّ على محمد وآل محمد',
                        style: TextStyle(
                          fontSize: isTablet ? _fontSizeTablet : _fontSize,
                          fontWeight: FontWeight.w900,
                        ),
                      ),
                    ),
                  ],
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: '',
                  subtitle:
                      'ممّا أردنا ايرداه هُنا هي زيارة عاشوراء المشهورة ويُزار بها من قرب ومن بُعد، وروايتها المشروحة كما رواها الشّيخ أبو جعفر الطّوسي في المصباح ما يلي : روى محمّد بن اسماعيل بن بزيع، عن صالح بن عقبة، عن أبيه، عن الباقر (عليه السلام)قال : من زار الحسين بن عليّ (عليهما السلام) في يوم عاشوراء من المحرّم يظل عنده باكياً لقى الله عزّوجل يوم يلقاه بثواب ألفي حجّة وألفي عُمرة وألفي غزوة كثواب من حجّ واعتمر وغزا مع رسُول الله (صلى الله عليه وآله وسلم) ومع الائمّة الرّاشدين ، قال : قلت : جعلت فداك فما لمن كان في بعيد البلاد وأقاصيها ولم يمكنه المسير اليه في ذلك اليوم ؟ قال : اذا كان كذلك برز الى الصّحراء أو صعد سطحاً مرتفعاً في داره وأومأ اليه بالسّلام واجتهد في الدّعاء على قاتليه وصلّى من بُعد ركعتين وليكن ذلك في صدر النّهار قبل أن تزُول '
                      'الشّمس ثمّ ليندب الحسين (عليه السلام) ويبكيه ويأمر من في داره ممّن لا يتّقيه بالبكاء عليه ويقم في داره المُصيبة باظهار الجزع عليه وليعزّ فيها بعضهم بعضاً بمصابهم بالحسين (عليه السلام)وأنا الضّامن لهم اذا فعلوا ذلك جميع ذلك ، قلت : جعلت فداك أنت الضّامن ذلك لهم والزّعيم ؟ قال : أنا الضّامن وأنا الزّعيم لمن فعل ذلك . قلت : فكيف يعزّي بعضنا بعضاً ؟ قال : تقولون : اَعْظَمَ اللهُ اُجُورَنا بِمُصابِنا بِالْحُسَيْنِ عَلَيْهِ السَّلامُ وَجَعَلَنا وَاِيّاكُمْ مِنَ الطّالِبينَ بِثارِهِ مَعَ وَلِيِّهِ الاِْمامِ الْمَهْدِيِّ مِنْ آلِ مُحَمَّد عَلَيْهِمُ السَّلامُ، وان استطعت أن لا تخرج في يومك في '
                      'الشّمس ثمّ ليندب الحسين (عليه السلام) ويبكيه ويأمر من في داره ممّن لا يتّقيه بالبكاء عليه ويقم في داره المُصيبة باظهار الجزع عليه وليعزّ فيها بعضهم بعضاً بمصابهم بالحسين (عليه السلام)وأنا الضّامن لهم اذا فعلوا ذلك جميع ذلك ، قلت : جعلت فداك أنت الضّامن ذلك لهم والزّعيم ؟ قال : أنا الضّامن وأنا الزّعيم لمن فعل ذلك . قلت : فكيف يعزّي بعضنا بعضاً ؟ قال : تقولون : اَعْظَمَ اللهُ اُجُورَنا بِمُصابِنا بِالْحُسَيْنِ عَلَيْهِ السَّلامُ وَجَعَلَنا وَاِيّاكُمْ مِنَ الطّالِبينَ بِثارِهِ مَعَ وَلِيِّهِ الاِْمامِ الْمَهْدِيِّ مِنْ آلِ مُحَمَّد عَلَيْهِمُ السَّلامُ، وان استطعت أن لا تخرج في يومك في.\n\n'
                      'قال صالح بن عقبة وسيف بن عميرة : قال علقمة بن محمّد الحضرمي : قلت للباقر صلوات الله وسلامه عليه : علّمني دعاءً أدعو به في ذلك اليوم اذا أنا زُرته من قُرب ودعاءاً أدعو به اذا لم أزره من قُرب وأومأت من بُعد البلاد ومن داري بالسّلامة اليه . فقال لي : يا علقمة اذا أنت صلّيت الرّكعتين بعد أن تؤمي اليه بالسّلام فقل بعد الايماء اليه من بعد التّكبير هذا القول (أي الزّيارة الاتية) فانّك اذا قُلت ذلك فقد دعوت بما يدعُو به زوّاره من الملائكة وكتب الله لك مائة ألف ألف درجة وكنت كمن استشهدوا معه تشاركهم في درجاتهم، وما عرفت الاّ في زُمرة الشّهداء الّذين استشهدوا معه وكتب لك ثواب زيارة كلّ نبيّ وكُلّ رسُول وزيارة كلّ من زار الحسين (عليه السلام)منذ يوم قُتل سلام الله عليه وعلى أهل بيته . تقول :\n\n'
                      'اَلسَّلامُ عَلَيْكَ يا اَبا عَبْدِاللهِ، اَلسَّلامُ عَلَيْكَ يَا بْنَ رَسُولِ اللهِ(السَّلامُ عَلَيكَ يا خِيَرَةِ اللهِ وابْنَ خَيرَتِهِ) اَلسَّلامُ عَلَيْكَ يَا بْنَ اَميرِ الْمُؤْمِنينَ وَابْنَ سَيِّدِ الْوَصِيّينَ، اَلسَّلامُ عَلَيْكَ يَا بْنَ فاطِمَةَ سَيِّدَةِ نِساءِ الْعالَمينَ، اَلسَّلامُ عَلَيْكَ يا ثارَ اللهِ وَابْنَ ثارِهِ وَالْوِتْرَ الْمَوْتُورَ، اَلسَّلامُ عَلَيْكَ وَعَلَى الاَْرْواحِ الَّتي حَلَّتْ بِفِنائِكَ عَلَيْكُمْ مِنّي جَميعاً سَلامُ اللهِ اَبَداً ما بَقيتُ وَبَقِىَ اللَّيْلُ وَالنَّهارُ، يا اَبا عَبْدِاللهِ لَقَدْ عَظُمَتِ الرَّزِيَّةُ وَجَلَّتْ وَعَظُمَتِ الْمُصيبَةُ بِكَ عَلَيْنا وَعَلى جَميعِ اَهْلِ الاِْسْلامِ وَجَلَّتْ وَعَظُمَتْ مُصيبَتُكَ فِي السَّماواتِ عَلى جَميعِ اَهْلِ السَّماواتِ، فَلَعَنَ اللهُ اُمَّةً اَسَّسَتْ اَساسَ الظُّلْمِ وَالْجَوْرِ عَلَيْكُمْ اَهْلَ الْبَيْتِ، وَلَعَنَ اللهُ اُمَّةً دَفَعَتْكُمْ عَنْ مَقامِكُمْ وَاَزالَتْكُمْ عَنْ مَراتِبِكُمُ الَّتي رَتَّبَكُمُ اللهُ فيها، وَلَعَنَ '
                      'اللهُ اُمَّةً قَتَلَتْكُمْ وَلَعَنَ اللهُ الْمُمَهِّدينَ لَهُمْ بِالَّتمْكينِ مِنْ قِتالِكُمْ، بَرِئْتُ اِلَى اللهِ وَاِلَيْكُمْ مِنْهُمْ وَمِنْ اَشْياعِهِمْ وَاَتْباعِهِمْ وَاَوْلِيائِهِم، يا اَبا عَبْدِاللهِ اِنّي سِلْمٌ لِمَنْ سالَمَكُمْ وَحَرْبٌ لِمَنْ حارَبَكُمْ اِلى يَوْمِ الْقِيامَةِ، وَلَعَنَ اللهُ آلَ زِياد وَآلَ مَرْوانَ، وَلَعَنَ اللهُ بَني اُمَيَّةَ قاطِبَةً، وَلَعَنَ اللهُ ابْنَ مَرْجانَةَ، وَلَعَنَ اللهُ عُمَرَ بْنَ سَعْد، وَلَعَنَ اللهُ شِمْراً، وَلَعَنَ اللهُ اُمَّةً اَسْرَجَتْ وَاَلْجَمَتْ وَتَنَقَّبَتْ لِقِتالِكَ، بِاَبي اَنْتَ وَاُمّي لَقَدْ عَظُمَ مُصابي بِكَ فَاَسْأَلُ اللهَ الَّذي كْرَمَ مَقامَكَ وَاَكْرَمَني اَنْ يَرْزُقَني طَلَبَ ثارِكَ مَعَ اِمام مَنْصُور مِنْ اَهْلِ بَيْتِ مُحَمَّد صَلَّى اللهُ عَلَيْهِ وَآلِهِ، اَللّـهُمَّ اجْعَلْني عِنْدَكَ '
                      'وَجيهاً بِالْحُسَيْنِ عَلَيْهِ السَّلامُ فِي الدُّنْيا وَالاْخِرَةِ، يا اَبا عَبْدِاللهِ اِنّي اَتَقَرَّبُ اِلى اللهِ وَ اِلى رَسُولِهِ وَاِلى اَميرِ الْمُؤْمِنينَ وَاِلى فاطِمَةَ وَاِلَى الْحَسَنِ وَاِلَيْكَ بِمُوالاتِكَ وَبِالْبَراءَةِ (مِمَّنْ قاتَلَكَ وَنَصَبَ لَكَ الْحَرْبَ وَبِالْبَراءَةِ مِمَّنْ اَسَسَّ اَساسَ الظُّلْمِ وَالْجَوْرِ عَلَيْكُمْ وَاَبْرَأُ اِلَى اللهِ وَاِلى رَسُولِهِ) مِمَّنْ اَسَسَّ اَساسَ ذلِكَ وَبَنى عَلَيْهِ بُنْيانَهُ وَجَرى فِي ظُلْمِهِ وَجَوْرِهِ عَلَيْكُمْ وَعلى اَشْياعِكُمْ، بَرِئْتُ اِلَى اللهِ وَاِلَيْكُمْ مِنْهُمْ وَاَتَقَرَّبُ اِلَى اللهِ ثُمَّ اِلَيْكُمْ بِمُوالاتِكُمْ وَمُوالاةِ وَلِيِّكُمْ وَبِالْبَراءَةِ مِنْ اَعْدائِكُمْ وَالنّاصِبينَ لَكُمُ الْحَرْبَ وَبِالْبَراءَةِ مِنْ اَشْياعِهِمْ وَاَتْباعِهِمْ، اِنّي سِلْمٌ لِمَنْ سالَمَكُمْ وَحَرْبٌ لِمَنْ حارَبَكُمْ وَوَلِىٌّ لِمَنْ والاكُمْ وَعَدُوٌّ لِمَنْ عاداكُمْ فَاَسْأَلُ اللهَ الَّذي أكْرَمَني بِمَعْرِفَتِكُمْ وَمَعْرِفَةِ اَوْلِيائِكُمْ وَرَزَقَنِى الْبَراءَةَ مِنْ اَعْدائِكُمْ اَنْ يَجْعَلَني مَعَكُمْ فِي الدُّنْيا '
                      'وَالاْخِرَةِ وَاَنْ يُثَبِّتَ لي عِنْدَكُمْ قَدَمَ صِدْق فِي الدُّنْيا وَالاْخِرَةِ وَاَسْأَلُهُ اَنْ يُبَلِّغَنِى الْمَقامَ الَْمحْمُودَ لَكُمْ عِنْدَ اللهِ وَاَنْ يَرْزُقَني طَلَبَ ثاري مَعَ اِمام هُدىً ظاهِر ناطِق بِالْحَقِّ مِنْكُمْ وَاَسْألُ اللهَ بِحَقِّكُمْ وَبِالشَّأنِ الَّذي لَكُمْ عِنْدَهُ اَنْ يُعْطِيَني بِمُصابي بِكُمْ اَفْضَلَ ما يُعْطي مُصاباً بِمُصيبَتِهِ مُصيبَةً ما اَعْظَمَها وَاَعْظَمَ رَزِيَّتَها فِي الاِْسْلامِ وَفِي جَميعِ السَّماواتِ وَالاْرْضِ اَللّـهُمَّ اجْعَلْني فِي مَقامي هذا مِمَّنْ تَنالُهُ مِنْكَ صَلَواتٌ وَرَحْمَةٌ وَمَغْفِرَةٌ، اَللّـهُمَّ اجْعَلْ مَحْياىَ مَحْيا مُحَمَّد وَآلِ مُحَمَّد وَمَماتي مَماتَ مُحَمَّد وَآلِ مُحَمَّد، اَللّـهُمَّ اِنَّ هذا يَوْمٌ تَبَرَّكَتْ بِهِ بَنُو اُمَيَّةَ وَابْنُ آكِلَةِ الاَْكبادِ اللَّعينُ ابْنُ اللَّعينِ عَلى لِسانِكَ وَلِسانِ نَبِيِّكَ صَلَّى اللهُ عَلَيْهِ وَآلِهِ فِي كُلِّ مَوْطِن وَمَوْقِف وَقَفَ فيهِ نَبِيُّكَ صَلَّى اللهُ عَلَيْهِ وَآلِهِ، اَللّـهُمَّ الْعَنْ اَبا سُفْيانَ وَمُعاوِيَةَ وَيَزيدَ ابْنَ مُعاوِيَةَ عَلَيْهِمْ مِنْكَ اللَّعْنَةُ اَبَدَ الاْبِدينَ، وَهذا يَوْمٌ فَرِحَتْ بِهِ آلُ زِياد وَآلُ مَرْوانَ '
                      'بِقَتْلِهِمُ الْحُسَيْنَ صَلَواتُ اللهِ عَلَيْهِ، اَللّـهُمَّ فَضاعِفْ عَلَيْهِمُ اللَّعْنَ مِنْكَ وَالْعَذابَ (الاَْليمَ) اَللّـهُمَّ اِنّي اَتَقَرَّبُ اِلَيْكَ فِي هذَا الْيَوْمِ وَفِي مَوْقِفي هذا وَاَيّامِ حَياتي بِالْبَراءَةِ مِنْهُمْ وَاللَّعْنَةِ عَلَيْهِمْ وَبِالْمُوالاةِ لِنَبِيِّكَ وَآلِ نَبِيِّكَ عَلَيْهِ وَعَلَيْهِمُ اَلسَّلامُ ثمّ تقول مائة مرّة : اَللّـهُمَّ الْعَنْ اَوَّلَ ظالِم ظَلَمَ حَقَّ مُحَمَّد وَآلِ مُحَمَّد وَآخِرَ تابِع لَهُ عَلى ذلِكَ، اَللّـهُمَّ الْعَنِ الْعِصابَةَ الَّتي جاهَدَتِ الْحُسَيْنَ (عليه السلام) وَشايَعَتْ وَبايَعَتْ وَتابَعَتْ عَلى قَتْلِهِ، اَللّـهُمَّ الْعَنْهُمْ جَميعاً ثمّ تقول مائة مرّة : اَلسَّلامُ عَلَيْكَ يا اَبا عَبْدِاللهِ وَعَلَى الاَْرْواحِ الَّتي حَلَّتْ بِفِنائِكَ عَلَيْكَ مِنّي سَلامُ اللهِ اَبَداً ما بَقيتُ وَبَقِيَ اللَّيْلُ وَالنَّهارُ وَلا جَعَلَهُ اللهُ آخِرَ الْعَهْدِ مِنّي لِزِيارَتِكُمْ، اَلسَّلامُ عَلَى الْحُسَيْنِ وَعَلى عَلِيِّ بْنِ الْحُسَيْنِ '
                      'وَعَلى اَوْلادِ الْحُسَيْنِ وَعَلى اَصْحابِ الْحُسَيْنِ، ثمّ تقول : اَللّـهُمَّ خُصَّ اَنْتَ اَوَّلَ ظالِم بِاللَّعْنِ مِنّي وَابْدَأْ بِهِ اَوَّلاً ثُمَّ (الْعَنِ) الثّانيَ وَالثّالِثَ وَالرّابِعَ اَللّـهُمَّ الْعَنْ يَزيدَ خامِساً وَالْعَنْ عُبَيْدَ اللهِ بْنَ زِياد وَابْنَ مَرْجانَةَ وَعُمَرَ بْنَ سَعْد وَشِمْراً وَآلَ اَبي سُفْيانَ وَآلَ زِياد وَآلَ مَرْوانَ اِلى يَوْمِ الْقِيامَةِ ثمّ تسجد وتقُول : اَللّـهُمَّ لَكَ الْحَمْدُ حَمْدَ الشّاكِرينَ لَكَ عَلى مُصابِهِمْ اَلْحَمْدُ للهِ عَلى عَظيمِ رَزِيَّتي اَللّـهُمَّ ارْزُقْني شَفاعَةَ الْحُسَيْنِ يَوْمَ الْوُرُودِ وَثَبِّتْ لي قَدَمَ صِدْق عِنْدَكَ مَعَ الْحُسَيْنِ وَاَصْحابِ الْحُسَيْنِ اَلَّذينَ بَذَلُوا مُهَجَهُمْ دُونَ الْحُسَيْنِ عَلَيْهِ السَّلامُ.\n\n'
                      'قال علقمة : قال الباقر (عليه السلام) : وان استطعت أن تزُوره في كُلّ يوم بهذه الزّيارة في دارك فافعل فلك ثواب جميع ذلك.\n\n'
                      'وروى محمّد بن خالد الطّيالسي عن سيف بن عميرة ، قال : خرجتُ مع صفوان بن مهران وجماعة من أصحابنا الى الغريّ بعدما خرج الصّادق (عليه السلام)فسرنا من الحيرة الى المدينة فلمّا فرغنا من الزّيارة أي زيارة امير المؤمنين (عليه السلام)صرف صفوان وجهه الى ناحية أبي عبد الله (عليه السلام) فقال لنا: تزورون الحُسين (عليه السلام) من هذا المكان من عند رأس امير المؤمنين '
                      '(عليه السلام) من هاهُنا أومأ اليه الصّادق (عليه السلام) وأنا معه ، قال سيف بن عميرة : فدعا صفوان بالزّيارة الّتي رواها علقمة بن محمّد الحضرمي عن الباقر (عليه السلام) في يوم عاشوراء ثمّ صلّى ركعتين عند رأس امير المؤمنين (عليه السلام) وودّع في دبرهما امير المؤمنين (عليه السلام)وأومأ الى الحسين صلوات الله عليه بالسّلام منصرفاً وجهه نحوه وودّع وكان ممّا دعا دبرها :\n\n'
                      'يا اَللهُ يا اَللهُ يا اَللهُ، يا مُجيبَ دَعْوَةِ الْمُضْطَرِّينَ، يا كاشِفَ كُرَبِ الْمَكْرُوبينَ، يا غِياثَ الْمُسْتَغيثينَ، يا صَريخَ الْمُسْتَصْرِخينَ، وَيا مَنْ هُوَ اَقْرَبُ اِلَيَّ مِنْ حَبْلِ الْوَريدِ، وَيا مَنْ يَحُولُ بَيْنَ الْمَرْءِ وَقَلْبِهِ، وَيا مَنْ هُوَ بِالْمَنْظَرِ الاَْعْلى وَ بِالاُْفـُقِ الْمُبينِ، وَيا مَنْ هُوَ الرَّحْمنُ الرَّحيمُ عَلَى الْعَرْشِ اسْتَوى، وَيا مَنْ يَعْلَمُ خائِنَةَ الاَْعْيُنِ وَما تُخْفِي الصُّدُورُ، وَيا مَنْ لا تَخْفى عَلَيْهِ خافِيَهٌ، يا مَنْ لا تَشْتَبِهُ عَلَيْهِ الاَْصْواتُ، وَيا مَنْ لا تُغَلِّطُهُ الْحاجاتُ، وَيا مَنْ لا يُبْرِمُهُ اِلْحاحُ الْمُلِحّينَ، يا مُدْرِكَ كُلِّ فَوْت، وَيا جامِعَ كُلِّ شَمْل، وَيا بارِئَ النُّفُوسِ بَعْدَ الْمَوْتِ، يا مَنْ هُوَ كُلَّ يَوْم فِي شَأن، يا قاضِىَ الْحاجاتِ، يا مُنَفِّسَ الْكُرُباتِ، يا مُعْطِيَ السُّؤُلاتِ، يا وَلِيَّ الرَّغَباتِ، يا كافِىَ الْمُهِمّاتِ، يا مَنْ يَكْفي مِنْ كُلِّ شَىْء وَلا '
                      'يَكْفي مِنْهُ شَيءٌ فِي السَّماواتِ وَالاَْرْضِ، اَسْاَلُكَ بِحَقِّ مُحَمَّد خاتَمِ النَّبِيّينَ وَعَلِيِّ اَميرِ الْمُؤْمِنينَ، وَبِحَقِّ فاطِمَةَ بِنْتِ نَبِيِّكَ، وَبِحَقِّ الْحَسَنِ وَالْحُسَيْنِ فَاِنّي بِهِمْ اَتَوَجَّهُ اِلَيْكَ فِي مَقامي هذا وَبِهِمْ اَتَوَسَّلُ وَبِهِمْ اَتَشَفَّعُ اِلَيْكَ، وَبِحَقِّهِمْ اَسْأَلُكَ وَاُقْسِمُ وَاَعْزِمُ عَلَيْكَ، وَبِالشَّأنِ الَّذي لَهُمْ عِنْدَكَ وَبِالْقَدْرِ الَّذي لَهُمْ عِنْدَكَ، وَبِالَّذي فَضَّلْتَهُمْ عَلَى الْعالَمينَ، وَبِاسْمِكَ الَّذي جَعَلْتَهُ عِنْدَهُمْ وَبِهِ خَصَصْتَهُمْ دُونَ الْعالَمينَ، وَبِهِ اَبَنْتَهُمْ وَاَبَنْتَ فَضْلَهُمْ مِنْ فَضْلِ الْعالَمينَ، حَتّى فاقَ فَضْلُهُمْ فَضْلَ الْعالَمينَ جَميعاً، اَسْاَلُكَ اَنْ تُصَلِّيَ عَلى مُحَمَّد وَآلِ مُحَمَّد وَاَنْ تَكْشِفَ عَنّي غَمّي وَهَمّي وَكَرْبي، وَتَكْفِيَنِى الْمُهِمَّ مِنْ اُمُوري، وَتَقْضِيَ عَنّي دَيْني وَ تُجيرَني مِنَ الْفَقْرِ وَتُجيرَني مِنَ الْفاقَةِ وَتُغْنِيَني عَنِ الْمَسْأَلَةِ اِلَى الَْمخْلُوقينَ، وَتَكْفِيَني هَمَّ مَنْ اَخافُ هَمَّهُ، وَعُسْرَ مَنْ '
                      'اَخافُ عُسْرَهُ، وَحُزُونَةَ مَنْ اَخافُ حُزُونَتَهُ، وَشَرَّ مَنْ اَخافُ شَرَّهُ، وَمَكْرَ مَنْ اَخافُ مَكْرَهُ، وَبَغْيَ مَنْ اَخافُ بَغْيَهُ، وَ جَوْرَ مَنْ اَخافُ جَوْرَهُ، وَسُلْطانَ مَنْ اَخافُ سُلْطانَهُ، وَكَيْدَ مَنْ اَخافُ كَيْدَهُ، وَمَقْدُرَةَ مَنْ اَخافُ مَقْدُرَتَهُ عَلَيَّ، وَتَرُدَّ عَنّي كَيْدَ الْكَيَدَةِ وَمَكْرَ الْمَكَرَةِ، اَللّـهُمَّ مَنْ اَرادَني فَاَرِدْهُ، وَمَنْ كادَني فَكِدْهُ، وَاصْرِفْ عَنّي كَيْدَهُ وَمَكْرَهُ وَبَأسَهُ وَاَمانِيَّهُ، وَامْنَعْهُ عَنّي كَيْفَ شِئْتَ وَاَنّى شِئْتَ، اَللّـهُمَّ اشْغَلْهُ عَنّي بِفَقْر لا تَجْبُرُهُ، وَبِبَلاء لا تَسْتُرُهُ، وَبِفاقَة لا تَسُدّها، وَبِسُقْم لا تُعافيهِ، وَذُلٍّ لا تُعِزُّهُ، وَبِمَسْكَنَة لا تَجْبُرُها، اَللّـهُمَّ اضْرِبْ بِالذُّلِّ نَصْبَ عَيْنَيْهِ، وَاَدْخِلْ عَلَيْهِ الْفَقْرَ فِي مَنْزِلِهِ، وَالْعِلَّةَ وَالسُّقْمَ فِي بَدَنِهِ، حَتّى تَشْغَلَهُ عَنّي بِشُغْل شاغِل لا فَراغَ لَهُ، وَاَنْسِهِ ذِكْري كَما اَنْسَيْتَهُ ذِكْرَكَ، وَخُذْ عَنّي بِسَمْعِهِ وَبَصَرِهِ وَلِسانِهِ وَيَدِهِ وَرِجْلِهِ وَقَلْبِهِ '
                      'وَجَميعِ جَوارِحِهِ، وَاَدْخِلْ عَلَيْهِ فِي جَميعِ ذلِكَ الْسُّقْمَ وَلا تَشْفِهِ حَتّى تَجْعَلَ ذلِكَ لَهُ شُغْلاً شاغِلاً بِهِ عَنّي وَعَنْ ذِكْري، وَاكْفِني يا كافِيَ مالا يَكْفي سِواكَ، فَاِنَّكَ الْكافِي لا كافِىَ سِواكَ، وَمُفَرِّجٌ لا مُفَرِّجَ سِواكَ، وَمُغيثٌ لا مُغيثَ سِواكَ، وَجارٌ لا جارَ سِواكَ، خابَ مَنْ كانَ جارُهُ سِواكَ، وَمُغيثُهُ سِواكَ، وَمَفْزَعُهُ اِلى سِواكَ، وَمَهْرَبُهُ اِلى سِواكَ، وَمَلْجَأُهُ اِلى غَيْرِكَ، وَمَنْجاهُ مِنْ مَخْلُوق غَيْرِكَ، فَاَنْتَ ثِقَتي وَرَجائي وَمَفْزَعي وَمَهْرَبي وَمَلْجَئي وَمَنْجاىَ فَبِكَ اَسْتَفْتِحُ وَبِكَ اَسْتَنْجِحُ، وَبِمُحَمَّد وَآلِ مُحمَّد اَتَوَجَّهُ اِلَيْكَ وَاَتَوَسَّلُ وَاَتَشَفَّعُ، فَاَسْاَلُكَ يا اَللهُ يا اَللهُ يا اَللهُ، '
                      'فَلَكَ الْحَمْدُ وَلَكَ الشُّكْرُ وَاِلَيْكَ الْمُشْتَكى وَاَنْتَ الْمُسْتَعانُ فَاَسْاَلُكَ يا اَللهُ يا اَللهُ يا اَللهُ بِحَقِّ مُحَمَّد وَآلِ مُحَمَّد اَنْ تُصَلِّيَ عَلى مُحَمَّد وَآلِ مُحَمَّد، وَاَنْ تَكْشِفَ عَنّي غَمّي وَهَمّي وَكَرْبي فِي مَقامي هذا كَما كَشَفْتَ عَنْ نَبِيِّكَ هَمَّهُ وَغَمَّهُ وَ كَرْبَهُ وَكَفَيْتَهُ هَوْلَ عَدُوِّهِ، فَاكْشِفْ عَنّي كَما كَشَفْتَ عَنْهُ وَفَرِّجْ عَنّي كَما فَرَّجْتَ عَنْهُ وَاكْفِني كَما كَفَيْتَهُ، وَاصْرِفْ عَنّي هَوْلَ ما اَخافُ هَوْلَهُ، وَمَؤُنَةَ ما اَخافُ مَؤُنَتَهُ، وَهَمَّ ما اَخافُ هَمَّهُ بِلا مَؤُنَة عَلى نَفْسي مِنْ ذلِكَ، وَاصْرِفْني بِقَضاءِ حَوائِجي، وَكِفايَةِ ما اَهَمَّني هَمُّهُ مِنْ اَمْرِ آخِرَتي وَدُنْياىَ، يا اَميرَ الْمُؤْمِنينَ وَيا اَبا عَبْدِاللهِ، عَلَيْكُما مِنّي سَلامُ اللهِ اَبَداً ما بَقيتُ وَبَقِيَ اللَّيْلُ وَالنَّهارُ وَلا جَعَلَهُ اللهُ آخِرَ الْعَهْدِ مِنْ زِيارَتِكُما، وَلا فَرَّقَ اللهُ بَيْني وَبَيْنَكُما، '
                      'اَللّـهُمَّ اَحْيِني حَياةَ مُحَمَّد وَذُرِّيَّتِهِ وَاَمِتْني مَماتَهُمْ وَتَوَفَّني عَلى مِلَّتِهِمْ، وَاحْشُرْني فِي زُمْرَتِهِمْ وَلا تُفَرِّقْ بَيْني وَبَيْنَهُمْ طَرْفَةَ عَيْن اَبَداً فِي الدُّنْيا وَالاْخِرَةِ، يا اَميرَ الْمُؤْمِنينَ وَيا اَبا عَبْدِاللهِ اَتَيْتُكُما زائِراً وَمُتَوَسِّلاً اِلَى اللهِ رَبّي وَرَبِّكُما، وَمُتَوَجِّهاً اِلَيْهِ بِكُما وَمُسْتَشْفِعاً بِكُما اِلَى اللهِ (تَعالى) فِي حاجَتي هذِهِ فَاشْفَعا لي فَاِنَّ لَكُما عِنْدَ اللهِ الْمَقامَ الَْمحْمُودَ، وَالْجاهَ الْوَجيهَ، وَالْمَنْزِلَ الرَّفيعَ وَالْوَسيلَةَ، اِنّي اَنْقَلِبُ عَنْكُما مُنْتَظِراً لِتَنَجُّزِ الْحاجَةِ وَقَضائِها وَنَجاحِها مِنَ اللهِ بِشَفاعَتِكُما لي اِلَى اللهِ فِي ذلِكَ، فَلا اَخيبُ وَلا يَكُونُ مُنْقَلَبي مُنْقَلَباً خائِباً خاسِراً، بَلْ يَكُونُ مُنْقَلَبي مُنْقَلَباً راجِحاً (راجِياً) مُفْلِحاً مُنْجِحاً مُسْتَجاباً بِقَضاءِ جَميعِ حَوائِجي وَتَشَفَّعا لي اِلَى اللهِ، انْقَلَبْتُ عَلى ما شاءَ اللهُ وَلا حَوْلَ وَلا قُوَّةَ اِلاّ بِاللهِ، مُفَوِّضاً اَمْري اِلَى اللهِ مُلْجِأً ظَهْري اِلَى '
                      'اللهِ، مُتَوَكِّلاً عَلَى اللهِ وَاَقُولُ حَسْبِيَ اللهُ وَكَفى سَمِعَ اللهُ لِمَنْ دَعا لَيْسَ لي وَراءَ اللهِ وَوَراءَكُمْ يا سادَتي مُنْتَهى، ما شاءَ رَبّي كانَ وَمالَمْ يَشَأْ لَمْ يَكُنْ، وَلا حَوْلَ وَلا قُوَّةَ اِلاّ بِاللهِ، اَسْتَوْدِعُكُمَا اللهَ وَلا جَعَلَهُ اللهُ آخِرَ الْعَهْدِ مِنّي اِلَيْكُما، اِنْصَرَفْتُ يا سَيِّدي يا اَميرَ الْمُؤْمِنينَ وَمَوْلايَ وَاَنْتَ يا اَبا عَبْدِاللهِ يا سَيِّدي وَسَلامي عَلَيْكُما مُتَّصِلٌ مَا اتَّصَلَ اللَّيْلُ وَالنَّهارُ واصِلٌ ذلِكَ اِلَيْكُما غَيْرُ مَحْجُوب عَنْكُما سَلامي اِنْ شاءَ اللهُ، وَاَسْأَلُهُ بِحَقِّكُما اَنْ يَشاءَ ذلِكَ وَيَفْعَلَ فَاِنَّهُ حَميدٌ مَجيدٌ، اِنْقَلَبْتُ يا سَيِّدَىَّ عَنْكُما تائِباً حامِداً للهِ شاكِراً راجِياً لِلاِْجابَةِ غَيْرَ آيِس وَلا قانِط تائِباً عائِداً راجِعاً اِلى زِيارَتِكُما غَيْرَ راغِب عَنْكُما وَلا مِنْ زِيارَتِكُما بَلْ راجِعٌ عائِدٌ اِنْ شاءَ اللهُ وَلا حَوْلَ وَلا قُوَّةَ اِلاّ بِاللهِ، يا سادَتي رَغِبْتُ اِلَيْكُما وَاِلى زِيارَتِكُما بَعْدَ اَنْ زَهِدَ فيكُما وَفِي زِيارَتِكُما اَهْلُ الدُّنْيا فَلا خَيَّبَنِيَ اللهُ ما رَجَوْتُ وَما اَمَّلْتُ فِي زِيارَتِكُما اِنَّهُ قَريبٌ مُجيبٌ.\n\n'
                      'قال سيف بن عميرة: فسألت صفواناً فقُلت له: انّ علقمة بن محمّد لم يأتنا بهذا عن الباقر (عليه السلام) انّما أتانا بدعاء الزّيارة ، فقال صفوان : وردت مع سيّدي الصّادق صلوات الله وسلامه عليه الى هذا المكان ففعل مثل الَّذي فعلناه في زيارتنا، ودعا بهذا الدّعاء عند الوداع بعد أن صلّى كما صلّينا وودّع كما ودّعنا ، ثمّ قال صفوان : قال الصّادق (عليه السلام) : تعاهد هذه الزّيارة وادعُ بهذا الدّعاء وزُر به فانّي ضامن على الله لكلّ من زار بهذه الزّيارة ودعا بهذا الدّعاء من قُرب أو بُعد انّ زيارته مقبولة وسعيه مشكور وسلامه واصل غير محجُوب وحاجته مقضيّة من الله تعالى بالغة ما بلغت ولا يخيبُه، يا '
                      'صفوان وجدت هذه الزّيارة مضمُونة بهذا الضّمان عن أبي وأبي عن أبيه عليّ بن الحسين (عليهما السلام) مضموناً بهذا الضّمان عن الحسين (عليه السلام)والحسين (عليه السلام) عن أخيه الحسن (عليه السلام) مضمُوناً بهذا الضّمان، والحسن (عليه السلام) عن أبيه امير المؤمنين (عليه السلام)مضموناً بهذا الضّمان، وامير المؤمنين (عليه السلام) عن رسول الله (صلى الله عليه وآله وسلم) مضمُوناً بهذا الضّمان، ورسول الله (صلى الله عليه وآله وسلم)عن جبرئيل (عليه السلام) مضموناً بهذا الضّمان، وجبرئيل عن الله تعالى مضموناً بهذا '
                      'الضّمان، وقد آلى الله على نفسه عزّوجل انّ من زار الحسين (عليه السلام)بهذه الزّيارة من قُرب أو بُعد ودعا بهذا الدّعاء قبلت منه زيارته وشفعته في مسألته بالغة ما بلغت واعطيته سؤله ثمّ لا ينقلِب عنّي خائباً واقلبه مسروراً قريراً عينه بقضاء حاجته والفوز بالجنّة والعتق من النّار، وشفعته في كلّ من شفع خلا ناصب لنا أهل البيت، آلى الله تعالى بذلك على نفسه وأشهدنا بما شهدت به ملائكة ملكوته، ثمّ قال جبرئيل '
                      ': يا رسول الله أرسلني الله اليك سُروراً وبشرى لك ولعليّ وفاطمة والحسن والحسين والائمة من ولدك وشيعتكم الى يوم البعث لا زلت مسروراً ولا زال علي وفاطمة والحسن والحسين وشيعتكم مسرورين الى يوم البعث ، قال صفوان : قال لي الصّادق (عليه السلام): يا صفوان اذا حدث لك الى الله حاجة فزُر بهذه الزّيارة من حيث كنت وادعُ بهذا الدّعاء وسل ربّك حاجتك تأتك من الله، والله غير مخلف وعده رسوله بجوده وبمنّه والحمد لله.\n\n'
                      'وقال شيخنا ثقة الاسلام النّوري (رحمه الله) : أمّا زيارة عاشوراء فكفاها فضلاً وشرفاً انّها لا تسانخ سائر الزّيارات الّتي هي من انشاء المعصوم واملائه في ظاهر الامر وان كان لا يبرز من قلوبهم الطّاهرة الاّ ما تبلغها من المبدأ الاعلى بل تسانخ الاحاديث القدسيّة التي أوحى الله جلّت عظمته بها الى جبرئيل بنصّها بما فيها من اللّعن والسّلام والدّعاء، فأبلغها جبرئيل الى خاتم النّبيين (صلى الله عليه وآله وسلم) وهي كما دلّت عليه التجارب فريدة في آثارها من قضاء الحوائج ونيل المقاصد ودفع الاعادي لو واضب عليها الزّائر أربعين يوماً أو أقلّ، ولكن أعظم ما انتجته من الفوائد ما في كتاب دار السّلام وملّخصه انّه حدث الثّقة الصّالح التّقي الحاج المولى حسن '
                      'اليزدي المجاور للمشهد الغرويّ وهو من الّذين وفوا بحقّ المجاورة وأتعبوا أنفسهم في العبادة، عن الثّقة الامين الحاج محمّد عليّ اليزدي قال : كان في يزد رجل صالح فاضل مشتغل بنفسه ومواظب لعمارة رمسه يبيت في اللّيالي بمقبرة خارج بلدة يزد تُعرف بالمزار وفيها جملة من الصّلحاء، وكان له جار نشأ معه من صغر سنّه عند المُعلّم وغيره الى أن صار عشّاراً وكان كذلك الى أن مات ودفن في تلك المقبرة قريباً من المحلّ الَّذي كان يبيت في الرّجل الصّالح المذكور، فرآه بعد موته بأقلّ من شهر في المنام في زيّ حسن وعليه نضرة النّعيم، فتقدّم اليه وقال له : انّي عالم بمبدئك ومنتهاك وباطنك وظاهرك ولم تكن ممّن يحتمل في حقّه حسن الباطن ولم يكن عملك مقتضياً أنّ العذاب والنكال فبم نلت هذا المقام ، قال: نعم الامر كما قلت، كنت مقيماً في أشدّ العذاب من '
                      'يوم وفاتي الى أمس وقد توفّيت فيه زوجة الاستاذ أشرف الحدّاد ودفنت في هذا المكان، وأشار الى طرف بينه وبينه قريب من مائة ذراع وفي ليلة دفنها زارها أبو عبد الله (عليه السلام) ثلاث مرّات وفي المرّة الثّالثة أمر برفع العذاب عن هذه المقبرة فصرت في نعمة وسعة وخفض عيش ودعة، فانتبه متحيّراً ولم تكن له معرفة بالحدّاد ومحلّه فطلبه في سُوق الحدّادين فوجده ، فقال له : ألك زوجة ؟ قال : نعم توفّيت بالامس ودفنتها في المكان الفلاني وذكر الموضع الَّذي أشار اليه ، قال : فهل زارت أبا عبد الله (عليه السلام) ؟ قال : لا ، قال : فهل كانت تذكر مصائبه ؟ قال : لا ، قال : فهل كان لها مجلس تذكر فيه مصائبه ؟ قال : لا ، فقال الرّجل : وما تريد من السّؤال ؟ فقصّ عليه رؤياه ، قال : كانت مواظبة على زيارة عاشوراء.',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
            ],
          ),
        ),
        bottomNavigationBar: AddCustomBottomNavigationBar(
          pushNext: Alsadbi3aAlmo5asasaAlsania.screenRoute,
          pushBack: AlsadisaAlmo5asasa.screenRoute,
          soud: 'https://cdn.jsdelivr.net/gh/SounaDiab/image_audio@master/audio/السابعة المخصصة.mp3',
          onTap: (double fontSize) {
            // تحديث حجم الخط
            setState(() {
              isTablet ? _fontSizeTablet = fontSize : _fontSize = fontSize;
            });
            print('fontSize: $fontSize');
            // إغلاق Dialog
            Navigator.of(context).pop();
          },
          onLongPress: () {
            final snackBar = SnackBar(
              content: Center(
                child: Text(
                  '${isTablet ? _fontSizeTablet.toInt() : _fontSize.toInt()}',
                  style: TextStyle(
                    color: Colors.white,
                    fontSize: 16,
                  ),
                ),
              ),
              width: 60,
              behavior: SnackBarBehavior.floating,
              backgroundColor: Colors.blue,
              duration: Duration(seconds: 2),
              shape: ShapeBorder.lerp(
                RoundedRectangleBorder(
                  borderRadius: BorderRadius.circular(50),
                ),
                RoundedRectangleBorder(
                  borderRadius: BorderRadius.circular(50),
                ),
                1,
              ),
            );
            ScaffoldMessenger.of(context).showSnackBar(snackBar);
          },
        ),
      ),
    );
  }
}
