import 'package:flutter/material.dart';
import 'package:maktabat_almoslim/widgets/container_scrollview.dart';
import 'package:provider/provider.dart';
import 'package:shared_preferences/shared_preferences.dart';

import '../../../../widgets/add_custom_bottom_navigation_bar.dart';
import '../../../../widgets/list_of_nine_verses.dart';
import '../../../favorites_provider.dart';
import '../../../favorites_screen.dart';
import '../ziyarat_alhoussein_wa2adabiha.dart';
import 'alziyarat_almotlaka_al5amisa.dart';
import 'alziyarat_almotlaka_alsabi3a.dart';

class AlziyaratAlmotlakaAlsadisa extends StatefulWidget {
  static String screenRoute = 'alziyarat_almotlaka_alsadisa_screen';
  const AlziyaratAlmotlakaAlsadisa({super.key});

  @override
  State<AlziyaratAlmotlakaAlsadisa> createState() =>
      _AlziyaratAlmotlakaAlsadisaState();
}

double _fontSize = 18;
double _fontSizeTablet = 30;

class _AlziyaratAlmotlakaAlsadisaState
    extends State<AlziyaratAlmotlakaAlsadisa> {
  bool isIcon = true;
  @override
  void initState() {
    super.initState();
    _loadFavoriteState();
  }

  Future<void> _loadFavoriteState() async {
    final prefs = await SharedPreferences.getInstance();
    bool? savedState =
        prefs.getBool('isFavorite_alziyarat_almotlaka_alsadisa_screen');
    setState(() {
      isIcon = savedState ?? true;
    });
  }

  Future<void> _saveFavoriteState(bool value) async {
    final prefs = await SharedPreferences.getInstance();
    await prefs.setBool(
        'isFavorite_alziyarat_almotlaka_alsadisa_screen', value);
  }

  Future<bool> _onWillPop() async {
    final args =
        ModalRoute.of(context)!.settings.arguments as Map<String, dynamic>?;
    final previousPage = args?['previousPage'];
    if (previousPage == 'favorite_screen') {
      Navigator.of(context).pushReplacementNamed(FavoritesScreen.screenRoute);
      return false;
    } else {
      Navigator.of(context)
          .pushReplacementNamed(ZiyaratAlhousseinWa2adabiha.screenRoute);
      return false;
    }
  }

  @override
  Widget build(BuildContext context) {
    double size = MediaQuery.of(context).textScaleFactor;
    final screenWidth = MediaQuery.of(context).size.width;
    final isTablet = screenWidth >= 600;
    return WillPopScope(
      onWillPop: _onWillPop,
      child: Scaffold(
        appBar: AppBar(
          toolbarHeight: isTablet ? 100 : 50,
          centerTitle: true,
          leading: IconButton(
            onPressed: _onWillPop,
            icon: Icon(
              Icons.arrow_back,
              size: isTablet ? 50 : 25,
            ),
          ),
          actions: [
            IconButton(
              padding: EdgeInsets.only(left: isTablet ? 50 : 30),
              icon: Icon(
                isIcon ? Icons.favorite_border : Icons.favorite_rounded,
                size: isTablet ? 40 : 25,
                color: isIcon ? Colors.black : Colors.red,
              ),
              onPressed: () async {
                setState(() {
                  isIcon = !isIcon;
                });
                await _saveFavoriteState(isIcon);

                if (!isIcon) {
                  Provider.of<FavoritesProvider>(context, listen: false)
                      .addFavorite(
                          'الزيارة المطلقة السادسة للحسين (عليه السلام)',
                          AlziyaratAlmotlakaAlsadisa.screenRoute);
                } else {
                  Provider.of<FavoritesProvider>(context, listen: false)
                      .removeFavorite(
                          'الزيارة المطلقة السادسة للحسين (عليه السلام)',
                          AlziyaratAlmotlakaAlsadisa.screenRoute,
                          AlziyaratAlmotlakaAlsadisa.screenRoute);
                }
              },
            ),
          ],
          title: Text(
            'الزيارة المطلقة السادسة للحسين (عليه السلام)',
            style: TextStyle(
              fontSize: isTablet
                  ? 40
                  : size > 1.0
                      ? 20
                      : 23,
              fontWeight: FontWeight.bold,
            ),
          ),
        ),
        body: ContainerScrollview(
          widget: Column(
            crossAxisAlignment: CrossAxisAlignment.start,
            children: [
              Container(
                child: Column(
                  children: [
                    Center(
                      child: Text(
                        'بسم الله الرحمن الرحيم',
                        style: TextStyle(
                          fontSize: isTablet ? _fontSizeTablet : _fontSize,
                          fontWeight: FontWeight.w900,
                        ),
                      ),
                    ),
                    Center(
                      child: Text(
                        'اللهم صلِّ على محمد وآل محمد',
                        style: TextStyle(
                          fontSize: isTablet ? _fontSizeTablet : _fontSize,
                          fontWeight: FontWeight.w900,
                        ),
                      ),
                    ),
                  ],
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: '',
                  subtitle:
                      'روى الشّيخ في المصباح عن صفوان (أقول: هذه الزّيارات الثّلاث مرويّة عن كتاب المزار لابن قولويه) قال : استأذنت الصّادق (عليه السلام) لزيارة مولاي الحُسين (عليه السلام)وسألته أن يعرفني ما أعمل عليه ، فقال : يا صفوان صم ثلاثة ايّام قبل خروجك واغتسل في اليوم الثّالث ، ثمّ اجمع اليك أهلك ، ثمّ قُل : اَللّـهُمَّ اِنّي اسْتَوْدِعُكَ، الدُّعاءَ ثمّ علّمه دعاء يدعو به اذا أتى الفرات، ثمّ قال: ثمّ اغتسل من الفرات فانّ أبي حدّثني عن آبائه (عليهم السلام) قال: قال رسول الله(صلى الله عليه وآله وسلم): انّ ابني هذا الحسين (عليه السلام) يُقتل بعدي على شاطيء الفرات ومن اغتسل من الفرات تساقطت خطاياه كهيئة يوم ولدته امّه، فاذا اغتسلت فقُل في غُسلكَ : بِسْمِ اللهِ وَبِاللهِ، اَللّـهُمَّ اجْعَلْهُ نُوراً وَطَهُوراً وَحِرْزاً وَشِفاءً مِنْ كُلِّ داء وَسُقْم وَآفَة وَعاهَة، اَللّـهُمَّ طَهِّرْ بِهِ قَلْبي وَاشْرَحْ بِهِ صَدْري وَسَهِّلْ لي بِهِ اَمْري، فاذا فرغت من غُسلك فالبس ثوبين وصلّ ركعتين خارج المشرعة وهو المكان الَّذي قال الله تعالى : (وَفِي الاَْرْضِ قِطَعٌ مُتَجاوِراتٌ وَجَنّاتٌ مِنْ اَعْناب وَزَرْعٌ وَنَخيلٌ صِنْوانٌ وَغَيْرَ صِنْوان يُسْقى بِماء واحِد وَنُفَضِّلُ بَعْضَها عَلى بَعْض فِي الاَْكْلِ) فاذا فرغت من '
                      'صلاتك فتوجّه نحو الحائر وعليك السّكينة والوقار وقصّر خطاك فانّ الله تعالى يكتب لك بكُلّ خطوة حجّة وعُمرة، وصر خاشِعاً قلبك باكية عينك واكثر من التّكبير والتّهليل والثّناء على الله عزّوجل والصّلاة على نبيّه (صلى الله عليه وآله وسلم)والصّلاة على الحسين (عليه السلام) خاصّة ولعن من قتله والبراءة ممّن أسّس ذلك عليه فاذا أتيت باب الحائر فقف وقُل : اَللهُ اَكْبَرُ كَبيراً، وَالْحَمْدُ للهِِ كَثيراً، وَسُبْحانَ اللهِ بُكْرَةً وَاَصيلاً، اَلْحَمْدُ للهِ الَّذي هَدانا لِهذا وَما كُنّا لِنَهْتَدِيَ لَوْ لا اَنْ هَدانَا اللهُ، لَقَدْ جاءَتْ رُسُلُ رَبِّنا بِالْحَقِّ ثمّ قُل :\n\n'
                      'اَلسَّلامُ عَلَيْكَ يا رَسُولَ اللهِ، اَلسَّلامُ عَلَيْكَ يا نَبِيَّ اللهِ، اَلسَّلامُ عَلَيْكَ يا خاتَمَ النَّبِيّينَ، اَلسَّلامُ عَلَيْكَ يا سَيِّدَ الْمُرْسَلينَ، اَلسَّلامُ عَلَيْكَ يا حَبيبَ اللهِ، اَلسَّلامُ عَلَيْكَ يا اَميرَ الْمُؤْمِنينَ، اَلسَّلامُ عَلَيْكَ يا سَيِّدَ الْوَصِيّينَ، اَلسَّلامُ عَلَيْكَ يا قائِدَ الْغُرِّ الُْمحَجَّلينَ، اَلسَّلامُ عَلَيْكَ يَا بْنَ فاطِمَةَ سَيِّدَةِ نِساءِ الْعالَمينَ، اَلسَّلامُ عَلَيْكَ وَعَلَى الاَْئِمَّةَ مِنْ وُلْدِكَ، اَلسَّلامُ عَلَيْكَ يا وَصِيَّ اَميرِ الْمُؤْمِنينَ، اَلسَّلامُ عَلَيْكَ اَيُّهَا الصِّديقُ الشَّهيدُ، اَلسَّلامُ عَلَيْكَم يا مَلائِكَةَ اللهِ المُقيمينَ فِي هذَا المَقامِ الشَّريفِ، اَلسَّلامُ عَلَيْكُمْ يا مَلائِكَةَ رَبِّي الُْمحْدِقينَ بِقَبْرِ الْحُسَيْنِ عَلَيْهِ السَّلامِ، اَلسَّلامُ عَلَيْكُمْ مِنّي اَبَداً ما بَقيتُ وَبَقِيَ اللَّيْلُ وَالنَّهارُ.\n\n'
                      'ثمّ تقول :\n\n'
                      'اَلسَّلامُ عَلَيْكَ يا اَبا عَبْدِاللهِ، اَلسَّلامُ عَلَيْكَ يَا بْنَ رَسُولِ الله، اَلسَّلامُ عَلَيْكَ يَا بْنَ اَميرِ الْمُؤْمِنينَ عَبْدُكَ وَابْنُ عَبْدِكَ وَابْنُ اَمَتِكَ الْمُقِرُّ بِالرِّقِّ وَالتّارِكُ لِلْخِلافِ عَلَيْكُمْ وَالْمُوالي لِوَلِيِّكُمْ وَالْمُعادي لِعَدُوِّكُمْ، قَصَدَ حَرَمَكَ وَاسْتَجارَ بِمَشْهَدِكَ، وَتَقَرَّبَ اِلَيْكَ بِقَصْدِكَ، أَاَدْخُلُ يا رَسُولَ اللهِ، أَاَدْخُلُ يا نَبِيَّ اللهِ ءَاَدْخُلُ يا اَميرَ الْمُؤْمِنينَ، أَاَدْخُلُ يا سَيِّدَ الْوَصِيّينَ، أَاَدْخُلُ يا فاطِمَةَ سَيِّدَةَ نِساءِ الْعالَمينَ، أَاَدْخُلُ يا مَوْلايَ يا اَبا عَبْدِاللهِ، أَاَدْخُلُ يا مَوْلايَ يَا بْنَ رَسُولِ اللهِ.\n\n'
                      'فإنْ خشع قلبكَ ودمعت عينك فهو علامة الاذن ثمّ ادخل وقُل : اَلْحَمْدُ للهِ الْواحِدِ الاَْحَدِ الْفَرْدِ الصَّمَدِ الَّذي هَداني لِوِلايَتِكَ، وَخَصَّني بِزِيارَتِكَ، وَسَهَّلَ لي قَصْدَكَ، ثمّ ائت باب القُبّة وقِف مِن حيث يلي الرّأس وقُل :\n\n'
                      'اَلسَّلامُ عَلَيْكَ يا وارِثَ آدَمَ صَفْوَةِ اللهِ، اَلسَّلامُ عَلَيْكَ يا وارِثَ نُوح نَبِيِّ اللهِ، اَلسَّلامُ عَلَيْكَ يا وارِثَ اِبْراهيمَ خَليلِ اللهِ، اَلسَّلامُ عَلَيْكَ يا وارِثَ مُوسى كَليمِ اللهِ، اَلسَّلامُ عَلَيْكَ يا وارِثَ عيسى رُوحِ اللهِ، اَلسَّلامُ عَلَيْكَ يا وارِثَ مُحَمَّد حَبيبِ اللهِ، اَلسَّلامُ عَلَيْكَ يا وارِثَ اَميرِ الْمُؤْمِنينَ عَلَيْهِ السَّلامُ، اَلسَّلامُ عَلَيْكَ يَا بْنَ مُحَمَّد الْمُصْطَفى، اَلسَّلامُ عَلَيْكَ يَا بْنَ عَلِيِّ الْمُرْتَضى، اَلسَّلامُ عَلَيْكَ يَا بْنَ فاطِمَةَ الزَّهْراءِ، اَلسَّلامُ عَلَيْكَ يَا بْنَ خَديجَةَ الْكُبرى، '
                      'اَلسَّلامُ عَلَيْكَ يا ثارَ اللهِ وَابْنَ ثارِهِ وَالْوِتْرَ الْمَوْتُورَ، اَشْهَدُ اَنَّكَ قَدْ اَقَمْتَ الصَّلاةَ وَآتَيْتَ الزَّكاةَ، وَاَمَرْتَ بِالْمَعْرُوفِ وَنَهَيْتَ عَنْ الْمُنْكَرِ، وَاَطَعْتَ اللهَ وَرَسُولَهُ حَتّى اَتاكَ الْيَقينُ، فَلَعَنَ اللهُ اُمَّةً قَتَلَتْكَ، وَلَعَنَ اللهُ اُمَّةً ظَلَمَتْكَ، وَلَعَنَ اللهُ اُمَّةً سَمِعَتْ بِذلِكَ فَرَضِيَتْ بِهِ، يا مَوْلايَ يا اَبا عَبْدِاللهِ، اَشْهَدُ اَنَّكَ كُنْتَ نُوراً فِي الاَْصْلابِ الشّامِخَةِ، وَالاَْرْحامِ الْمُطَهَّرَةِ، لَمْ تُنَجِّسْكَ الْجاهِلِيَّةُ بِاَنْجاسِها، وَلَمْ تُلْبِسْكَ مِنْ مُدْلَهِمّاتِ ثِيابِها، وَاَشْهَدُ اَنَّكَ مِنْ دَعائِمِ الدّينِ، وَاَرْكانِ الْمُؤْمِنينَ، وَاَشْهَدُ اَنَّكَ الاِْمامُ الْبَرُّ التَّقِيُّ الرَّضِيُّ الزَّكِيُّ الْهادِي الْمَهْدِىُّ وَاَشْهَدُ اَنَّ الاَْئِّمَةَ مِنْ وُلْدِكَ كَلِمَةُ التَّقْوى، وَاَعْلامُ الْهُدى، وَالْعُروَةُ الْوُثْقى، وَالْحُجَّةُ عَلى اَهْلِ الدُّنْيا، وَاُشْهِدُ اللهَ وَمَلائِكَتَهُ وَاَنْبِياءَهُ وَرُسُلَهُ اَنّي بِكُمْ مُؤْمِنٌ وَبِاِيابِكُمْ، مُوقِنٌ بِشَرايـِعِ ديني وَخَواتيمِ عَمَلي، وَقَلْبي لِقَلْبِكُمْ سِلْمٌ وَاَمْري لاَِمْرِكُمْ مُتَّبِـعٌ، صَلَواتُ اللهِ عَلَيْكُمْ وَعَلى اَرْواحِكُمْ وَعَلى اَجْسادِكُمْ وَعَلى اَجْسامِكُمْ وَ عَلى شاهِدِكُمْ وَعَلى غائِبِكُمْ وَعَلى ظاهِرِكُمْ وَعَلى باطِنِكُمْ.\n\n'
                      'ثمّ انكبّ على القبر وقبّله وقُل :\n\n'
                      'بِاَبي اَنْتَ وَاُمّي يَا بْنَ رَسُولِ اللهِ، بِاَبي اَنْتَ وَاُمّي يا اَبا عَبْدِاللهِ، لَقَدْ عَظُمَتِ الرَّزِيَّةُ وَجَلَّتِ الْمُصيبَةُ بِكَ عَلَيْنا وَعَلى جَميعِ اَهْلِ السَّماواتِ وَالاَْرْضِ، فَلَعَنَ اللهُ اُمَّةً اَسْرَجَتْ وَاَلْجَمَتْ وَتَهَيَّأَتْ لِقِتالِكَ، يا مَوْلايَ يا اَبا عَبْدِاللهِ، قَصَدْتُ حَرَمَكَ، وَاَتَيْتُ اِلى مَشْهَدِكَ، اَسْألُ اللهَ بِالشَّأنِ الَّذي لَكَ عِنْدَهُ وَبِالَْمحَلِّ الَّذي لَكَ لَدَيْهِ اَنْ يُصَلِيَّ عَلى مُحَمَّد وَآلِ مُحَمَّد، وَاَنْ يَجْعَلَني مَعَكُمْ فِي الدُّنْيا وَالاْخِرَةِ.\n\n'
                      'ثمّ قُم فَصَلِّ ركعتين عند الرّأس اقرأ فيها ما أحببت فاذا فرغت من صلاتك فقُل :\n\n'
                      'اَللّـهُمَّ اِنّي صَلَّيْتُ وَرَكَعْتُ وَسَجَدْتُ لَكَ وَحْدَكَ لا شَريكَ لَكَ، لاَِنَّ الصَّلاةَ وَالرُّكُوعَ وَالسُّجُودَ لا تَكُونُ اِلاّ لَكَ لاَِنَّكَ اَنْتَ اللهُ لا اِلـهَ الاّ اَنْتَ، اَللّـهُمَّ صَلِّ عَلى مُحَمَّد وَآلِ مُحَمَّد وَاَبْلِغْهُمْ عَنّي اَفْضَلَ السَّلامِ وَالتَّحِيَّةِ، وَارْدُدْ عَلَيَّ مِنْهُمُ السَّلامَ، اَللّـهُمَّ وَهاتانِ الرَّكْعَتانِ هَدِيَّةٌ مِنّي اِلى مَوْلايَ الْحُسَيْنِ بْنِ عَلِيِّ عَلَيْهِمَا السَّلامُ، اَللّـهُمَّ صَلِّ عَلى مُحَمَّد وَعَلَيْهِ، وَتَقَبَّلْ مِنّي وَأجُرْني عَلى ذلِكَ بِاَفْضَلِ اَمَلي وَرَجائي فيكَ وَفِي وَلِيِّكَ يا وَلِيَّ الْمُؤْمِنينَ.\n\n'
                      'ثمّ قُم وصِر الى عند رجلي القبر وقِف عند رأس عليّ بن الحسين (عليه السلام)وقُل :\n\n'
                      'اَلسَّلامُ عَلَيْكَ يَا بْنَ رَسُولِ اللهِ، اَلسَّلامُ عَلَيْكَ يَا بْنَ نَبِيِّ اللهِ، اَلسَّلامُ عَلَيْكَ يَا بْنَ اَميرِ الْمُؤْمِنينَ، اَلسَّلامُ عَلَيْكَ يَا بْنَ الْحُسَيْنِ الشَّهيدِ، اَلسَّلامُ عَلَيْكَ اَيُّهَا الشَّهيدُ، اَلسَّلامُ عَلَيْكَ اَيُّهَا الْمَظْلُومُ وَابْنُ الْمَظْلُومِ، لَعَنَ اللهُ اُمَّةً قَتَلَتْكَ، وَلَعَنَ اللهُ اُمَّةً ظَلَمَتْكَ، وَلَعَنَ اللهُ اُمَّةً سَمِعَتْ بِذلِكَ فَرَضَيِتْ بِهِ.\n\n'
                      'ثمّ انكبّ على القبر وقبّله وقُل :\n\n'
                      'اَلسَّلامُ عَلَيْكَ يا وَلِيَّ اللهِ وَابْنَ وَلِيِّهِ، لَقَدْ عَظُمَتِ الْمُصيبَةُ وَجَلَّتِ الرَّزِيَّةُ بِكَ عَلَيْنا وَعَلى جَميعِ الْمُسْلِمينَ، فَلَعَنَ اللهُ اُمَّةً قَتَلَتْكَ، وَاَبْرَأُ اِلَى اللهِ وَاِلَيْكَ مِنْهُمْ.\n\n'
                      'ثمّ اخرج من الباب الَّذي عند رجلي عليّ بن الحسين (عليهما السلام) ثمّ توجّه الى الشّهداء وقُل :\n\n'
                      'اَلسَّلامُ عَلَيْكُمْ يا اَوْلِياءَ اللهِ وَاَحِبّائَهُ، اَلسَّلامُ عَلَيْكُمْ يا اَصْفِياءَ اللهِ وَاَوِدّاءَهُ، اَلسَّلامُ عَلَيْكُمْ يا اَنْصارَ دينِ اللهِ، اَلسَّلامُ عَلَيْكُمْ يا اَنْصارَ رَسُولِ اللهِ، اَلسَّلامُ عَلَيْكُمْ يا اَنْصارَ اَميرِ الْمُؤْمِنينَ، اَلسَّلامُ عَلَيْكُمْ يا اَنْصارَ فاطِمَةَ سَيِّدَةِ نِساءِ الْعالَمينَ، اَلسَّلامُ عَلَيْكُمْ يا اَنْصارَ أَبي مُحَمَّد الْحَسَنِ بْنِ عَلِيِّ الْوَلِيِّ النّاصِحِ، اَلسَّلامُ عَلَيْكُمْ يا اَنْصارَ اَبي عَبْدِاللهِ، بِاَبي اَنْتُمْ وَاُمّي طِبْتُمْ وَطابَتِ الاْرْضُ الَّتي فيها دُفِنْتُمْ، وَفُزْتُمْ فَوْزاً عَظيماً، فَيا لَيْتَني كُنْتُ مَعَكُمْ فَاَفُوزَ مَعَكُمْ.\n\n'
                      'ثمّ عُد الى عند رأس الحسين (عليه السلام) واكثر من الدّعاء لك ولاهلك ولوالديك ولاخوانك فانّ مشهده لا تردّ فيه دعوة داع ولا سؤال سائل.\n\n'
                      'أقول : تعرف هذه الزّيارة باسم زيارة وارث وهي مأخوذة عن كتاب مصباح المتهجّد للطّوسي وهو من أرقى الكتب المعتبرة المشهورة في الاوساط العلميّة، وقد اقتطفت هذه الزّيارة نصّاً عن ذلك المأخذ الشّريف من دُون واسطة اتّكل عليها فكانت كلمة الختام لزيارة الشّهداء هي فَيا لَيْتَني كُنْتُ مَعَكُمْ فَاَفُوزَ مَعَكُمْ، فالزّيادة التي ذيلت بها هذه الزّيارة وهي : فِي الْجِنانِ مَعَ النَّبِيّينَ وَالصِّدّيقينَ وَالشُّهَداءِ وَالصّالِحينَ وَحَسُنَ اُولئِكَ رَفيقاً اَلسَّلامُ عَلى مَنْ كانَ فِي الْحائِرِ مِنْكُمْ، وَعلى مَنْ لَمْ يَكُنْ فِي الْحائِرِ مَعَكُمْ …الخ انّما هي خروج عن المأثور ودسّ في الحديث.\n\n'
                      'قال شيخنا في كتابه الفارسي «لؤلؤ ومرجان» : انّ هذه الكلمات الّتي ذيلت بها هذه الرّواية انّما هي بدعة في الدّين وتجاسر على الامام (عليه السلام)بالزّيادة فيما صدر منه وفوق ذلك فهي تحتوي على أباطيل وأكاذيب بيّنة الكذب، والغريب المدهش انّها تنبث بين النّاس تذيع حتّى تهتف بها في كلّ يوم وليلة عدّة آلاف مرّة في مرقد الحُسين (عليه السلام) وبمحضر من الملائكة المقرّبين وفي مطاف الانبياء والمرسلين (عليهم السلام)ولا منكر ينكرها أو رادع يردع عن الكذب والعصيان ، فآل الامر الى أن تدوّن هذه الاباطيل وتطبع في مجاميع من الادعية والزّيارات يجمعها الحمقاء من عوام النّاس فتزعمها كتاباً فتجعل لها اسماً من الاسماء ثمّ تتلاقفها المجاميع فتسري من مجموعة احمق الى مجموعة احمق آخر، وتتفاقم المشكلة فيلتبس الامر على بعض طلبة العلم والدّين وانّي صادفت طالباً من طلبة العلم والدّين وهو يزُور الشّهداء بتلك الاباطيل القبيحة فمسست كتفه فالتفت الىَّ '
                      'فخاطبته قائلاً : ألا يشنع من الطّالب أن ينطق بمثل هذه الاباطيل في مثل هذا المحضر المقدّس ؟ قال : أليست هي مرويّة عن الامام (عليه السلام) ؟ فتعجّبت لسؤاله وأجبته بالنّفي . قال : فانّي قد وجدتها مدوّنة في بعض الكتب، فسألته عن الكتاب فأجاب كتاب مفتاح الجنان ، فسكتّ عنه فانّه لا يليق أن يكالم المرء رجلاً ادّى به الغفلة والجهل الى أن يعدّ المجموعة الّتي جمعها بعض العوام من النّاس كتاباً من الكتب ويستند اليه مصدراً لما يقول ، ثمّ بسط الشّيخ (رحمه الله) كلامه في هذا المقام وقال : انّ عدم ردع العوام عن نظائر هذه الامور الغير الهامّة والبدع الصّغيرة كغسل أويس القرن ] اش وأبي الدّرداء  [وهو التّابع المخلص لمعاوية، وصوم الصّمت بأن يتمالك المرء عن التكلّم بشيء في اليوم كلّه وغير ذلك من البدع الّتي لم يردع عنه رادع ولم ينكره منكر قد أورثت الجزأة والتّطاول ففي كلّ شهر من الشّهور وفي كلّ سنة من السّنين يظهر للنّاس نبيّ أو امام جديد فترى النّاس يخرجُون من دين الله أفواجاً ، انتهى.\n\n'
                      'وأقول: أنا الفقير ألاحظ هذا القول وانعم النّظر فيه انّه القول الصّادر عن عالم جليل واقف على ذوق الشّريعة المقدّسة واتّجاهاتها في سننها واحكامها وهو يبدي بوضوح مبلغ اهتمام هذا العالم الجليل بالامر ويكشف عمّا يكظمه في الفؤاد من الكابة والهمّ ، فهو يعرف مساويه وتبعاته على النّقيض من المحرومين عن علوم أهل البيت (عليهم السلام)المقتصرين على العلم بضغث من المصطلحات والالفاظ ، فهُم لا يعبأون بذلك ولا يبالون ، بل تراهم بالعكس يصحّحونه ويصوِّبونه ويجرون عليه في الاعمال، فيستفحل الخطب ويعاف كتاب مصباح المتهجّد والاقبال ومهج الدعوات وجمال الاسبوع ومصباح الزّائر والبلد الامين والجنّة الوافية ومفتاح الفلاح والمقباس وربيع الاسابيع والتّحفة وزاد المعاد ونظائرها ، فيستخلفها هذه المجاميع السّخيفة فيدسّ فيها في دعاء المجير وهو دعاء من الادعية المأثورة المُعتبرة كلمة بعفوك في سبعين موضعاً فلم ينكرها منكر، ودعاء الجوشن الكبير الحاوي على مائة فصل يبدع لكل فصل من فصوله أثراً من الاثار، ومع ما بلغتنا من الدّعوات المأثورة ذات المضامين السّامية '
                      'والكلمات الفصيحة البليغة يصاغ دعاء سخيف غاية السّخف فيسمّى بدعاء الحُبّى فينزّل من شرفات العرش فيفتري له من الفضل ما يدهش المرء ويبهته من ذلك والعياذ بالله انّ جبرئيل بلغ النّبي محمّداً (صلى الله عليه وآله وسلم) انّ الله تعالى يقول : انّي لا أعذّب عبداً يجعل معه هذا الدّعاء وان استوجب النّار وأنفق العمر كلّه في المعاصي ولم يسجد لي فيه سجدة واحدة انّني أمنحه أجر سبعين ألف نبيّ وأجر سبعين ألف زاهد وأجر سبعين ألف شهيد وأجر سبعين ألف من المُصلّين وأجر من كسى سبعين ألف عريان وأجر من أشبع سبعين ألف جائع، ووهبته من الحسنات عدد حصا الصّحارى وأعطيته أجر '
                      'سبعين ألف بقعة من الارض وأجر خاتم النّبوّة لنبيّنا (صلى الله عليه وآله وسلم) وأجر عيسى روح الله وابراهيم خليل الله وأجر اسماعيل ذبيح الله وموسى كليم الله ويعقوب نبيّ الله وآدم صفيّ الله وجبرئيل وميكائيل واسرافيل وعزرائيل والملائكة ، يا محمّد من دعا بهذا الدّعاء العظيم دعاء الحُبّى أو جعله معه غفرت له واستحييت أن أعذّبه … الخ.\n\n'
                      'وجدير بالمرء أن يستبدل الضّحك على هذه المفتريات الغريبة بالبكاء على كتب الشّيعة، ومؤلّفاتهم الكتب القيّمة التي بلغت الرّتبة السّامية ضبطاً وصحّة واتقاناً فكانت لا يستنسخها في الغالب الاّ رجال من أهل العلم والدّين فيقابلونها بنسخ نسختها أيدي أهل العلم وصحّحها العلماء، وكانوا يلمحون في الهامش الى ما عساه يوجد من الاختلاف بين النّسخ، ومن نماذج ذلك انّا نرى في دعاء مكارم الاخلاق كلمة وَبَلِّغْ بِايماني، فيرد في الهامش انّ في نسخة ابن اشناس وَاَبْلِغْ بِايماني، وفي رواية ابن شاذان اَللّـهُمَّ اَبْلِغْ ايماني، وقد نرى الاشارة الى انّ الكلمة وجدت بخطّ ابن سكون هكذا، وبخطّ الشّهيد هكذا، فهذه هي المرتبة الرّفيعة الّتي نالتها كتب الشّيعة ضبطاً واتقاناً وهذا مبلغ ما بذلوه من الجهد في مداقتها وتصحيحها والان نجدها قد عيفت وتركت فاستخلفها كتاب مفتاح الجنان الَّذي وقفت على نزر من صفتها فيكون هو الكتاب الوحيد الَّذي تتداوله الايدي ويرجع اليه العوام والخواص والعرب والعجم وما ذلك الاّ لان أهل العلم والدّين لا يبالون بالاحاديث والرّوايات، ولا يراجعُون كتب علماء أهل البيت الطّاهرين '
                      'وفقهائهم ولا ينكرون على أشباه هذه البدع والزّوايد وعلى دسّ الدّساسين والوضاعين وتحريف الجاهلين ولا يصدون من لا يرونه أهلاً ولا يردعون الحمقاء فيبلغ الامر حيث تلفق الادعية بما تقتضيه الاذواق أو يصاغ زيارات ومفجعات وصلوات ويطبع مجاميع عديدة من الادعية المدسوسة وينتج أفراخ لكتاب المفتاح، وتعمّ المشكلة فيروج الدّس والتّحريف ونراهما يسريان من كتب الادعية الى سائر الكتب والمؤلّفات فتجد مثلاً كتابي الفارسي المسمّى منتهى الامال المطبوع حديثاً قد عبث فيه الكاتب بما يلائم ذوقه وفكره، من نماذج ذلك انّ الكاتب دسّ كلمة الحمد لله في أربعة مواضع خلال سطرين من الكتاب فقد كتب في حال مالك بن يسر اللّعين انّه قد شلّت يداه بدعاء الحسين (عليه السلام) الحمد لله فكانتا في الصّيف كخشبتين يابستين الحمد لله وفي الشّتاء يتقاطر منهما الدّم الحمد لله فكان عاقبة أمره خُسراً الحمد لله . ودسّ ايضاً في بعض المواضِع كلمة السّيدة (خانم) عقيب اسم زينب وامّ كلثوم تجليلاً لهما واحتراماً وكان الكاتب مُعادياً لحميد بن '
                      'قحطبة فحرف اسمه الى حميد بن قحبة ثمّ احتاط احتياطاً فأشار في الهامش الى انّ بعض النّسخ حميد بن قحطبة واستصوب أن يكتب الاسم عبد الله عوض عبد ربّه والاسم زحر بن القيس وهو بالحاء المهملة التزم أن يسجله بالجيم أينما وجده، وخطّأ كلمة امّ سلمة فسجّلها امّ السّلمة ما وسعه ذلك والغاية الّتي توخيتها بعرض هذه النّماذج من التّحريف هي بيان أمرين :\n\n'
                      'أوّلاً : فلاحظ هذا الكاتب انّه لم يجر ما أجراه من الدّس والتّحريف الاّ وهو يزعم بفكره وذوقه انّ في الكتاب نقصاً يجب أن يزال وليس النّقص والوهن الاّ ما يجريه من التّحريف، فلنقس على ذلك الزّيادات الّتي يبعثنا الجهل على اضافتها الى الادعية والزّيارات والتغييرات والتّصرفات الّتي تقتضيها طباعنا وأذواقنا النّاقصة زعماً انّها تزيد الادعية والزّيارات كمالاً وبهاءً، وهي تنتزع منه الكمال والبهاء وتسلبها الاعتبار عند أهلها العارفين، فالجدير أن تتحافظ على نصوصها المأثورة فنجري عليها لا نزيد فيها شيئاً ولا نحرف منها حرفاً.\n\n'
                      'ولنلاحظ ثانياً : الكتاب الّتي تكلمنا عنه انّه كتاب لمؤلّف حيّ يراقب كتابه ويترصّد له فيجري فيه من التّحريف والتّشويه نظائر ما ذكرت فكيف القياس في سائر الكتب والمؤلّفات وكيف يجوز الاعتماد على الكتب المطبوعة الاّ اذا كانت من المؤلّفات المشهورة للعلماء المعروفين وعرضت على علماء الفنّ فصدّقوها وامضوها ، وقد روي في ترجمة الثّقة الجليل الفقيه المقدّم في اصحاب الائمة (عليهم السلام)يونس بن عبد الرّحمن انّه كان قد عمل كتاباً في أعمال اليوم واللّيلة فعرضه أبو هاشم الجعفري على الامام العسكري (عليه السلام) فتصفّحه (عليه السلام) كلّه ثمّ قال : هذا ديني ودين آبائي كلّه وهو الحقّ كلّه ، فهذا أبو هاشم الجعفري أراد الجري على كتاب يونس فلم يعتمد على سعة علم يونس وفقاهته وجلاله والتزامه بدينه حتّى عرض الكتاب على الامام (عليه السلام) واستعلم رأيه فيه، وروي ايضاً عن بُورق الشّنجاني الهروي وكان معروفاً بالصّدق والصّلاح والورع انّه وافى الامام '
                      'العسكري (عليه السلام) في سامراء وعرض عليه كتاب اليوم واللّيلة الَّذي ألّفه الشّيخ الجليل فضل بن شاذان وقال : جعلت فداك أردت أن تطالع هذا الكتاب تتصفّحه ، قال (عليه السلام) : هذا صحيحٌ ينبغي أن تعمل به، الى غير ذلك من الرّوايات في هذا الباب، وانّي قد قدمت على تأليف هذا الكتاب وانّي واقف على طباع النّاس في هذا العصر وعدم اهتمامهم لنظائر هذه الامور، وانّما ألّفته اتماماً للحجّة عليهم فجددت واجتهدت في '
                      'أخذ الادعية والزّيارات الواردة في هذا الكتاب عن مصادرها الاصيلة وعرضها على نسخ عديدة كما بذلت أقصى الجهد في تصحيحها واستخلاصها من الاخطاء كي يثق به العامل ويسكن اليه ان شاء الله، ولكن الشّرط هو أن لا يحرّفه الكاتب والمستنسخ وأن يتخلّى القاريء عمّا يقتضيه طبعه وذوقه من التّغيير.\n\n'
                      'روى الكليني (رضي الله عنه) عن عبد الرّحمن القصير قال : دخلت على الصّادق صلوات الله وسلامه عليه فقلت : جعلت فداك انّي اخترعت دعاء ، قال : دعني من اختراعك، فأعرض (عليه السلام) عن اختراعه ولم يسمح أن يعرض عليه ثمّ أنعم عليه بتعليمه عملاً ينبغي أن يؤدّيه.\n\n'
                      'وروى الصّدوق عطّر الله مرقده عن عبد الله بن سنان قال : قال الصّادق (عليه السلام) : سيصيبكم شبهة فتبقون بلا علم يرى ولا امام هدى ولا ينجو منها الاّ من دعا بدعاء الغريق ، قُلت : وكيف دعاء الغريق؟ قال: تقول: يا اللهُ يا رَحْمنُ يا رَحيمُ، يا مُقَلِّبَ الْقُلُوبِ ثَبِّتْ قَلْبي عَلى دينِكَ، فقُلت: يا مُقَلِّبَ الْقُلُوبِ وَالاَْبْصارِ ثَبِّتْ قَلْبي عَلى دينِكَ، فقال: انّ الله عزّوجل مقلّب القلوب والابصار ولكن قُل كما أقول : يا مُقَلِّبَ الْقُلُوبِ ثَبِّتْ قَلْبي عَلى دينِكَ، وحسب العابثين بالدّعوات اضافة وتحريفاً بما يقتضيه أذواقهم وطبائعهم الت عن عمّار عن الصّادق (عليه السلام) قال : تقول اذا انتهيت الى قبره (عليه السلام) :\n\n'
                      'اَلسَّلامُ عَلَيْكَ يا بْنَ رَسُولِ اللهِ، اَلسَّلامُ عَلَيْكَ يا بْنَ اَميرِ الْمُؤْمِنينَ، اَلسَّلامُ عَلَيْكَ يا اَبا عَبْدِاللهِ، اَلسَّلامُ عَلَيْكَ يا سَيِّدَ شَبابِ اَهْلِ الْجَنَّةِ وَرَحْمَةُ اللهِ وَبَرَكاتُهُ، اَلسَّلامُ عَلَيْكَ يا مَنْ رِضاهُ مِنْ رِضَا الرَّحْمنِ وَسَخَطُهُ مِنْ سَخَطِ الرَّحْمنِ، اَلسَّلامُ عَلَيْكَ يا اَمينَ اللهِ وَحُجَّةَ اللهِ وَبابَ اللهِ وَالدَّليلَ عَلَى اللهِ وَالدّاعي اِلَى اللهِ ،اَشْهَدُ اَنَّكَ قَدْ حَلَّلْتَ حَلالَ اللهِ، وَحَرَّمْتَ حَرامَ اللهِ، وَاَقَمْتَ الصَّلاةَ، وَآتَيْتَ الزَّكاةَ، وَاَمَرْتَ بِالمَعْروُفِ، وَنَهَيْتَ عَنِ الْمُنْكَرِ، وَدَعَوْتَ اِلى سَبيلِ رَبِّكَ بِالْحِكْمَةِ وَالْمَوْعِظَةِ الْحَسَنَةِ، وَاَشْهَدُ اَنَّكَ وَمَنْ قُتِلَ مَعَكَ شُهَداءٌ، اَحْياءٌ عِنْدَ رَبِّكُمْ تُرْزَقُونَ، وَاَشْهَدُ اَنَّ قاتِلَكَ فِي النّارِ اَدينُ اللهَ بِالْبَراءَةِ مِمَّنْ قَتَلَكَ وَمِمَّنْ قاتَلَكَ وَشايَعَ عَلَيْكَ، وَمِمَّنْ جَمَعَ عَلَيْكَ وَمِمَّنْ سَمِعَ صَوْتَكَ وَلَمْ يُعِنْكَ، يا لَيْتَني كُنْتُ مَعَكُمْ فَاَفُوزَ فَوْزاً عَظيماً .ّأمّل في هاتين الرّوايتين والله العالم.',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
            ],
          ),
        ),
        bottomNavigationBar: AddCustomBottomNavigationBar(
          pushNext: AlziyaratAlmotlakaAlsabi3a.screenRoute,
          pushBack: AlziyaratAlmotlakaAl5amisa.screenRoute,
          soud: '',
          onTap: (double fontSize) {
            // تحديث حجم الخط
            setState(() {
              isTablet ? _fontSizeTablet = fontSize : _fontSize = fontSize;
            });
            print('fontSize: $fontSize');
            // إغلاق Dialog
            Navigator.of(context).pop();
          },
          onLongPress: () {
            final snackBar = SnackBar(
              content: Center(
                child: Text(
                  '${isTablet ? _fontSizeTablet.toInt() : _fontSize.toInt()}',
                  style: TextStyle(
                    color: Colors.white,
                    fontSize: 16,
                  ),
                ),
              ),
              width: 60,
              behavior: SnackBarBehavior.floating,
              backgroundColor: Colors.blue,
              duration: Duration(seconds: 2),
              shape: ShapeBorder.lerp(
                RoundedRectangleBorder(
                  borderRadius: BorderRadius.circular(50),
                ),
                RoundedRectangleBorder(
                  borderRadius: BorderRadius.circular(50),
                ),
                1,
              ),
            );
            ScaffoldMessenger.of(context).showSnackBar(snackBar);
          },
        ),
      ),
    );
  }
}
