import 'package:flutter/material.dart';
import 'package:maktabat_almoslim/widgets/container_scrollview.dart';
import 'package:provider/provider.dart';
import 'package:shared_preferences/shared_preferences.dart';

import '../../../../widgets/list_of_nine_verses.dart';
import '../../../favorites_provider.dart';

class Fima3alaAlza2irMora3atoh extends StatefulWidget {
  static String screenRoute = 'fima_3ala_alza2ir_mora3atoh_screen';
  const Fima3alaAlza2irMora3atoh({super.key});

  @override
  State<Fima3alaAlza2irMora3atoh> createState() =>
      _Fima3alaAlza2irMora3atohState();
}

double _fontSize = 18;
double _fontSizeTablet = 30;

class _Fima3alaAlza2irMora3atohState extends State<Fima3alaAlza2irMora3atoh> {
  bool isIcon = true;
  @override
  void initState() {
    super.initState();
    _loadFavoriteState();
  }

  Future<void> _loadFavoriteState() async {
    final prefs = await SharedPreferences.getInstance();
    bool? savedState =
        prefs.getBool('isFavorite_fima_3ala_alza2ir_mora3atoh_screen');
    setState(() {
      isIcon = savedState ?? true;
    });
  }

  Future<void> _saveFavoriteState(bool value) async {
    final prefs = await SharedPreferences.getInstance();
    await prefs.setBool('isFavorite_fima_3ala_alza2ir_mora3atoh_screen', value);
  }

  @override
  Widget build(BuildContext context) {
    double size = MediaQuery.of(context).textScaleFactor;
    final screenWidth = MediaQuery.of(context).size.width;
    final isTablet = screenWidth >= 600;
    return Scaffold(
      appBar: AppBar(
        toolbarHeight: isTablet ? 100 : 50,
        centerTitle: true,
        leading: IconButton(
          onPressed: () {
            Navigator.of(context).pop();
          },
          icon: Icon(
            Icons.arrow_back,
            size: isTablet ? 50 : 25,
          ),
        ),
        actions: [
          IconButton(
            padding: EdgeInsets.only(left: isTablet ? 50 : 30),
            icon: Icon(
              isIcon ? Icons.favorite_border : Icons.favorite_rounded,
              size: isTablet ? 40 : 25,
              color: isIcon ? Colors.black : Colors.red,
            ),
            onPressed: () async {
              setState(() {
                isIcon = !isIcon;
              });
              await _saveFavoriteState(isIcon);

              if (!isIcon) {
                Provider.of<FavoritesProvider>(context, listen: false)
                    .addFavorite('فيما على الزائر مراعاته',
                        Fima3alaAlza2irMora3atoh.screenRoute);
              } else {
                Provider.of<FavoritesProvider>(context, listen: false)
                    .removeFavorite(
                        'فيما على الزائر مراعاته',
                        Fima3alaAlza2irMora3atoh.screenRoute,
                        Fima3alaAlza2irMora3atoh.screenRoute);
              }
            },
          ),
        ],
        title: Text(
          'فيما على الزائر مراعاته',
          style: TextStyle(
            fontSize: isTablet
                ? 40
                : size > 1.0
                    ? 20
                    : 23,
            fontWeight: FontWeight.bold,
          ),
        ),
      ),
      body: ContainerScrollview(
        widget: Column(
          crossAxisAlignment: CrossAxisAlignment.start,
          children: [
            Container(
              child: Column(
                children: [
                  Center(
                    child: Text(
                      'بسم الله الرحمن الرحيم',
                      style: TextStyle(
                        fontSize: isTablet ? _fontSizeTablet : _fontSize,
                        fontWeight: FontWeight.w900,
                      ),
                    ),
                  ),
                  Center(
                    child: Text(
                      'اللهم صلِّ على محمد وآل محمد',
                      style: TextStyle(
                        fontSize: isTablet ? _fontSizeTablet : _fontSize,
                        fontWeight: FontWeight.w900,
                      ),
                    ),
                  ),
                ],
              ),
            ),
            Container(
              padding: EdgeInsets.all(20),
              child: Text(
                'من الاداب في طريقه الى الزّيارة وفي ذلك الحرم الطّاهر وهي عديدة :',
                style: TextStyle(
                  fontWeight: FontWeight.w900,
                  fontSize: isTablet ? _fontSizeTablet + 4 : _fontSize - 1,
                  color: const Color.fromARGB(255, 17, 126, 20),
                ),
              ),
            ),
            Container(
              child: ListOfNineVerses(
                title: 'الاوّل :',
                subtitle:
                    'أن يصوم ثلاثة أيّام متوالية قبل الخروج من بيته ويغتسل في اليوم الثّالث على ما أمر الصّادق صلوات الله وسلامه عليه صفوان، وستأتي الرّواية عند ذكر الزّيارة السّابعة وقال الشّيخ محمّد بن المشهدي في مقدّمات زيارة العيدين: اذا أردت زيارته (عليه السلام) فصُم ثلاثة أيّام واغتسل في اليوم الثّالث واجمع اليك أهلك وعيالك وقُل :\n\n'
                    'اَللّـهُمَّ اِنّي اَسْتَوْدِعُكَ الْيَوْمَ نَفْسي وَاَهْلي وَمالي وَوَلَدي وَكُلَّ مَنْ كانَ مِنّي بِسَبيل، الشّاهِدَ مِنْهُمْ وَالْغائِبَ، اَللّـهُمَّ احْفَظْنا بِحِفْظِكَ بِحِفْظِ الاِْيمانِ وَاحْفَظْ عَلَيْنا، اَللّـهُمَّ اجْعَلْنا في حِرْزِكَ وَلا تَسْلُبْنا نِعْمَتَكَ وَلا تُغَيِّرْ ما بِنا مِنْ نِعْمَة وَعافِيَة، وَزِدْنا مِنْ فَضْلِكَ اِنّا اِلَيْكَ راغِبُونَ.\n\n'
                    'ثمّ اخرج من منزلك خاشعاً واكثر من قول لا اِلـهَ اِلاَّ اللهُ وَاللهُ اَكْبَرُ وَالْحَمْدُ للهِ وَمِن تمجيد الله تعالى والصّلاة على النّبي وآله صلوات الله عليهم وامض وعليك السّكينة والوقار . وروي انّ الله يخلق من عرق زوّار قبر الحسين (عليه السلام) من كلّ عرقة سبعين ألف ملك يسبحون الله ويستغفرون له ولزوّار الحسين (عليه السلام) الى أن تقوم السّاعة.',
                weight: FontWeight.w600,
                size: isTablet ? _fontSizeTablet : _fontSize,
              ),
            ),
            Container(
              child: ListOfNineVerses(
                title: 'الثّاني :',
                subtitle:
                    'عن الصّادق (عليه السلام) قال : اذا زرت أبا عبد الله (عليه السلام) فزره وأنت حزين مكروب شعث مغبر جائع عطشان فانّ الحسين عليهِ السلام قتل حزيناً مكروباً شعثاً مغبراً جائعاً عطشاناً واسأله الحوائج وانصرف عنه ولا تتّخذه وطناً.',
                weight: FontWeight.w600,
                size: isTablet ? _fontSizeTablet : _fontSize,
              ),
            ),
            Container(
              child: ListOfNineVerses(
                title: 'الثّالث :',
                subtitle:
                    'أن لا يُتّخذ الزّاد في سفر زيارته (عليه السلام) ممّا لذّ وطاب من الغذاء كاللّحم المشوي والحلاوة بل يغتذى بالخبز واللّبن، عن الصّادق صلوات الله وسلامه عليه قال : بلغني انّ قوماً اذا زاروا الحسين (عليه السلام)حملوا معهم السّفرة فيها الجداء والاخبصة واشباهه، ولو زاروا قبور آبائهم واحبّائهم ما حملوا معهم هذا، وقال المفضّل بن عمر في حديث معتبر آخر: تزورُون خير من أن لا تزورون ولا تزورون خير من أن تزورون ، قال : قلت قطعت ظهري ، قال : تالله ان احدكم ليذهب الى قبر أبيه كئيباً حزيناً وتأتونه بالسُّفر، كلاّ حتى تأتونه شعثاً غبراً.',
                weight: FontWeight.w600,
                size: isTablet ? _fontSizeTablet : _fontSize,
              ),
            ),
            Container(
              child: ListOfNineVerses(
                title: 'أقول :',
                subtitle:
                    'ما أجدر للاثرياء والتّجار أن يراعوا هذا الامر في سفر زيارة الحسين صلوات الله وسلامه عليه فاذا دعاهم أخلاؤهم في المدن الواقعة على المسير الى المادب رفضوا الدّعوة فاذا عمدوا الى حقائبهم وسفرهم يملؤونها بما طاب من مطبوخ الزّاد كالدّجاج المشوي وغيره من الشّواء أبوا ذلك وصدّوا عنه قائلينْ انّنا راحلون الى كربلاء ولا يجدر بنا أن نتغذّى بمثل ذلك.\n\n'
                    'روى الكليني (رحمه الله) انّه لمّا قتل الحسين صلوات الله وسلامه عليه اقامت امرأة الكلبيّة عليه مأتماً وبكت وبكت النّساء والخدم حتّى جفّت دموعهم فأهدى اليها الجونىَ وهو القطا على ما فسّرَ لِيَقْتَتْنَ به فَيَقْوينَ على البكاء على الحسين، (عليه السلام)فلمّا رأته سألت عنه فقيل: هو هديّة أهداها فلان تستعنّ بها في مأتم الحسين (عليه السلام)، فقالت: لَسْنا في عُرْس فَما نَصْنَعُ بِها فأمرت باخراجه من الدّار.',
                weight: FontWeight.w600,
                size: isTablet ? _fontSizeTablet : _fontSize,
              ),
            ),
            Container(
              child: ListOfNineVerses(
                title: 'الرّابع :',
                subtitle:
                    'ممّا ندب اليه في سفر زيارة الحسين (عليه السلام) هو التّواضع والتّذلّل والتّخاشع والمشي مشي العبد الذّليل فمن ركب من الزّائرين المراكب الحديثة التي تجري مسرعة بقوّة البخار وامثالها يجب عليه التّحفّظ والاحتراز عن الكبر والخيلاء والتّمالك عن التّبختُر على سائر الزّوار من عباد الله الّذين هم يقاسون الشّدائد والصّعاب في طريقهم الى كربلاء فلا ينظرون اليهم نظر التّحقير والازدراء.\n\n'
                    'روى العلماء في أصحاب الكهف انّهم كانوا من خاصّة دقيانوس ووزرائه فلمّا وسعتهم رحمة الله تعالى فاستقام فكرهم في معرفة الله عزّوجل وفي اصلاح شأنهم استقرّوا على الرّهبنة والانزواء عن الخلق والاواء الى كهف يعبدون الله تعالى فيه، فركبوا خيولهم وخرجوا من المدينة فلمّا ساروا ثلاثة اميال قال لهم تميلخا وكان هو أحدهم : يا اِخْوَتاهُ جاءَتْ مَسْكَنَةُ الاْخِرَةِ وَذَهَبَ مُلْكُ الدُّنْيا اِنْزِلُوا عَنْ خُيُولِكُمْ وَامْشُوا عَلى اَرْجُلِكُمْ (انزلوا عن الخيول وسيروا في سبيل اللهِ على ارجلكم لعلّ الله تعالى ينزّل عليكم عطفه ورحمته ويجعل لكم من امركم مخرجاً) فنزل اولئك العظماء الاجلاء عن خيولهم ومشوا على أرجلهم سبعة فراسخ في ذلك اليوم حتى تقاطرت ارجلهم دماً، فعلى زائر هذا القبر الشّريف أن يراعي هذا الامر وليعلم ايضاً انّ تواضعه في هذا الطريق لوجه الله تعالى انّما هو رفعة له واعتلاء.\n\n'
                    'وقد روي في آداب زيارته (عليه السلام) عن الصّادق (عليه السلام) قال : من أتى قبر الحسين صلوات الله وسلامه عليه ماشياً كتب الله له بكلّ خطوة الف حسنة، ومحا عنه ألف سيّئة، ورفع له الف درجة، فاذا أتيت الفرات فاغتسل وعلّق نعليك وامش حافياً وامش مشي العبد الذّليل.',
                weight: FontWeight.w600,
                size: isTablet ? _fontSizeTablet : _fontSize,
              ),
            ),
            Container(
              child: ListOfNineVerses(
                title: 'الخامس :',
                subtitle:
                    'أن يجتهد ما وسعه الاجتهاد في اعانة الزّائر الرّاجل اذا شاهده وقد تعب واعيا عن المسير فيهتمّ بشأنه ويبلغه منزلاً يستريح فيه، وحذار من الاستخفاف به وعدم الاهتمام لشأنه.\n\n'
                    'روى الكليني بسند معتبر عن أبي هارون ، قال : كنت عند الصّادق (عليه السلام)يوماً فقال لمن حضره : ماذا بكم تستخفّون بنا ؟ فقام من بينهم رجل من أهل خراسان وقال : نعوذ بالله أن نستخفّ بكم أو بشيء من امركم ، فقال : نعم أنت ممّن استخفّ بي واهانني ، قال الرّجل : اعوذ بالله أن اكون كذلك ، قال (عليه السلام) : ويلك ألم تسمع فلاناً يناديك عندما كنّا بقرب جحفة ويقول اركبني ميلاً فوالله لقد تعبت انّك والله لم ترفع اليه رأسك واستخففت به، ومن اذلّ مؤمناً فقد اذلّنا واضاع حرمة الله تعالى.',
                weight: FontWeight.w600,
                size: isTablet ? _fontSizeTablet : _fontSize,
              ),
            ),
            Container(
              child: ListOfNineVerses(
                title: 'أقول :',
                subtitle:
                    'راجع الادب التّاسع من آداب الزّيارات العامّة فقد أوردنا هناك كلاماً يناسب المقام، ورواية عن عليّ بن يقطين، وهذا الادب الَّذي ذكرناه هُنا لا يخصّ زيارة الحسين (عليه السلام)وانّما أوردناه هُنا في الاداب الخاصّة بزيارته (عليه السلام) لكثرة مصادفة موارده في هذه الزّيارة خاصّة.',
                weight: FontWeight.w600,
                size: isTablet ? _fontSizeTablet : _fontSize,
              ),
            ),
            Container(
              child: ListOfNineVerses(
                title: 'السّادس :',
                subtitle:
                    'عن الثّقة الجليل محمّد بن مُسلم عن الامام محمّد الباقر (عليه السلام)قال : قلت له: اذا خرجنا الى أبيك أفلسنا في حجّ ، قال : بلى ، قلت : فيلزمنا ما يلزم الحاج ، قال : يلزمك حُسن الصحبة لمن يصحبك، ويلزمك قلّة الكلام الاّ بخير، ويلزمك كثرة ذكر الله، ويلزمك نظافة الثّياب، ويلزمك الغسل قبل أن تأتي الحير، ويلزمك الخشوع وكثرة الصّلاة والصّلاة على محمّد وآل محمّد، ويلزمك التّحفّظ عمّا لا ينبغي لك، ويلزمك أن تغضى بصرك (من المحرّمات والمشتبهات)، ويلزمك أن تعود على أهل الحاجة من اخوانك اذا رأيت منقطعاً والمواساة (أن تناصفه نفقتك)، ويلزمك التّقيّة التي قوام دينك بها، والورع عمّا نهيت عنه، وترك الخصومة وكثرة الايمان والجدال الَّذي فيه الايمان، فاذا فعلت ذلك تمّ حجّك وعمرتك واستوجبت من الَّذي طلبت ما عنده بنفقتك واغترابك عن أهلك ورغبتك فيما رغبت أن تنصرف بالمغفرة والرحمة والرّضوان.',
                weight: FontWeight.w600,
                size: isTablet ? _fontSizeTablet : _fontSize,
              ),
            ),
            Container(
              child: ListOfNineVerses(
                title: 'السّابع :',
                subtitle:
                    'في حديث أبي حمزة الثّمالي عن الصّادق صلوات الله عليه في زيارة الحسين (عليه السلام) انّه قال : اذا بلغت نينوى فحطّ رحلك هُناك ولا تدهن ولا تكتحل ولا تأكل اللحم ما أقمت فيه.',
                weight: FontWeight.w600,
                size: isTablet ? _fontSizeTablet : _fontSize,
              ),
            ),
            Container(
              child: ListOfNineVerses(
                title: 'الثّامن :',
                subtitle:
                    'أن يغتسل بماء الفُرات ، فالروايات في فضله كثيرة، وفي رواية عن الصّادق صلوات الله وسلامه عليه قال : من اغتسل بماء الفُرات وزار قبر الحسين (عليه السلام) كان كيوم ولدته امّه صفراً من الذّنوب ولو اقترفها كبائر.\n\n'
                    'وروي انّه قيل له (عليه السلام) : ربّما أتينا قبر الحسين بن عليّ (عليهما السلام)فيصعب علينا الغُسل للزّيارة من البرد أو غيره ، فقال (عليه السلام): من اغتسل في الفرات وزار الحسين (عليه السلام) كُتب له من الفضل ما لا يحصى . وعن بشير الدّهان عن الصّادق (عليه السلام) قال : من أتى قبر الحسين بن عليّ (عليهما السلام) فتوضّأ واغتسل في الفرات لم يرفع قدماً ولم يضع قدماً الاّ كتب الله له حجّة وعُمرة، وفي بعض الرّوايات إئت الفرات واغتسل بحيال قبره، وكما يستفاد من بعض الرّوايات يحسن اذا بلغ الفرات أن يقول مائة مرّة اَللهُ اَكْبَرُ ومائة مرّة لا اِلـهَ اِلاَّ اللهُ ويصلّي على محمّد وآله مائة مرّة.',
                weight: FontWeight.w600,
                size: isTablet ? _fontSizeTablet : _fontSize,
              ),
            ),
            Container(
              child: ListOfNineVerses(
                title: 'التّاسع :',
                subtitle:
                    'أن يدخل الحائر المقدّس من الباب الشّرقي على ما أمر الصّادق صلوات الله وسلامه عليه يوسف الكناسي.',
                weight: FontWeight.w600,
                size: isTablet ? _fontSizeTablet : _fontSize,
              ),
            ),
            Container(
              child: ListOfNineVerses(
                title: 'العاشر :',
                subtitle:
                    'عن ابن قولويه عن الصّادق (عليه السلام) انّه قال للمفضّل بن عمر : يا مفضّل اذا بلغت قبر الحُسين صلوات الله وسلامه عليه فقف على باب الرّوضة وقل هذه الكلمات، فانّ لك بكلّ كلمة منها نصيباً من رحمة الله تعالى :\n\n'
                    'اَلسَّلامُ عَلَيْكَ يا وارِثَ آدَمَ صَفْوَةِ اللهِ، اَلسَّلامُ عَلَيْكَ يا وارِثَ نُوح نَبِيِّ اللهِ، اَلسَّلامُ عَلَيْكَ يا وارِثَ اِبْراهيمَ خَليلِ اللهِ، اَلسَّلامُ عَلَيْكَ يا وارِثَ مُوسى كَليمِ اللهِ، اَلسَّلامُ عَلَيْكَ يا وارِثَ عيسى رُوحِ اللهِ، اَلسَّلامُ عَلَيْكَ يا وارِثَ مُحَمَّد حَبيبِ اللهِ، اَلسَّلامُ عَلَيْكَ يا وارِثَ عَلِيِّ وَصِيِّ رَسُولِ اللهِ، اَلسّلامُ عَلَيْكَ يا وارِثَ الحَسَنِ الرَّضِّي، اَلسَّلامُ عَلَيكَ يا وارِثَ فاطِمَةَ بِنْتَ رَسُولِ اللهِ، اَلسَّلامُ عَلَيْكَ اَيُّهَا الشَّهيدُ الصِّدّيقُ اَلسَّلامُ عَلَيْكَ اَيُّهَا الْوَصِيُّ الْبارُّ الْتَّقِيُّ، اَلسَّلامُ عَلَى الاَْرْواحِ الَّتي حَلَّتْ بِفِنائِكَ وَاَناخَتْ بِرَحْلِكَ، اَلسَّلامُ عَلى مَلائِكَةِ اللهِ الُْمحْدِقينَ بِكَ، اَشْهَدُ اَنَّكَ قَدْ اَقَمْتَ الصَّلاةَ وَآتَيْتَ الزَّكاةَ وَاَمَرْتَ بِالْمَعْرُوفِ وَنَهَيْتَ عَنِ الْمُنْكَرِ وَعَبَدْتَ اللهَ مُخْلِصاً حَتّى اَتاكَ الْيَقينُ، اَلسَّلامُ عَلَيْكَ وَرَحْمَةُ اللهِ وَبَرَكاتُهُ '
                    'ثمّ تمضي الى القبر ولك بكلِّ خطوة تخطوها أجر المتشحّط بدمه في سبيل الله فاذا اقتربت من القبر فامسحه بيدك وقُل : اَلسَّلامُ عَلَيْكَ يا حُجَّةَ اللهِ في اَرْضِهِ وَسَمائِهِ ثمّ تمضي الى صلاتِك ولك بكلّ ركعة ركعتها عنده كثواب من حجّ ألف حجّة واعتمر الف عمرة واعتق في سبيل الله الف رقبة وكأنّما وقف في سبيل الله الف مرّة مع نبيّ مرسل . الخبر.',
                weight: FontWeight.w600,
                size: isTablet ? _fontSizeTablet : _fontSize,
              ),
            ),
            Container(
              child: ListOfNineVerses(
                title: 'الحادي عشر :',
                subtitle:
                    'روى عن أبي سعيد المدائني قال : أتيت الصّادق (عليه السلام)فسألته ءأذهب الى زيارة قبر الحسين (عليه السلام) فأجاب بلى اذهب الى زيارة قبر الحسين (عليه السلام) ابن رسول الله (صلى الله عليه وآله وسلم)أطيب الطيّبين واطهر الطّاهرين وأحسن المحسنين، فاذا زرته فسبّح عند رأسه بتسبيح امير المؤمنين (عليه السلام) ألف مرّة، وسبّح عند رجليه بتسبيح الزّهراء (عليها السلام) ألف مرّة، ثمّ صلّ عنده ركعتين تقرأ فيهما سورة يس والرّحمن، فاذا فعلت ذلك كان لك أجر عظيم ، قلت : جعلت فداك علّمني تسبيح عليّ وفاطمة (عليهما السلام) ، قال : بلى يا أبا سعيد تسبيح علي صلوات الله عليه هو :\n\n'
                    'سُبْحانَ الَّذي لا تَنْفَدُ خَزائِنُهُ، سُبْحانَ الَّذي لا تَبيدُ مَعالِمُهُ، سُبْحانَ الَّذي لا يَفْنى ما عِنْدَهُ، سُبْحانَ الَّذي لا يُشْرِكُ اَحَداً في حُكْمِهِ، سُبْحانَ الَّذي لاَ اضْمِحْلالَ لِفَخْرِهِ، سُبْحانَ الَّذي لاَ انْقِطاعَ لِمُدَّتِهِ، سُبْحانَ الَّذي لا اِلـهَ غَيْرُهُ.',
                weight: FontWeight.w600,
                size: isTablet ? _fontSizeTablet : _fontSize,
              ),
            ),
            Container(
              child: ListOfNineVerses(
                title: 'وتسبيح فاطمة (عليها السلام) هو :',
                subtitle:
                    'سُبْحانَ ذِي الْجَلالِ الْباذِخِ الْعَظيمِ، سُبْحانَ ذِي الْعِزِّ الشّامِخِ الْمُنيفِ سُبْحانَ ذِي الْمُلْكِ الْفاخِرِ الْقَديمِ، سُبْحانَ ذِي الْبَهْجَةِ وَالْجَمالِ، سُبْحانَ مَنْ تَرَدّى بِالنُّورِ وَالْوِقارِ، سُبْحانَ مَنْ يَرى اَثَرَ الَّنمْلِ فِي الصَّفا وَوَقَعَ الطَّيْرِ فِي الْهَواءِ.',
                weight: FontWeight.w600,
                size: isTablet ? _fontSizeTablet : _fontSize,
              ),
            ),
            Container(
              child: ListOfNineVerses(
                title: 'الثّاني عشر :',
                subtitle:
                    'أن يصلّي الفرائض والنّوافل عند قبر الحسين (عليه السلام) فانّ الصّلاة عنده مقبُولة، وقال السّيد ابن طاوُس (رحمه الله):اجتهد في أن تؤدّي صلاتك كلّها فريضة كانت أو نافلة في الحائر فقد روي انّ الفريضة عنده تعدل الحجّ، والنّافلة تعدل العمرة.',
                weight: FontWeight.w600,
                size: isTablet ? _fontSizeTablet : _fontSize,
              ),
            ),
            Container(
              child: ListOfNineVerses(
                title: 'أقول :',
                subtitle:
                    'قد مضى في حديث مفضّل فضل كثير للصّلاة في الحائر الشّريف، وفي رواية معتبرة عن الصّادق (عليه السلام) قال : من صلّى عنده ركعتين أو أربع ركعات كتبت له حجّة وعُمرة . والَّذي يبدو من الاخبار انّ صلاة الزّيارة أو غيرها من الصّلوات يحسن أداؤها خلف القبر كما يحسن أن تؤدّى ممّا يلي الرّأس الشّريف، وليتأخّر المُصلّي قليلاً اذا وقف ممّا يلي الرّأس حتى لا يكونُ محاذياً للقبر الشّريف، وورد في رواية أبي حمزة الثّمالي عن الصّادق (عليه السلام) انّه قال : صلّ عند رأسه ركعتين تقرأ في الاولى الحمد ويس وفي الثّانية الحمد والرّحمن وان شئت صلّيت خلف القبر وعند رأسه أفضل فاذا فرغت فصلّ ما أحببت الاّ انّ الركعتين ركعتي الزّيارة لابدّ منهما عند كلّ قبر . وروى ابن قولويه عن الباقر (عليه السلام) انّه قال لرجل : يا فلان ماذا يمنعك اذا عرضتك حاجة أن تمضي الى قبر الحسين صلوات الله عليه وتصلّي عنده أربع ركعات ثمّ تسأل حاجتك، انّ الفريضة عنده تعدل الحجّ، والنّافلة تعدل العُمرة.',
                weight: FontWeight.w600,
                size: isTablet ? _fontSizeTablet : _fontSize,
              ),
            ),
            Container(
              child: ListOfNineVerses(
                title: 'الثّالث عشر :',
                subtitle:
                    'اعلم انّ أهمّ الاعمال في الرّوضة الطّاهرة للحسين (عليه السلام)هو الدّعاء فانّ اجابة الدّعاء تحت قبّته السّامية هي ممّا خوله الله الحسين (عليه السلام)عوضاً عن الشّهادة، فعلى الزّائر أن يغتنم ذلك ولا يتوانى في التّضرّع الى الله والانابة والتّوبة وعرض الحوائج عليه وقد وردت في خلال زياراته عليه السلام أدعية كثيرة ذات مضامين عالية لم يسمح لنا الاختصار بايرادها هنا والافضل أن يدعو بدعوات الصّحيفة الكاملة ما وسعه الدّعاء فانّها أفضل الادعية، ونحن سنذكر دعاء يدعى به في جميع الرّوضات المقدّسة في أواخر هذا الباب بعد ذكر الزّيارات الجامعة وسنذكر دعاءً هو أجمع الادعية التي تقرأ في روضات الائمة عليه السلام، واحترازاً عن خلوّ المقام نثبت هنا دعاء وجيزاً ورد في خلال بعض الزّيارات، وهو انّه تقول في ذلك الحرم الشّريف رافعاً يديك الى السّماء :\n\n'
                    'اَللّـهُمَّ قَدْ تَرى مَكاني، وَتَسْمَعُ كَلامي، وَتَرى مَقامي وَتَضَرُّعي وَمَلاذي بِقَبْرِ حُجَّتِكَ وَابْنِ نَبِيِّكَ، وَقَدْ عَلِمْتُ يا سَيِّدي حَوائِجي وَلا يَخْفى عَلَيْكَ حالي، وَقَدْ تَوَجَّهْتُ اِلَيْكَ بِابْنِ رَسُولِكَ وَحُجَّتِكَ وَاَمينِكَ وَقَدْ اَتَيْتُكَ مُتَقَرِّباً بِهِ اِلَيْكَ وَاِلى رَسُولِكَ فَاجْعَلْني بِهِ عِنْدَكَ وَجيهاً فِي الدُّنْيا وَالاْخِرَةِ وَمِنَ الْمُقَرَّبينَ وَاَعْطِني بِزِيارَتي اَمَلي وَهَبْ لي مُناىَ وَتَفَضَّلْ عَلَيَّ بِشَهْوَتي وَرَغْبَتي وَاقْضِ لي حَوائِجي وَلا تَرُدَّني خائِباً وَلا تَقْطَعْ رَجائي وَلا تُخَيِّبْ دُعائي وَعَرِّفْنِى الاِْجابَةِ في جَميعِ ما دَعَوْتُكَ مِنْ اَمْرِ الدّينِ وَالدُّنْيا وَالاْخِرَةِ وَاجْعَلْني مِنْ عِبادِكَ الَّذينَ صَرَفْتَ عَنْهُمُ الْبَلايا وَالاَْمْراضَ '
                    'وَالْفِتَنَ وَالاَْعْراضَ مِنَ الدّينَ تُحْييهِمْ في عافِيَة وَتُميتُهُمْ في عافِيَة وَتُدْخِلُهُمُ الْجَنَّةَ في عافِيَة وَتُجيرُهُمْ مِنَ النّارِ في عافِيَة وَوَفِّقْ لي بِمَنْ مِنْكَ صَلاحَ ما اُؤَمِلَّ في نَفْسي وَاَهْلي وَوُلْدي وَاِخْواني وَمالي وَجَميعِ ما اَنْعَمْتَ بِهِ عَلَيَّ يا اَرْحَمَ الرّاحِمينَ .',
                weight: FontWeight.w600,
                size: isTablet ? _fontSizeTablet : _fontSize,
              ),
            ),
            Container(
              child: ListOfNineVerses(
                title: 'الرابع عشر :',
                subtitle:
                    'من اعمال حرم الحسين (عليه السلام) الصّلاة عليه وروي انّك تقف خلف القبر عند كتفه الشّريف وتصلّي على النّبي (صلى الله عليه وآله وسلم) وعلى الحسين صلوات الله عليه، وقد أورد السّيد ابن طاوُس في مصباح الزّائر في خلال بعض الزّيارات هذه الصّلاة عليه :\n\n'
                    'اَللّـهُمَّ صَلِّ عَلى مُحَمَّد وَآلِ مُحَمَّد، وَصَلِّ عَلى الْحُسَيْنِ الْمَظْلُومِ الشَّهيدِ، قَتيلِ الْعَبَراتِ، وَاَسيرِ الْكُرُباتِ، صَلاةً نامِيَةً زاكِيَةً مُبارَكَةً يَصْعَدُ اَوَّلُها وَلا يَنْفَدُ آخِرُها اَفْضَلَ ما صَلَّيْتَ على اَحَد مِنْ اَوْلادِ الاَْنْبِياءِ وَالْمُرْسَلينَ يا رَبَّ الْعالِمينَ، اَللّـهُمَّ صَلِّ عَلَى الاِْمامِ الشَّهيدِ الْمَقْتُولِ الْمَظْلُومِ الَْمخْذُولِ، وَالسَّيِّدِ الْقائِدِ، وَالْعابِدِ الزّاهِدِ، والْوَصِيِّ الْخَليفَةِ الاِْمامِ الصِّدّيقِ الطُّهْرِ الطّاهِرِ الطَّيِّبِ الْمُبارَكِ، وَالرَّضِيِّ الْمَرْضِيِّ وَالتَّقِيِّ الْهادِي الْمَهْدِيِّ الزّاهِدِ الذّائِدِ الُْمجاهِدِ الْعالِمِ، اِمامِ الْهُدى سِبْطِ الرَّسُولِ، وَقُرَّةِ عَيْنِ الْبَتُولِ صَلَّى اللهُ عَلَيْهِ وَآلِهِ وَسَلَّمَ، اَللّـهُمَّ صَلِّ عَلى سَيِّدي وَمَوْلايَ كَما عَمِلَ بِطاعَتِكَ وَنَهى عَنْ مَعْصِيَتِكَ وَبالَغَ في رِضْوانِكَ، وَاَقْبَلَ عَلى ايمانِكَ غَيْرَ قابِل فيكَ عُذْراً سِرّاً وَعَلانِيَةً يَدْعُو الْعِبادِ اِلَيْكَ، وَ يَدُلُّهُمْ عَلَيْكَ، وَقامَ بَيْنَ يَدَيْكَ يَهْدِمُ الْجَوْرَ بِالصَّوابِ، وَيُحْيِي السُّنَّةَ بِالْكِتابِ، فَعاشَ في رِضْوانِكَ مَكْدُوداً، وَمَضى عَلى طاعَتِكَ وَفي اَوْلِيآئِكَ مَكْدُوحاً، وَقَضى اِلَيْكَ مَفْقُوداً لَمْ يَعْصِكَ في لَيْلِ وَلا نَهار بَلْ جاهَدَ فيكَ الْمُنافِقينَ وَالْكُفّارَ، اَللّـهُمَّ فَاَجْزِهِ خَيْرَ جَزاءِ الصّادِقينَ الاَْبْرارِ، '
                    'وَضاعِفْ عَلَيْهِمُ الْعَذابَ وَلِقاتِليهِ الْعِقابَ، فَقَدْ قاتَلَ كَريماً وَقُتِلَ مَظْلُوماً وَمَضى مَرْحُوماً، يَقُولُ اَنَا ابْنُ رَسُولِ اللهِ مُحَمَّد، وَابْنُ مَنْ زَكّى وَعَبَدَ، فَقَتَلُوهُ بِالْعَمْدِ الْمُعْتَمَدِ قَتَلُوهُ عَلَى الاْيمانِ وَ اَطاعُوا في قَتْلِهِ الشَّيْطانَ وَلَمْ يُراقِبُوا فيهِ الرَّحْمنَ، اَللّـهُمَّ فَصَلِّ عَلى سَيِّدي وَمَوْلايَ صَلاةً تَرْفَعُ بِها ذِكْرَه وَتُظْهِرُ بِها اَمْرَهُ، وَتُعَجِّلُ بِها نَصْرَهُ، وَاخْصُصْهُ بِاَفْضَلِ قِسَمِ الْفَضائِلِ يَوْمَ الْقِيامَةِ وَزِدْهُ شَرَفاً في اَعَلى عِلِّيِّينَ، وَبَلِّغْهُ اَعَلى شَرَفِ الْمُكَرَّمينَ وَاَرْفَعْهُ مِنْ شَرَفِ رَحْمَتِكَ في شَرَفِ الْمُقَرَّبينَ في الرَّفيعِ الاَْعَلى، وَبَلِّغْهُ الْوَسيلَةَ وَالْمَنْزِلَةَ الْجَليلَةَ وَالْفَضْلَ وَالْفَضيلَةَ وَالْكِرامَةَ الْجَزيلَةَ، اَللّـهُمَّ فَاَجْزِهِ عَنّا اَفْضَلَ ما جازَيْتَ اِماماً عَنْ رَعِيَّتِهِ، وَصَلِّ عَلى سَيِّدي و مَوْلايَ كُلَّما ذُكِرَ، وَكُلَّما لَمْ يُذْكَرْ يا سَيِّدي و مَوْلايَ أدْخِلْني في حِزْبِكَ وَزُمْرَتِكَ، وَاِسْتَوْهِبْني مِنْ رَبِّكَ وَرَبّي فَاِنَّ لَكَ عِنْدَ اللهِ جاهاً وَقَدْراً وَمَنْزِلَةً رَفيعَةً، اِنْ سَأَلْتَ '
                    'اُعْطيتَ وَاِنْ شَفَعْتَ شُفِّعْتَ اللهَ اللهَ في عَبْدِكَ وَمَوْلاكَ لا تُخَلِّني عِنْدَ الشَّدائِدِ وَالاَْهْوالِ لِسُوءِ عَمَلي وَقَبيحِ فِعْلي وَعَظيمِ جُرْمي، فَاِنَّكَ اَمَلي وَرَجائي وَثِقَتي وَمُعْتَمَدي وَوَسيلَتي اِلَى اللهِ رَبّي وَرَبِّكَ لَمْ يَتَوَسَّلِ الْمُتَوَسِّلُونَ اِلَى اللهِ بِوَسيلَة هِىَ اَعْظَمُ حَقاً وَلا اَوْجَبُ حُرْمَةً وَلا اَجَّلُ قَدْراً عِنْدَهُ مِنْكُمْ اَهْلَ الْبَيْتِ لا خَلَّفَنِىَ اللهُ عَنْكُمْ بِذُنُوبي وَجَمَعَني وَاِيّاكُمْ في جَنَّةِ عَدْن الَّتي اَعَدَّها لَكُمْ وَلاَِوْلِيائِكُمْ اِنَّهُ خَيْرُ الْغافِرينَ وَ اَرْحَمَ الرّاحِمينَ، اَللّـهُمَّ اَبْلِغْ سَيِّدي وَمَوْلايَ تَحِيَّةً كَثيرَةً وَسَلاماً، وَارْدُدْ عَلَيْنا مِنْهُ السَّلامِ اِنَّكَ جَوادٌ كَريمٌ، وَصَلِّ عَلَيْهِ كُلَّما ذُكِرَ السَّلامُ وَكُلَّما لَمْ يُذْكَرْ يا رَبَّ الْعالَمينَ.',
                weight: FontWeight.w600,
                size: isTablet ? _fontSizeTablet : _fontSize,
              ),
            ),
            Container(
              child: ListOfNineVerses(
                title: 'أقول :',
                subtitle:
                    'قد أوردنا تلك الزّيارة في خلال اعمال يوم عاشوراء وسنذكر في أواخر الباب صلاة يصلّى بها على الحجج الطّاهرين (عليهم السلام)تتضمّن صلاة وجيزة على الحسين (عليه السلام) فلا تدع قراءتها.',
                weight: FontWeight.w600,
                size: isTablet ? _fontSizeTablet : _fontSize,
              ),
            ),
            Container(
              child: ListOfNineVerses(
                title: 'الخامس عشر :',
                subtitle:
                    'من أعمال هذه الرّوضة المنوّرة دعاء المظلوم على الظّالم أي ينبغي لمن بغى عليه باغ أن يدعو بهذا الدّعاء في ذلك الحرم الشّريف، وهو ما أورده شيخ الطّايفة (رحمه الله) في مصباح المتهجّد في أعمال الجمعة ، قال : ويستحبّ أن يدعو بدعاء المظلوم عند قبر ابي عبدالله وهو : اَللّـهُمَّ اِنّي اَعْتَزُّ بِدينِكَ وَاكْرُمُ بِهِدايَتِكَ وَفُلانٌ يُذِلُّني بِشَرِّهِ وَيُهينُني بِاَذِيَّتِهِ، وَيُعيبُني بِوَلاءِ اَوْلِيائِكَ، وَيَبْهَتُني بِدَعْواهُ، وَقَدْ جِئْتُ اِلى مَوْضِعِ الدُّعاءِ وَضَمانِكَ الاِْجابَةَ، اَللّـهُمَّ صَلِّ عَلى مُحَمَّد وَآلِ مُحَمَّد وَاَعْدني عَلَيْهِ السّاعَةَ السّاعَةَ، ثمّ تنكبّ على القبر وتقول : مَوْلايَ اِمامي مَظْلُومٌ اسْتَعْدي عَلى ظالِمِهِ النَّصْرَ النَّصْرَ حتّى ينقطع النّفس.',
                weight: FontWeight.w600,
                size: isTablet ? _fontSizeTablet : _fontSize,
              ),
            ),
            Container(
              child: ListOfNineVerses(
                title: 'السّادس عشر :',
                subtitle:
                    'من اعمال ذلك الحرم الشّريف الدّعاء الَّذي رواه ابن فهد (رحمه الله)في عدّة الدّاعي عن الصّادق (عليه السلام) قال : من كان له الى الله تعالى حاجة فليقف عند رأس الحسين (عليه السلام) ويقول : يا اَبا عَبْدِاللهِ، اَشْهَدُ اَنَّكَ تَشْهَدُ مَقامي وَتَسْمَعُ كَلامي وَاَنَّكَ حَيٌّ عِنْدَ رَبِّكَ تُرْزَقُ فَاسْأَلْ رَبَّكَ وَرَبِّي في قَضاءِ حَوائِجي، فأنّه يقضى حاجته ان شاء الله تعالى.',
                weight: FontWeight.w600,
                size: isTablet ? _fontSizeTablet : _fontSize,
              ),
            ),
            Container(
              child: ListOfNineVerses(
                title: 'السّابع عشر :',
                subtitle:
                    'من جملة الاعمال في ذلك الحرم الشّريف الصّلاة عند الرّأس المقدّس ركعتان بسورة الرّحمن وسورة تبارك.\n\n'
                    'روى السّيد ابن طاوُس (رحمه الله) انّ من صلاها كتب الله له خمساً وعشرين حجّة مقبولة مبرورة مع رسول الله (صلى الله عليه وآله وسلم).',
                weight: FontWeight.w600,
                size: isTablet ? _fontSizeTablet : _fontSize,
              ),
            ),
            Container(
              child: ListOfNineVerses(
                title: 'الثّامن عشر :',
                subtitle:
                    'من الاعمال تحت تلك القبّة السّامية الاستخارة، وصفتها على ما أوردها العلاّمة المجلسي (رحمه الله) ومصدر الرّواية كتاب قُرب الاسناد للحميري ، قال بسند صحيح عند الصّادق (عليه السلام) قال : ما استخار الله عزّوجلّ عبد في أمر قط مائة مرّة يقف عند رأس الحُسين صلوات الله عليه ويقول : اَلْحَمْدُ للهِِ وَلا اِلـهَ اِلاَّ اللهُ وَسُبْحانَ اللهِ فيحمد الله ويهلّله ويسبّحه ويمجّده ويثنى عليه بما هو أهله ويستخيره مائة مرّة الاّ رماه اللهُ تبارك وتعالى بأخير الامرين . وعلى رواية اخرى يستخير الله مائة مرّة قائلاً : اَسْتَخيرُ اللهَ بِرَحْمَتِهِ خِيَرَةً فِي عافِيَة.',
                weight: FontWeight.w600,
                size: isTablet ? _fontSizeTablet : _fontSize,
              ),
            ),
            Container(
              child: ListOfNineVerses(
                title: 'التّاسع عشر :',
                subtitle:
                    'روى الشّيخ الاجل الكامل أبو القاسم جعفر بن قولويه القمّي (رحمه الله)عن الصّادق صلوات الله عليه انّه قال : اذا زرتم أبا عبد الله الحسين (عليه السلام) فألزموا الصّمت الاّ عن الخير، وانّ ملائكة اللّيل والنّهار من الحفظة يحضرون عند الملائكة الّذين هم في الحاير، ويصافحونهم فلا يجيبهم ملائكة الحائر من شدّة البكاء وهم ابداً يبكون ويندبون لا يفترون الاّ عند الزّوال وعند طلوع الفجر فالحفظة ينتظرون حين يحين الظّهر أو يطلع الفجر فيكالمونهم ويسألونهم عن امور من السّماء وهم لا يمسكون عن الدّعاء والبكاء فيما بين هاتين الفترتين.\n\n'
                    'وروي ايضاً عنه (عليه السلام) انّ الله تعالى قد وكّل على قبر الحسين صلوات الله عليه أربعة آلاف من الملائكة شعث غبر على هيئة اصحاب العزاء يبكون عليه من طلوع الفجر الى الزّوال فاذا زالت الشّمس عرجوا وهبط مثلهم يبكون الى طلوع الفجر، والاحاديث في ذلك كثيرة ويبدو من هذه الاحاديث استحباب البكاء عليه في ذلك الحرم الطّاهر بل الجدير أن يعد البكاء عليه والرّثاء له من اعمال تلك البُقعة المباركة الّتي هي بيت الاحزان للشّيعة الموالين، ويستفاد من حديث صفوان عن الصّادق (عليه السلام) انّه لا يهنأ للمرء أكله وشربه لو اطّلع على تضرّع الملائكة الى الله تعالى في اللّعن على قتلة امير المؤمنين والحسين (عليهما السلام) ، ونياح الجنّ عليهما وبكاء الملائكة الّذين هم حول ضريح الحسين (عليه السلام) وشدّة حزنهم . وفي حديث عبد الله بن حماد البصري عن الصّادق صلوات الله وسلامه عليه انّه قال : بلغني انّ قوماً '
                    'يأتون من نواحي الكوفة وناساً من غيرهم ونساء يندبنه فمن بين قاريء يقرأ وقاص يقصّ أي يذكر المصائب ونادب يندب وقائل يقول المراثي ، فقلت له : نعم جعلت فداك قد شهدت بعض ما تصف ، فقال : الحمد لله الَّذي جعل في النّاس من يفد الينا ويمدحنا ويرثي لنا، وجعل عدوّنا من يطعن عليهم من قرابتنا أو غيرهم يهدون بهم ويقبّحون ما يصنعون.\n\n'
                    'وقد ورد في أوائل هذا الحديث انّه يبكيه من زاره ويحزن له من لم يزره، ويحترق له من لم يشهده، ويرحمه من نظر الى قبر ابنه عند رجليه في ارض فلاة ولا حميم قربة، ولا قريب، ثمّ منع الحقّ وتوازر عليه أهل الرّدة حتّى قتلوه وضيّعوه وعرضوه للسّباع، ومنعوه شرب ماء الفرات الَّذي يشربه الكلاب وضيّعوا حقّ رسُول الله (صلى الله عليه وآله وسلم) ووصيّته به وبأهل بيته.\n\n'
                    'وروى ايضاً ابن قولويه عن حارث الاعور عن امير المؤمنين صلوات الله عليه انّه قال : بأبي واُمّي الحسين الشّهيد خلف الكوفة، والله كأنّي أرى وحُوش الصّحراء من كلّ نوع قد مدّت اعناقها على قبره تبكي عليه ليلها حتّى الصّباح فاذا كان كذلك فايّاكم والجفاء، والاخبار في ذلك كثيرة.',
                weight: FontWeight.w600,
                size: isTablet ? _fontSizeTablet : _fontSize,
              ),
            ),
            Container(
              child: ListOfNineVerses(
                title: 'العشرون :',
                subtitle:
                    'قال السّيد ابن طاوُس (رحمه الله) يستحبّ للمرء اذا فرغ من زيارته (عليه السلام)وأراد الخروج من الرّوضة المقدّسة أن ينكبّ على الضّريح ويُقبّله ويقول : اَلسَّلامُ عَلَيْكَ يا مَوْلايَ، اَلسَّلامُ عَلَيْكَ يا حُجَّةَ اللهِ، اَلسَّلامُ عَلَيْكَ يا صِفْوَةَ، اللهِ اَلسَّلامُ عَلَيْكَ يا خالِصَةَ اللهِ، اَلسَّلامُ عَلَيْكَ يا قَتيلَ الظَّماءِ، اَلسَّلامُ عَلَيْكَ يا غَريبَ الْغُرَباءِ، اَلسَّلامُ عَلَيْكَ سَلامَ مُوَدِّع لا سَئِم وَلا قال، فَاِنْ اَمْضِ فَلا عَنْ مَلالَة، وَاِنْ اُقِمْ فَلا عَنْ سُوءِ ظَن بِما وَعَدَ اللهُ الصّابِرينَ، لا جَعَلَهُ اللهُ آخِرَ الْعَهْدِ مِنّي لِزِيارَتِكَ، وَرَزَقَنِيَ اللهُ الْعَوْدَ اِلى مَشْهَدِكَ وَالْمَقامَ بِفَنائِكَ وَالْقِيامَ فِي حَرَمِكَ وَاِيّاهُ اَسْألُ اَنْ يُسْعِدَني بِكُمْ وَيَجْعَلَني مَعَكُمْ فِي الدّنْيا وَالاْخِرَةِ.',
                weight: FontWeight.w600,
                size: isTablet ? _fontSizeTablet : _fontSize,
              ),
            ),
            Padding(
              padding: const EdgeInsets.only(
                top: 20,
                bottom: 20,
                left: 40,
                right: 40,
              ),
              child: Slider(
                value: isTablet ? _fontSizeTablet : _fontSize,
                min: isTablet ? 30 : 18,
                max: isTablet ? 50 : 30,
                divisions: 40,
                label: isTablet
                    ? _fontSizeTablet.toStringAsFixed(1)
                    : _fontSize.toStringAsFixed(1),
                onChanged: (value) {
                  setState(() {
                    isTablet ? _fontSizeTablet = value : _fontSize = value;
                  });
                },
              ),
            ),
          ],
        ),
      ),
    );
  }
}
