import 'package:flutter/material.dart';
import 'package:maktabat_almoslim/widgets/container_scrollview.dart';
import 'package:provider/provider.dart';
import 'package:shared_preferences/shared_preferences.dart';

import '../../../../widgets/add_custom_bottom_navigation_bar.dart';
import '../../../../widgets/list_of_nine_verses.dart';
import '../../../favorites_provider.dart';
import '../../../favorites_screen.dart';
import '../ramadan.dart';
import 'douaa_abi_7amza_alsamali.dart';
import 'fi_2a3mal_2ayam_shaher_ramadan.dart';

class DouaaAlsa7ar extends StatefulWidget {
  static String screenRoute = 'douaa_alsa7ar_screen';
  const DouaaAlsa7ar({super.key});

  @override
  State<DouaaAlsa7ar> createState() => _DouaaAlsa7arState();
}

double _fontSize = 18;
double _fontSizeTablet = 30;

class _DouaaAlsa7arState extends State<DouaaAlsa7ar> {
  bool isIcon = true;
  @override
  void initState() {
    super.initState();
    _loadFavoriteState();
  }

  Future<void> _loadFavoriteState() async {
    final prefs = await SharedPreferences.getInstance();
    bool? savedState = prefs.getBool('isFavorite_douaa_alsa7ar_screen');
    setState(() {
      isIcon = savedState ?? true;
    });
  }

  Future<void> _saveFavoriteState(bool value) async {
    final prefs = await SharedPreferences.getInstance();
    await prefs.setBool('isFavorite_douaa_alsa7ar_screen', value);
  }

  Future<bool> _onWillPop() async {
    final args =
        ModalRoute.of(context)!.settings.arguments as Map<String, dynamic>?;
    final previousPage = args?['previousPage'];
    if (previousPage == 'favorite_screen') {
      Navigator.of(context).pushReplacementNamed(FavoritesScreen.screenRoute);
      return false;
    } else {
      Navigator.of(context).pushReplacementNamed(Ramadan.screenRoute);
      return false;
    }
  }

  @override
  Widget build(BuildContext context) {
    double size = MediaQuery.of(context).textScaleFactor;
    final screenWidth = MediaQuery.of(context).size.width;
    final isTablet = screenWidth >= 600;
    return WillPopScope(
      onWillPop: _onWillPop,
      child: Scaffold(
        appBar: AppBar(
          toolbarHeight: isTablet ? 100 : 50,
          centerTitle: true,
          leading: IconButton(
            onPressed: _onWillPop,
            icon: Icon(
              Icons.arrow_back,
              size: isTablet ? 50 : 25,
            ),
          ),
          actions: [
            IconButton(
              padding: EdgeInsets.only(left: isTablet ? 50 : 30),
              icon: Icon(
                isIcon ? Icons.favorite_border : Icons.favorite_rounded,
                size: isTablet ? 40 : 25,
                color: isIcon ? Colors.black : Colors.red,
              ),
              onPressed: () async {
                setState(() {
                  isIcon = !isIcon;
                });
                await _saveFavoriteState(isIcon);

                if (!isIcon) {
                  Provider.of<FavoritesProvider>(context, listen: false)
                      .addFavorite('دعاء السحر', DouaaAlsa7ar.screenRoute);
                } else {
                  Provider.of<FavoritesProvider>(context, listen: false)
                      .removeFavorite('دعاء السحر', DouaaAlsa7ar.screenRoute,
                          DouaaAlsa7ar.screenRoute);
                }
              },
            ),
          ],
          title: Text(
            'دعاء السحر',
            style: TextStyle(
              fontSize: isTablet
                  ? 40
                  : size > 1.0
                      ? 20
                      : 23,
              fontWeight: FontWeight.bold,
            ),
          ),
        ),
        body: ContainerScrollview(
          widget: Column(
            crossAxisAlignment: CrossAxisAlignment.start,
            children: [
              Container(
                child: Column(
                  children: [
                    Center(
                      child: Text(
                        'بسم الله الرحمن الرحيم',
                        style: TextStyle(
                          fontSize: isTablet ? _fontSizeTablet : _fontSize,
                          fontWeight: FontWeight.w900,
                        ),
                      ),
                    ),
                    Center(
                      child: Text(
                        'اللهم صلِّ على محمد وآل محمد',
                        style: TextStyle(
                          fontSize: isTablet ? _fontSizeTablet : _fontSize,
                          fontWeight: FontWeight.w900,
                        ),
                      ),
                    ),
                  ],
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: 'الأول :',
                  subtitle: 'قال الشّيخ أيضاً تدعو في السّحر بهذا الدّعاء :\n\n'
                      'يا عُدَّتي في كُرْبَتي، وَيا صاحِبي في شِدَّتي، وَيا وَلِيّي في نِعْمَتي، وَيا غايَتي في رَغْبَتـي، اَنْتَ السّاتِرُ عَوْرَتي، وَالْمُؤْمِنُ رَوْعَتي، وَالْمُقيلُ عَثْرَتي، فَاغْفِرْ لي خَطيئَتي، اَللّـهُمَّ اِنّي اَسْاَلُكَ خُشُوعَ الايمانِ قَبْلَ خُشُوعِ الذّلِّ فِي النّارِ، يا واحِدُ يا اَحَدُ يا صَمَدُ يا مَنْ لَمْ يَلِدْ وَلَمْ يُولَدْ وَلَمْ يَكُنْ لَهُ كُفواً اَحَدٌ، يا مَنْ يُعْطي مَنْ سَأَلَهُ تَحَنُّناً مِنْهُ وَرَحْمَةً، وَيَبْتَدِئُ بِالْخَيْرِ مَنْ لَمْ يَسْأَلْهُ تَفَضُّلاً مِنْهُ وَكَرَماً، بِكَرَمِكَ الّدائِمِ صَلِّ عَلى مُحَمَّد وَآلِِ مُحَمَّد، وَهَبْ لي رَحْمَةً واسِعَةً جامِعَةً اَبْلُغُ بِها خَيْرَ الدُّنْيا وَالاَْخِرَةِ، اَللّـهُمَّ اِنّي اَسْتَغْفِرُكَ لِما تُبْتُ اِلَيْكَ مِنْهُ ثُمَّ عُدْتُ فيهِ، وَاَسْتَغْفِرُكَ لِكُلِّ خَيْر اَرَدْتُ بِهِ وَجْهَكَ فَخالَطَني فيهِ ما لَيْسَ لَكَ، اَللّـهُمَّ صَلِّ عَلى مُحَمَّد وَآلِِ مُحَمَّد وَاعْفُ عَنْ ظُلْمي وَجُرْمي بِحِلْمِكَ وَجُودِكَ يا كَريمُ، يا مَنْ لا يَخيبُ سائِلُهُ، وَلا يَنْفَدُ نائِلُهُ، يا مَنْ عَلا فَلا شَيْءَ فَوْقَهُ، وَدَنا فَلا شَيءَ دُونَهُ، صَلِّ عَلى مُحَمَّد وآلِ مُحَمَّد وَارْحَمْني، يا فالِقَ الْبَحْرِ لِمُوسى، اللَّيلَةَ اللَّيْلَةَ اللَّيْلَةَ، السّاعَةَ السّاعَةَ السّاعَةَ، اَللّـهُمَّ طَهِّرْ قَلْبي مِنَ النِّفاقِ، وَعَمَلي مِنَ الرِّياءِ، وَلِساني مِنَ الْكَذِبِ، وَعَيْني مِنَ الْخِيانَةِ، فَاِنَّكَ تَعْلَمُ خائِنَةَ الاَْعْيُنِ وَما تُخْفِي الصُّدورِ يا رَبِّ هذا مَقامُ الْعائِذِ بِكَ مِنَ النّارِ، هذا مَقامُ الْمُسْتَجيرِ بِكَ مِنَ النَّارِ، هذا مَقامُ الْمُسْتَغيثِ بِكَ مِنَ النّارِ، هذا مَقامُ الْهارِبِ اِلَيْكَ مِنَ النّارِ، هذا مَقامُ مَنْ يَبُوءُ لَكَ بِخَطيئَتِهِ وَيَعْتَرِفُ بِذَنْبِهِ وَيَتُوبُ اِلى رَبِّهِ، هذا مَقامُ الْبائِسِ الْفَقيرِ، هذا مَقامُ الْخائِفِ الْمُسْتَجيرِ، هذا مَقامُ الَْمحْزُونِ الْمَكْرُوبِ، هذا مَقامُ الْمَغْمُومِ الْمَهْمُومِ، هذا مَقامُ الْغَريبِ الْغَريقِ، هذا مَقامُ الْمُسْتَوْحِشِ الْفَرِقِ، هذا مَقامُ مَنْ لا يَجِدُ لِذَنْبِهِ غافِراً غَيْرَكَ، وَلا لِضَعْفِهِ مُقَوِّياً اِلاّا اَنْتَ، وَلا لِهَمِّهِ مُفَرِّجاً سِواكَ، يا اللهُ يا كَريمُ، لا تُحْرِقْ وَجْهي بِالنّارِ بَعْدَ سُجُودي لَكَ وَتَعْفيري بِغَيْرِ مَنٍّ مِنّي عَلَيْكَ، بَلْ لَكَ الْحَمْدُ وَالْمَنُّ وَالتَّفَضُّلُ عَليَّ ارْحَمْ اَيْ رَبِّ  اَيْ رَبِّ (حتّى ينقطع النفس) ضَعْفي وَقِلَّةَ حيلَتي وَرِقَّةَ جِلْدي وَتَبَدُّدَ اَوْصالي وَتَناثُرَ لَحْمي وَجِسْمي وَجَسَدي، وَوَحْدَتي وَوَحْشَتي في قَبْري، وَجَزَعي مِنْ صَغيرِ الْبَلاءِ، اَسْاَلُكَ يا رَبِّ قُرَّةَ الْعَيْنِ، وَالاِغْتِباطَ يَومَ الْحَسْرَةِ وَالنَّدامَةِ، بَيِّضْ وَجْهِي يا رَبِّ يَوْمَ تَسْوَدُّ الْوُجُوهُ، آمِنّي مِنَ الْفَزَعِ الاَْكْبَرِ، اَسْاَلُكَ الْبُشْرى يَوْمَ تُقَلَّبُ الْقُلُوبُ وَالاَْبْصارُ، وَالْبُشْرى عِنْدَ فِراقِ الدُّنْيا، اَلْحَمْدُ للهِ الَّذي اَرْجُوهُ عَوْناً في حَياتي، وَاُعِدُّهُ ذُخْراً لِيَوْمِ فاقَتي، اَلْحَمْدُ لله الَّذي اَدْعُوهُ وَلا اَدْعُو غَيْرَهُ وَلوْ دَعَوْتُ غَيْرَهُ لَخَيَّبَ دُعائي، اَلْحَمْدُ للهِ الَّذي اَرْجُوهُ وَلا اَرْجُو غَيْرَهُ وَلَوْ رَجَوْتُ غَيْرَهُ لاََخْلَفَ رَجائي، اَلْحَمْدُ للهِ الْمُنْعِمِ الُْمحْسِنِ الُمجْمِلِ الْمُفْضِلِ ذِي الْجَلالِ والاِكْرامِ وَلِيُّ كُلِّ نِعْمَة، وَصاحِبُ كُلِّ حَسَنَة، وَمُنْتَهى كُلِّ رَغْبَة، وَقاضي كُلِّ حاجَة، اَللّـهُمَّ صَلِّ عَلى مُحَمَّد وَآلِ مُحَمَّد وَارْزُقْني الْيَقينَ وُحسْنَ الظَّنِّ بِكَ، وَاَثْبِتْ رَجاءِكَ في قَلْبي، وَاقْطَعْ رَجائي عَمَّنْ سِواكَ، حَتّى لا اَرْجُو غَيْرَكَ وَلا اَثِقَ اِلاّ بِكَ يا لَطيفاً لِما تَشاءُ اْلُطُفْ لي في جَميعِ اَحْوالي بِما تُحِبُّ وَتَرْضى، يا رَبِّ اِنّي ضَعيفٌ عَلَى النّارِ فَلا تُعَذِّبْني بالنّارِ، يا رَبِّ ارْحَمْ دُعائي وَتَضرُّعي وَخَوْفي وَذُلّي وَمْسكَنَتي وَتَعْويذي وَتَلْويِذي، يا رَبِّ اِنّي ضَعيفٌ عَنْ طَلَبِ الدُّنْيا وَاَنْتَ واسِعٌ كَريمٌ، اَسْأَلُكُ يا رَبِّ بِقُوَّتِكَ عَلى ذلِكَ وَقُدْرَتِكَ عَلَيْهِ وَغِناكَ عَنْهُ وَحاجَتي اِلَيْهِ اَنْ تَرْزُقَني في عامي هذا وَشَهْري هذا وَيَوْمي هذا وَساعَتي هذِهِ رِزْقاً تُغْنيني بِهِ عَنْ تَكَلُّفُ ما في اَيْدي النّاسِ مِنْ رِزْقِكَ الْحَلالِ الطَّيِّبِ، اَيْ رَبِّ مِنْكَ اَطْلُبُ وَاِلَيْكَ اَرْغَبُ وِايّاكَ اَرْجُو وَاَنْتَ اَهْل ذلِكَ، لا اَرْجُو غَيْرَكَ وَلا اَثِقُ إلاّ بِكَ '
                      'يا اَرْحَمَ الرّاحِمينَ، اَيْ رَبِّ ظَلَمْتُ نَفْسي فَاْغفِرْ لي وَارْحَمْني وَعافِني، يا سامِعَ كُلِّ صَوْت، وَيا جامِعَ كُلِّ فَوْت، وَيا بارِئَ النُّفُوسِ بَعْدَ الْمَوْتِ، يا مَنْ لا تَغْشاهُ الظُّلُماتُ، وَلا تَشْتَبِهُ عَلَيْهِ الاَْصْواتُ، وَلا يَشْغَلُهُ شَيءٌ عَنْ شَيء، اَعْطِ مُحَمَّداً صَلَّى اللهُ عَلَيْهِ وآلِهِ اَفْضَلَ ما سَأَلَكَ وَاَفْضَلَ ما سُئِلْتَ لَهُ، وَاَفْضَلَ ما اَنْتَ مَسْؤُولٌ لَهُ اِلى يَوْمِ الْقِيامَةِ، وَهَبْ لِيَ الْعافِيَةَ حَتّى تُهَنِّئَني الْمَعيشَةَ، وَاخْتِمْ لي بِخَيْر حَتّى لا تَضُرَّنيِ الذُّنُوبُ، اَللّـهُمَّ رَضِّني بِما قَسَمْتَ لي حَتّى لا اَسْأَلَ اَحَداً شَيْئاً، اَللّـهُمَّ صَلّ عَلى مُحَمَّد وَآلِ مُحَمَّد وَافْتَحْ لي خَزائِنَ رَحْمَتِكَ، وَارْحَمْني رَحْمَةً لا تُعَذِّبُني بَعْدَها اَبَداً فِي الدُّنْيا وَالاخِرَةِ، وَارْزُقْني مِنْ فَضْلِكَ الْواسِعِ رِزْقاً حَلالاً طَيِّباً لا تُفْقِرُني اِلى اَحَد بَعْدَهُ سِواكَ، تَزيدُني بِذلِكَ شُكْراً وَاِلَيْكَ فاقَةً وَفَقْراً، وَبِكَ عَمَّنْ سِواكَ غِناً وَتَعفُّفاً، يا مُحْسِنُ يا مُجْمِلُ، يا مُنْعِمُ يا مُفْضِلُ، يا مَليكُ يا مُقْتَدِرُ صَلِّ عَلى مُحَمَّد وَآلِ مُحَمَّد وَاكْفِني الْمُهِمَّ كُلَّهُ، وَاقْضِ لي بِالْحُسْنى، وَبارِكْ لي في جَميعِ اُمُوري، وَاقْضِ لي جَميعَ حَوائِجي، اَللّـهُمَّ يَسِّرْ لي ما اَخافُ تَعْسيرَهُ، فَاِنَّ تَيْسيرَ ما اَخافُ تَعْسيرَهُ عَلَيْكَ سَهْلٌ يَسيرٌ، وَسَهِّلْ لي ما اَخافُ حُزونَتَهُ، وَنَفِّسْ عَنّي ما اَخافُ ضيقَهُ، وَكُفَّ عَنّي ما اَخافُ هَمَّهُ، وَاصْرِفْ عَنّي ما اَخافُ بَلِيَّتَهُ، يا اَرْحَمَ الرَّاحِمينَ، اَللّـهُمَّ امْلاَ قَلْبي حُبّاً لَكَ، وخَشْيَةً مِنْكَ، وَتَصْديقاً لَكَ، وَايماناً بِكَ، وفَرَقاً مِنْكَ، وَشَوْقاً اِلَيْكَ يا ذَا الْجَلالِ وَالاِكْرامِ، اَللّـهُمَّ اِنَّ لَكَ حُقُوقاً فَتَصَدَّقْ بِها عَلَيَّ، وَلِلنّاسِ قِبَلي تَبِعاتٌ فَتَحمَّلْها عَنّي، وَقَدْ اَوْجَبْتَ لِكُلِّ ضَيْف قِرىً، وَاَنَا ضَيْفُكَ، فَاْجعَلْ قِرايَ اللَّيْلَةَ الْجَنَّةَ، يا وَهّابَ الْجَنَّةِ يا وَهّابَ الْمَغْفِرَةِ، وَلا حَوْلَ وَلا قُوَّةَ إلاّ بِكَ.',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: 'الثاني :',
                  subtitle:
                      'تدعو بدعاء ادريس الذي رواه الشّيخ والسّيد فليطلب من كتاب المصباح أو كتاب الاقبال.',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: 'الثالث :',
                  subtitle:
                      'أن تدعو بهذا الدعاء الذي هو أخصر أدعية السحّر وهو مروي في الاقبال :\n\n'
                      'يا مَفْزَعي عِنْدَ كُرْبَتي، وَيا غَوْثي عِنْدَ شِدَّتي اِلَيْكَ فَزِعْتُ، وَبِكَ اسْتَغَثْتُ، وَبِكَ لُذْتُ لا اَلُوذُ بِسِواكَ وَلا اَطْلُبُ الْفَرَجَ إلاّ مِنْكَ، فَاَغِثْني وَفَرِّجْ عَنّي، يا مَنْ يَقْبَلُ الْيَسيرَ، وَيَعْفُو عَنِ الْكَثيرِ، اِقْبَلْ مِنِّي الْيَسيرَ وَاعْفُ عَنِّي الْكَثيرَ، اِنَّكَ اَنْتَ الْغَفُورُ الرَّحيمُ، اَللّـهُمَّ اِنّي اَسْاَلُكَ ايماناً تُباشِرُبِهِ قَلْبي، وَيَقيناً حَتّى اَعْلَمَ اَنَّهُ لَنْ يُصيَبني إلاّ ما كَتَبْتَ لي، وَرَضِّني مِنَ الْعَيْشِ بِما قَسَمْتَ لي يا اَرْحَمَ الرّاحِمينَ، يا عُدَّتي في كُرْبَتي، وَيا صاحِبي في شِدَّتي، وَيا وَليّي في نِعْمَتي، وَيا غايَتي في رَغْبَتي، اَنْتَ السّاتِرُ عَوْرَتي، وَالاْمِنُ رَوْعَتي، وَالْمُقيلُ عَثْرَتي، فَاغْفِرْ لي خَطيئَتي يا اَرْحَمَ الرّاحِمينَ.',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: 'الرابع :',
                  subtitle:
                      'وتسبّح أيضاً بهذه التّسبيحات المرويّة في الاقبال :\n\n'
                      'سُبْحـانَ مَنْ يَعْلَمُ جَوارِحَ الْقُلُوبِ، سُبْحـانَ مَنْ يُحْصي عَدَدَ الذُّنُوبِ، سُبْحـانَ مَنْ لا يَخْفى عَلَيْهِ خافِيَةٌ فِي السَّماواتِ وَالاْرَضينَ، سُبْحـانَ الرَّبِّ الْوَدُودِ، سُبْحـانَ الْفَرْدِ الْوِتْرِ، سُبْحـانَ الْعَظيمِ الاَْعْظَمِ، سُبْحـانَ مَنْ لا يَعْتَدي عَلى اَهْلِ مَمْلَكَتِهِ، سُبْحـانَ مَنْ لا يُؤاخِذُ اَهْلَ الاَْرْضِ بِاَلْوانِ الْعَذابِ، سُبْحـانَ الْحَنّانِ الْمَنّانِ، سُبْحـانَ الرَّؤُوفِ الرَّحيمِ، سُبْحـانَ الْجَبّارِ الْجَوادِ، سُبْحـانَ الْكَريمِ الْحَليمِ، سُبْحـانَ الْبَصيرِ الْعَليمِ، سُبْحـانَ الْبَصيرِ الْواسِعِ، سُبْحـانَ اللهِ عَلى اِقْبالِ النَّهارِ، سُبْحـانَ اللهِ عَلى اِدْبارِ النَّهارِ، سُبْحـانَ اللهِ عَلى اِدْبارِ اللَّيْلِ واِقْبالِ النَّهارِ، وَلَهُ الْحَمْدُ وَالَْمجْدُ وَالْعَظَمةُ وَالْكِبرِياءُ مَعَ كُلِّ نَفَس، وَكُلِّ طَرْفَةِ عَيْن، وَكُلِّ لَْمحَة سَبَقَ في عِلْمِهِ سُبْحانَكَ، مِلاَ ما اَحْصى كِتابُكَ، سُبْحانَكَ زِنَةَ عَرْشِكَ، سُبْحانَكَ سُبْحانَكَ سُبْحانَكَ.\n\n'
                      'واعلم انّ نيّة الصّوم على ما ذكره العلماء يحسن أن تكون عقيب ما تسحر، ومن الجائز أن ينوي الصّوم في أي وقت كان من اللّيل ويكفي في النيّة انّه يعلم ويقصد أن يصوم نهار الغد لله تعالى، وأن يمسك فيه عن المفطّرات وينبغي أن لا يدع صلاة اللّيل في الاسحار وأن لا يترك التهجّد فيها.',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
            ],
          ),
        ),
        bottomNavigationBar: AddCustomBottomNavigationBar(
        pushNext: Fi2a3mal2ayamShaherRamadan.screenRoute,
        pushBack: DouaaAbi7amzaAlsamali.screenRoute,
        soud: 'https://cdn.jsdelivr.net/gh/SounaDiab/image_audio@master/audio/دعاء السحر.mp3',
        onTap: (double fontSize) {
          // تحديث حجم الخط
          setState(() {
            isTablet ? _fontSizeTablet = fontSize : _fontSize = fontSize;
          });
          print('fontSize: $fontSize');
          // إغلاق Dialog
          Navigator.of(context).pop();
        },
        onLongPress: () {
          final snackBar = SnackBar(
            content: Center(
              child: Text(
                '${isTablet ? _fontSizeTablet.toInt() : _fontSize.toInt()}',
                style: TextStyle(
                  color: Colors.white,
                  fontSize: 16,
                ),
              ),
            ),
            width: 60,
            behavior: SnackBarBehavior.floating,
            backgroundColor: Colors.blue,
            duration: Duration(seconds: 2),
            shape: ShapeBorder.lerp(
              RoundedRectangleBorder(
                borderRadius: BorderRadius.circular(50),
              ),
              RoundedRectangleBorder(
                borderRadius: BorderRadius.circular(50),
              ),
              1,
            ),
          );
          ScaffoldMessenger.of(context).showSnackBar(snackBar);
        },
      ),
      ),
    );
  }
}
