import 'package:flutter/material.dart';
import 'package:maktabat_almoslim/widgets/container_scrollview.dart';
import 'package:provider/provider.dart';
import 'package:shared_preferences/shared_preferences.dart';

import '../../../../widgets/add_custom_bottom_navigation_bar.dart';
import '../../../../widgets/list_of_nine_verses.dart';
import '../../../a3mal layali kadr/sowar kor2aneya/sourat_alroum.dart';
import '../../../favorites_provider.dart';
import '../../../favorites_screen.dart';
import '../ramadan.dart';
import 'douaa_alsa7ar.dart';

class Fi2a3mal2ayamShaherRamadan extends StatefulWidget {
  static String screenRoute = 'fi_2a3mal_2ayam_shaher_ramadan_screen';
  const Fi2a3mal2ayamShaherRamadan({super.key});

  @override
  State<Fi2a3mal2ayamShaherRamadan> createState() =>
      _Fi2a3mal2ayamShaherRamadanState();
}

double _fontSize = 18;
double _fontSizeTablet = 30;

class _Fi2a3mal2ayamShaherRamadanState
    extends State<Fi2a3mal2ayamShaherRamadan> {
  bool isIcon = true;
  @override
  void initState() {
    super.initState();
    _loadFavoriteState();
  }

  Future<void> _loadFavoriteState() async {
    final prefs = await SharedPreferences.getInstance();
    bool? savedState =
        prefs.getBool('isFavorite_fi_2a3mal_2ayam_shaher_ramadan_screen');
    setState(() {
      isIcon = savedState ?? true;
    });
  }

  Future<void> _saveFavoriteState(bool value) async {
    final prefs = await SharedPreferences.getInstance();
    await prefs.setBool(
        'isFavorite_fi_2a3mal_2ayam_shaher_ramadan_screen', value);
  }

  Future<bool> _onWillPop() async {
    final args =
        ModalRoute.of(context)!.settings.arguments as Map<String, dynamic>?;
    final previousPage = args?['previousPage'];
    if (previousPage == 'favorite_screen') {
      Navigator.of(context).pushReplacementNamed(FavoritesScreen.screenRoute);
      return false;
    } else {
      Navigator.of(context).pushReplacementNamed(Ramadan.screenRoute);
      return false;
    }
  }

  @override
  Widget build(BuildContext context) {
    double size = MediaQuery.of(context).textScaleFactor;
    final screenWidth = MediaQuery.of(context).size.width;
    final isTablet = screenWidth >= 600;
    return WillPopScope(
      onWillPop: _onWillPop,
      child: Scaffold(
        appBar: AppBar(
          toolbarHeight: isTablet ? 100 : 50,
          centerTitle: true,
          leading: IconButton(
            onPressed: _onWillPop,
            icon: Icon(
              Icons.arrow_back,
              size: isTablet ? 50 : 25,
            ),
          ),
          actions: [
            IconButton(
              padding: EdgeInsets.only(left: isTablet ? 50 : 30),
              icon: Icon(
                isIcon ? Icons.favorite_border : Icons.favorite_rounded,
                size: isTablet ? 40 : 25,
                color: isIcon ? Colors.black : Colors.red,
              ),
              onPressed: () async {
                setState(() {
                  isIcon = !isIcon;
                });
                await _saveFavoriteState(isIcon);

                if (!isIcon) {
                  Provider.of<FavoritesProvider>(context, listen: false)
                      .addFavorite('في أعمال أيام شهر رمضان',
                          Fi2a3mal2ayamShaherRamadan.screenRoute);
                } else {
                  Provider.of<FavoritesProvider>(context, listen: false)
                      .removeFavorite(
                          'في أعمال أيام شهر رمضان',
                          Fi2a3mal2ayamShaherRamadan.screenRoute,
                          Fi2a3mal2ayamShaherRamadan.screenRoute);
                }
              },
            ),
          ],
          title: Text(
            'في أعمال أيام شهر رمضان',
            style: TextStyle(
              fontSize: isTablet
                  ? 40
                  : size > 1.0
                      ? 20
                      : 23,
              fontWeight: FontWeight.bold,
            ),
          ),
        ),
        body: ContainerScrollview(
          widget: Column(
            crossAxisAlignment: CrossAxisAlignment.start,
            children: [
              Container(
                child: Column(
                  children: [
                    Center(
                      child: Text(
                        'بسم الله الرحمن الرحيم',
                        style: TextStyle(
                          fontSize: isTablet ? _fontSizeTablet : _fontSize,
                          fontWeight: FontWeight.w900,
                        ),
                      ),
                    ),
                    Center(
                      child: Text(
                        'اللهم صلِّ على محمد وآل محمد',
                        style: TextStyle(
                          fontSize: isTablet ? _fontSizeTablet : _fontSize,
                          fontWeight: FontWeight.w900,
                        ),
                      ),
                    ),
                  ],
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title:
                      'وهي اُمور : أوّلها : أن يدعو كلّ يوم بهذا الدّعاء الذي رواه الشّيخ ، كما رواه السّيد :',
                  subtitle:
                      'اَللّـهُمَّ هذا شَهْرُ رَمَضانَ الَّذي اَنْزَلْتَ فيهِ الْقُرآنَ هُدىً لِلنَّاسِ وَبَيِّنات مِنَ الْهُدى وَالْفْرقانِ، وهذا شَهْرُ الصِّيامِ، وَهذا شَهْرُ الْقِيامِ، وَهذا شَهْرُ الاِنابَةِ، وَهذا شَهْرُ التَّوْبَةِ، وَهذا شَهْرُ الْمَغْفِرَةِ وَالرَّحْمَةِ، وَهذا شَهْرُ الْعِتْقِ مِنَ النّارِ وَالْفَوْزِ بِالْجَنَّةِ، وَهذا شَهْرٌ فيهِ لَيْلَةُ الْقَدْرِ الَّتي هِيَ خَيْرٌ مِنْ اَلْفِ شَهْر، اَللّـهُمَّ فَصَلِّ عَلى مُحَمَّد وآلِ مُحَمَّد، وَاَعِّني عَلى صِيامِهِ وَقِيامِهِ، وَسلِّمْهُ لي وَسَلِّمْني فيهِ، وَاَعِنّي عَلَيْهِ بِاَفْضَلِ عَوْنِكَ، وَوَفِّقْني فيهِ لِطاعَتِكَ وَطاعَةِ رَسُولِكَ واَوْليائِكَ صَلَّى اللهُ عَلَيْهِمْ، وَفَرِّغْني فيهِ لِعِبادَتِكَ وَدُعائِكَ وَتِلاوَةِ كِتابِكَ، وَاَعْظِمْ لي فيهِ الْبَرَكَةَ، وَاَحْسِنْ لي فيهِ الْعافِيَةَ، وَاَصِحَّ فيهِ بَدَني، وَاَوْسِعْ لي فيهِ رِزْقي، وَاكْفِني فيهِ ما أهَمَّني وَاسْتَجِبْ فيهِ دُعائي، وَبَلِّغْني رَجائي، اَللّـهُمَّ صَلّ عَلى مُحَمَّد وَآلِ مُحَمَّد، واَذْهِبْ عَنّي فيهِ النُّعاسَ وَالْكَسَلَ وَالسَّامَةَ وَالْفَتْرَةَ وَالْقَسْوَةَ وَالْغَفْلَةَ وَالْغِرَّةَ، وَجَنِّبْني فيهِ الْعِلَلَ وَالاَسْقامَ وَالْهُمُومَ وَالاَحْزانَ وَالاَعْراضَ وَالاَمْراضَ وَالْخَطايا وَالذُّنُوبَ، وَاصْرِفْ عَنّي فيهِ السُّوءَ وَالْفَحشاءَ وَالْجَهْدَ وَالْبَلاء وَالتَّعَبَ وَالْعِناءَ اِنَّكَ سَميعُ الدُّعاءِ، اَللّـهُمَّ صَلِّ عَلى مُحَمَّد وَآلِ مُحَمَّد، وَاَعِذْني فيهِ مِنَ الشَّيْطانِ الرَّجيمِ وَهَمْزِهِ وَلَمْزِهِ وَنُفْثِهِ وَنُفْخِهِ وَوَسْوَسَتِهِ وَتَثْبيطِهِ وَبَطْشِه وَكَيْدِهِ وَمَكْرِهِ وَحبائِلِهِ وَخُدَعِهِ وَاَمانِيِّهِ وَغُرُورِهِ وَفِتْنَتِهِ وَشَرَكِهِ وَاَحْزَابِهِ وَاَتْباعِهِ واَشْياعِهِ وَاَوْلِيائِهِ وَشُرَكائِهِ وَجَميعِ مَكائِدِهِ، اَللّـهُمَّ صَلِّ عَلى مُحَمَّد وَآلِ مُحَمَّد، وَارْزُقْنا قِيامَهُ وَصِيامَهُ وَبُلُوغَ الاَمَلِ فيهِ وَفي قِيامِهِ، وَاسْتِكْمالَ ما يُرْضيكَ عَنّي صَبْراً وَاْحتِساباً وَايماناً وَيَقيناً، ثُمَّ تَقَبَّلْ ذلِكَ مِنّي بِالاَضْعافِ الْكَثيرَةِ، والاَجْرِ الْعَظيمِ يا رَبَّ الْعالَمينَ، اَللّـهُمَّ صَلِّ عَلى مُحَمَّد وَآلِ مُحَمَّد وَارْزُقْني الْحَجَّ وَالْعُمْرَةَ والجدّ وَالاجْتِهادَ وَالْقُوَّةَ والنَّشاطَ والاِنابَةَ والتَّوْبَةَ ولِلتوفيْق والْقُرْبَةَ والْخَيْرَ الْمَقْبُولَ وَالرَّغْبَةَ والرَّهْبَةَ وَالتَّضَرُّعَ والْخُشُوعَ وَالرِّقَّةَ، والنِّيَّةَ الصّادِقَهَ، وَصِدْقَ اللِّسانِ، وَالْوَجَلَ مِنْكَ، وَالرَّجاءَ لَكَ، وَالتَّوَكُّلَ عَلَيْكَ، وَالثِّقَةَ بِكَ، وَالْوَرَعَ عَنْ مَحارِمِكَ، مَعَ صالِحِ الْقَوْلِ، وَمَقْبُولِ السَّعْي، وَمَرْفُوعِ الْعَمَلِ، وَمُسْتَجابِ الدَّعْوَةِ، وَلا تَحُلْ بَيْني وَبَيْنَ شيء مِنْ ذلِكَ بَعَرَض وَلا مَرَض وَلا هَمٍّ وَلا غَمٍّ وَلا سُقْم وَلا غَفْلَة وَلانِسْيان، بَلْ بِالتَّعاهُدِ والتَّحَفُّظِ لَكَ وَفيكَ، وَالرِّعايَةِ لِحَقِّكَ، وَالْوَفاءِ بَعَهْدِكَ وَوَعْدِكَ بِرَحْمَتِكَ يا اَرْحَمَ الرّاحِمينَ، اَللّـهُمَّ صَلّ عَلى مُحَمَّد وَآلِ مُحَمَّد وَاقْسِمْ لي فيهِ اَفْضَلَ ما تَقْسِمُهُ لِعبادِكَ الصّالِحينَ، وَاَعْطِني فيهِ اَفْضَلَ ما تُعْطي اَوْلِياءَكَ الْمُقَرَّبينَ، مِنَ الرَّحْمَةِ وَالْمَغْفِرَةِ والتَّحَنُّنِ وَالاِجابَةِ وَالْعَفْوِ وَالْمَغْفِرَةِ الدّائِمَةِ، وَالْعافِيَةِ وَالْمُعافاةِ، وَالْعِتْقِ مِنَ النّارِ، وَالْفَوْزِ بِالْجَنَّةِ، وَخَيْرِ الدُّنْيا وَالاْخِرَةِ، اَللّـهُمَّ صَلّ عَلى مُحَمَّد وَآلِ مُحَمَّد، وَاجْعَلْ دُعائي فيهِ اِلَيْكَ واصِلاً، وَرَحْمَتَكَ وَخَيْرَكَ اِلَىَّ فيه نازِلاً، وَعَمَلي فيهِ مَقْبُولاً، وَسَعْيي فيهِ مَشْكُوراً، وَذَنْبي فيهِ مَغْفُوراً، حَتّى يَكُونَ نَصيبي فيهِ الاَكْثَرَ، وَحَظّي فيهِ الاَوْفَرَ، اَللّـهُمَّ صَلّ عَلى مُحَمَّد وَآلِ مُحَمَّد، وَوَفِّقْني فيهِ لِلَيْلَةِ الْقَدْرِ عَلى اَفْضَلِ حال تُحِبُّ اَنْ يَكُونَ عَلَيْها اَحَدٌ مِنْ اَوْلِيائِكَ، وَاَرْضاها لَكَ، ثُمَّ اجْعَلْها لي خَيْراً مِنْ اَلْفِ شَهْر، وَارْزُقْني فيها اَفْضَلَ ما رَزَقْتَ اَحَداً مِمَّنْ بَلَّغْتَهُ اِيّاها وَاَكْرَمْتَهُ بِها، وَاْجعَلْني فيها مِنْ عُتَقائِكَ مِنْ جَهَنَّمَ، وطُلَقائِكَ مِنَ النّارِ، وَسُعَداءِ خَلْقِكَ بِمَغْفِرَتِكَ وَرِضْوانِكَ يا اَرْحَمَ الرّاحِمينَ، اَللّـهُمَّ صَلّ عَلى مُحَمَّد وَآلِ مُحَمَّد، وَارْزُقْنا في شَهْرِنا هذَا الْجِدَّ وَالاجْتِهادَ، '
                      'والقُوَّةَ وَالنَّشاطَ، وَما تُحِبُّ وَتَرْضى، اَللّـهُمَّ رَبَّ الْفَجْرِ وَلَيال عَشْر، وَالشَّفْعِ وَالْوَتْرِ، وَربَّ شَهْرِ رَمَضانَ، وَما اَنْزَلْتَ فيهِ مِنَ الْقُرآنِ، وَرَبَّ جَبْرَئيلَ وَميكائيلَ واِسْرافيلَ وَعِزْرائيلَ وَجَميعِ الْمَلائِكَةِ الْمُقَرَّبينَ، وَربَّ اِبْراهيمَ وَاِسْماعيلَ وَاِسْحـاقَ وَيَعْقُوبَ، وَربَّ مُوسى وَعيسى وَجميعِ النَّبِيّينَ وَالْمُرْسَلينَ، وَربَّ مُحَمَّد خاتَمِ النَّبِيِّينَ صَلَواتُكَ عَلَيْهِ وَعَلَيْهِمْ اَجْمَعينَ، وَاَسْاَلُكَ بِحَقِّكَ عَلَيْهِمْ وَبِحَقِّهِمْ عَلَيْكَ، وَبِحَقِّكَ الْعَظيمِ لَمّا صَلَّيْتَ عَلَيْهِ وَآلِهِ وَعَلَيْهِمْ اَجْمَعينَ، وَنَظَرْتَ اِلَيَّ نَظْرَةً رَحيمَةً تَرْضى بِها عَنّي رِضىً لا سَخَطَ عَلَيَّ بَعْدَهُ اَبَداً، وَاَعْطَيْتَني جَميعَ سُؤْلي وَرَغْبَتي وَاُمْنِيَّتي وَاِرادَتي، وَصَرَفْتَ عَنّي ما اَكْرَهُ وَاَحْذَرُ وَاَخافُ عَلى نَفْسي وَما لا اَخافُ، وَعَنْ اَهْلي وَمالي وَاِخْواني وَذُرِّيَّتي، اَللّـهُمَّ اِلَيْكَ فَرَرْنا مِنْ ذُنُوبِنا فَـاوِنا تائِبينَ وَتُبْ عَلَيْنا مُسْتَغْفِرينَ، وَاغْفِرْ لَنا مُتَعوِّذينَ، وَاَعِذْنا مُسْتَجيرينَ، وَاَجِرْنا مُسْتَسْلِمينَ، وَلا تَخْذُلْنا راهِبينَ، وآمِنّا راغِبينَ، وَشَفِّعْنا سائِلينَ، وَاَعْطِنا اِنَّكَ سَميعُ الدُّعاءِ قَريبٌ مُجيبٌ، اَللّـهُمَّ اَنْتَ رَبِّي وَاَنَا عَبْدُكَ وَاَحَقُّ منْ سَأَلَ الْعَبْدُ رَبَّهُ وَلَمْ يَسْأَلِ الْعْبادُ مِثْلَكَ كَرَماً وَجُوداً، يا مَوْضِعَ شَكْويَ السّائِلينَ، وَيا مُنْتَهى حاجَةِ الرّاغِبينَ، وَيا غِياثَ الْمُسْتَغيثينَ، وَيا مُجيبَ دَعْوَةِ الْمُضْطَرِّينَ، وَيا مَلْجَاَ الْهارِبينَ، وَيا صَريخَ الْمُسْتَصْرِخينَ، وَيا رَبَّ الْمُسْتَضْعَفينَ، وَيا كاشِفَ كَرْبِ الْمَكْرُوبينَ، وَيا فارِجَ هَمِّ الْمَهْمُومينَ، وَيا كاشِفَ الْكَرْبِ الْعَظيمِ يا اَللهُ يا رَحْمنُ يا رَحيمُ يا اَرْحَمَ الرّاحِمينَ (وَيا اَللهُ المَكْنُون مِنْ كُلِّ عَيْنِ، الْمُرْتَدي بِالْكِبْرِياءِ) صَلّ عَلى مُحَمَّد وَآلِ مُحَمَّد، وَاغْفِرْ لي ذُنُوبي وَعُيُوبي وَاِساءَتي وَظُلْمي وَجُرْمي وَاِسْرافي عَلى نَفْسي، وَارْزُقْني مِنْ فَضْلِكَ وَرَحْمَتِكَ فَاِنَّهُ لا يَمْلِكُها غَيْرُكَ، وَاعْفُ عَنّي وَاغْفِرْ لي كُلَّ ما سَلَفَ مِنْ ذُنُوبي، وَاعْصِمْني فيـما بَقِيَ مِنْ عُمْري، وَاسْتُرْ عَلَيَّ وَعَلى والِديَّ وَوَلَدي وَقرابَتي وَاَهْلِ حُزانَتي وَمَنْ كانَ مِنّي بِسَبيْل مِنَ الْمُؤْمِنينَ وَالْمُؤْمِناتِ في الدُّنْيا وَالاْخِرَةِ فَاِنَّ ذلِكَ كُلَّهُ بِيَدِكَ وَاَنْتَ واسِعُ الْمَغْفِرَةِ، فَلا تُخَيِّبْني يا سَيِّدي، وَلا تَرُدَّ دُعائي وَلا يَدي اِلى نَحْري حَتّى تَفْعَلَ ذلِكَ بي، وَتَسْتَجيبَ لي جَميعَ ما سَأَلْتُكَ، وَتَزيدَني مِنْ فَضْلِكَ فَاِنَّكَ عَلى كُلِّ شَيء قَديرٌ، وَنَحْنُ اِلَيْكَ راغِبُونَ، اَللّـهُمَّ لَكَ الاَسْماءُ الْحُسْنى، وَالاَمْثالُ الْعُلْيا، وَالْكِبْرِياءُ وَالالاءُ، اَسْاَلُكَ بِاسْمِكَ بِسْمِ الله الرَّحْمـنِ الرَّحيمِ اِنْ كُنْتَ قَضَيْتَ في هذِهِ اللَّيْلَةِ تَنَزُّلَ الْمَلائِكَةِ وَالرُّوحِ فيها اَنْ تُصَلِّيَ عَلى مُحَمَّد وَآلِ مُحَمَّد، وَاَنْ تَجْعَلَ اسْمي فِي السُّعَداءِ، وَرُوحي مَعَ الشُّهَداءِ، وَاِحْساني في عِلِّيّينَ، وَاِساءَتي مَغْفُورَةً وَاَنْ تَهَبَ لي يَقيناً تُباشِرُ بِهِ قَلْبي، وَايماناً لا يَشُوبُهُ شَكٌّ، وَرِضىً بِما قَسَمْتَ لي، وَآتِني في الدُّنْيا حَسَنَةً وَفِي الأخرة حَسَنَةً وَقِنى عَذابَ النّارِ، وَاِنْ لَمْ تَكُنْ قَضَيْتَ في هذِهِ اللَّيْلَةِ تَنَزُّلَ الْمَلـائِكَةِ وَالرُّوحِ فيها فَاَخِّرْني اِلى ذلِكَ، وَارْزُقْني فيها ذِكْرَكَ وَشُكْرَكَ وَطاعَتَكَ وَحُسْنَ عِبادَتِكَ وصَلِّ عَلى مُحَمَّد وَآلِ مُحَمَّدبِاَفْضَلِ صَلَواتِكَ يا اَرْحَمَ الرّاحِمينَ يا اَحَدٌ يا صَمَدٌ، يا رَبَّ مُحَمَّد، اغْضَبِ الْيَوْمَ لُِمحَمَّد وَلاَِبْرارِ عِتْرَتِهِ واقْتُلْ اَعْداءَهُمْ بَدَداً، وَاَحْصِهِمْ عَدَداً، وَلا تَدَعْ عَلى ظَهْرِ الاَرْضِ مِنْهُمْ اَحَداً، وَلا تَغْفِرْ لَهُمْ اَبَداً، يا حَسَنَ الصُّحْبَةِ يا خَليفَةَ النَّبِيّينَ اَنْتَ اَرْحَمُ الرّاحِمينَ الْبَديءُ الْبَديعُ الَّذي لَيْسَ كَمِثْلِكَ شَيءٌ، وَالدّائِمُ غَيْرُ الْغافِلِ، وَالْحَيُّ الَّذي لا يَمُوتُ، اَنْتَ كُلَّ يَوْم في شَأن، اَنْتَ خَليفَةَ، مُحَمَّد، وَناصِرُ مُحَمَّد، وَمُفَضِّلُ مُحَمَّد، اَسْاَلُكَ اَنْ تَنْصُرَ وَصِيَّ مُحَمَّد، وَخَليفَةَ مُحَمَّد، وَالْقائِمَ بِالْقِسْطِ مِنْ أَوْصِياءِمُحَمَّد صَلَواتُكَ عَلَيْهِ وَعَلَيْهِمْ، اِعْطِفْ عَلَيْهِمْ نَصْرَكَ يا لا اِلـهَ إلاّ اَنْتَ، بِحَقِّ لا اِلـهَ إلاّ اَنْتَ، صَلِّ عَلى مُحَمَّد وَآلِ '
                      'مُحَمد، وَاجْعَلْني مَعَهُمْ في الدُّنْيا وَالاخِرَةِ، وَاجْعَلْ عاقِبَةَ اَمْري اِلى غُفْرانِكَ وَرَحْمَتِكَ يا اَرْحَمَ الرّاحِمينَ، وَكَذلِكَ نَسَبْتَ نَفْسَكَ يا سَيِّدي بِاللَّطيفِ، بَلى اِنَّكَ لَطيفٌ، فَصَلِّ عَلى مُحَمَّد وَآلِ مُحَمَّد وَالْطُفْ بي لِما تَشاءُ، اَللّـهُمَّ صَلِّ عَلى مُحَمَّد وَآلِ مُحَمَّد، وَارْزُقْنِى الْحَجَّ وَالْعُمْرَةَ في عامِنا هذا، وَتَطَوَّلْ عَلَيَّ بِجَميعِ حَوائِجي لِلاْخِرَةِ وَالدُّنْيا (ثُمَّ تَقُول ثلاثاً) اَسْتَغْفِرُ اللهَ رَبِّي وَاَتُوبُ اِلَيْهِ اِنَّ رَبِّي قَريبٌ مُجيبٌ، اَسْتَغْفِرُ اللهَ رَبِّي وَاَتُوبُ اِلَيْهِ اِنَّ رَبّي رَحيمٌ وَدُودٌ، اَسْتَغْفِرُ اللهَ رَبِّي وَاَتُوبُ اِلَيْهِ اِنَّهُ كانَ غَفّاراً اَللّـهُمَّ اغْفِرْ لي اِنَّكَ اَرْحَمُ الرّاحِمينَ، رَبِّ اِنّي عَمِلْتُ سُوءاً وَظَلَمْتُ نَفْسي فَاغْفِرْ لي اِنَّهُ لا يَغْفِرُ الذُّنُوبَ إلاّ اَنْتَ، اَسْتَغْفِرُ اللهَ الَّذي لا اِلـهَ إلاّ هُوَ الْحَيُّ، الْقَيُّومُ الْحَليمُ الْعَظيمُ الْكَريمُ، الْغَفّارُ لِلذَّنْبِ الْعَظيمِ وَاَتُوبُ اِلَيْهِ، اَسْتَغْفِرُ اللهَ اِنَّ اللهَ كانَ غَفُوراً رَحيماً \n\n'
                      'ثُم تقولُ : اَللّـهُمَّ إنّي اَسْألُكَ اَنْ تُصَلِّيَ عَلى مُحَمَّد وَآلِ مُحَمَّد، وَاَنْ تَجْعَلَ فيـما تَقْضي وَتُقَدِّرُ مِنَ الاَمْرِ الْعَظيمِ الَْمحْتُومِ في لَيْلَةِ الْقَدْرِ مِنَ الْقَضاءِ الَّذي لا يُرَدُّ وَلا يُبَدَّلُ، اَنْ تَكْتُبَني مِنْ حُجّاجِ بَيْتِكَ الْحَرامِ، الْمَبْرُورِ حَجُّهُمْ، الْمَشْكُورِ سَعْيُهُمْ، الْمَغْفُورِ ذُنُوبُهُمْ، الْمُكَفَّرِ عَنْهُمْ سَيِّئاتُهُمْ، وَاَنْ تَجْعَلَ فيـما تَقْضي وَتُقَدِّرُ اَنْ، تُطيلَ عُمْري وَتُوَسِّعَ رِزْقي، وَتُؤَدِّي عَنّي اَمانَتي وَدَيْني، آمينَ رَبَّ الْعالَمينَ، اَللّـهُمَّ اجْعَلْ لي مِنْ اَمْري فَرَجاً وَمَخْرَجاً، وَارْزُقْني مِنْ حَيْثُ اَحْتَسِبُ وَمِنْ حَيْثُ لا اَحْتَسِبُ، وَاحْرُسْني مِنْ حَيْثُ اَحْتَرِسُ، وَمِنْ حَيْثُ لا اَحْتَرِسُ وَصَلِّ عَلى مُحَمَّد وَآلِ مُحَمَّد وَسَلِّمْ كَثيراً .',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: 'الثّاني :',
                  subtitle:
                      'وقال أيضاً تسبّح كلّ يوم من شهر رمضان الى آخره بهذه التّسبيحات وهي عشرة أجزاء كلّ جزء يحتوي على عشرة تسبيحات :\n\n'
                      '(1) سُبْحـانَ اللهِ بارِئِ النَّسَمِ، سُبْحـانَ اللهِ المُصَوِّرِ، سُبْحـانَ اللهِ خالِقِ الاَزْواجِ كُلِّها، سُبْحـانَ اللهِ جاعِلِ الظُّلُماتِ وَالنُّورِ، سُبْحـانَ اللهِ فالِقِ الْحَبِّ وَالنَّوى، سُبْحـانَ اللهِ خالِقِ كُلِّ شَيء، سُبْحـانَ اللهِ خالِقِ ما يُرى، وَما لا يُرى سُبْحـانَ اللهِ مِدادَ كَلِماتِهِ، سُبْحـانَ اللهِ رَبِّ الْعالَمينَ، سُبْحـانَ اللهِ السَّميعِ الَّذي لَيْسَ شَيءٌ اَسْمَعَ مِنْهُ، يَسْمَعُ مِنْ فَوْقِ عَرْشِهِ ما تَحْتَ سَبْعِ اَرَضينَ، وَيَسْمَعُ ما في ظُلُماتِ الْبَرِّ وَالْبَحْرِ، وَيَسْمَعُ الاَنينَ وَالشَّكْوى وَيَسْمَعُ السِّرَّ وَاَخْفى، وَيَسْمَعُ وَساوِسَ الصُّدُورِ (وَيَعْلَمُ خائِنَةَ الاَعْيُنِ وَما تُخْفِي الصُّدُورِ) وَلا يُصِمُّ سَمْعَهُ صَوْتٌ (2) سُبْحـانَ اللهِ بارِئِ النَّسَمِ، سُبْحـانَ اللهِ الُمصَوِّرِ، سُبْحـانَ اللهِ خالِقِ الاَزْواجِ كُلِّها، سُبْحـانَ اللهِ جاعِلِ الظُّلُماتِ وَالنُّورِ، سُبْحـانَ اللهِ فالِقِ الْحَبِّ وَالنَّوى، سُبْحـانَ اللهِ خالِقِ كُلِّ شَيء، سُبْحـانَ اللهِ خالِقِ ما يُرى وَما لا يُرى، سُبْحـانَ اللهِ مِدادَ كَلِماتِهِ، سُبْحـانَ اللهِ رَبِّ الْعالَمينَ، سُبْحـانَ اللهِ الْبَصيرِ الَّذي لَيْسَ شَيءٌ اَبْصَرَ مِنْهُ، يُبْصِرُ مِنْ فَوْقِ عَرْشِهِ ما تَحْتَ سَبْعِ اَرَضينَ، وَيُبْصِرُ ما في ظُلُماتِ الْبَرِّ وَالْبَحْر، لا تُدْرِكُهُ الابْصارُ وَهُوَ يُدْرِكُ الاَبْصارَ وَهُوَ اللَّطيفُ الْخَبيرُ، لا تَغْشَى بَصَرَهُ الظُّلْمَةُ، وَلا يُسْتَتَرُ مِنْهِ بِسِتْر، وَلا يُواري مِنْهُ جِدارٌ، وَلا يَغيبُ عَنْهُ بَرٌّ وَلا بَحْرٌ، وَلا يَكُنُّ مِنْهُ جَبَلٌ ما في اَصْلِهِ، وَلا قَلْبٌ ما فيهِ، وَلا جَنْبٌ ما في قَلْبِهِ، وَلا يَسْتَتِرُ مِنْهُ صَغيرٌ وَلا كَبيرٌ، وَلا يَسْتَخْفي مِنْهُ صَغيرٌ لِصِغَرِهِ، وَلا يَخْفى عَلَيْهِ شَيءٌ فِي الاَرْضِ وَلا فِي السَّماءِ، هُوَ الَّذي يُصَوِّرُكُمْ فِي الاَرْحامِ كَيْفَ يَشاءُ، لا اِلـهَ إلاّ هُوَ الْعَزيزُ الْحَكيمُ (3) سُبْحـانَ اللهِ بارِئِ النَّسَمِ، سُبْحـانَ اللهِ الُمصَوِّرِ، سُبْحـانَ اللهِ خالِقِ الاَزْواجِ كُلِّها، سُبْحـانَ اللهِ جاعِلِ الظُّلُماتِ وَالنُّورِ، سُبْحـانَ اللهِ فالِقِ الْحَبِّ وَالنَّوى، سُبْحـانَ اللهِ خالِقِ كُلِّ شَيء، سُبْحـانَ اللهِ خالِقِ ما يُرى، وَما لا يُرى سُبْحـانَ اللهِ مِدادَ كَلِماتِهِ، سُبْحـانَ اللهِ رَبِّ الْعالَمينَ، سُبْحـانَ اللهِ الَّذي يُنْشِئُ السَّحابَ الثِّقالَ، وَيُسَبِّحُ الرَّعْدُ بِحَمْدِهِ، وَالْمَلائِكَةُ مِنْ خِيفَتِهِ، وَيُرْسِلُ الصَّواعِقَ فَيُصيبُ بِها مَنْ يَشاءُ، وَيُرْسِلُ الرِّياحَ بُشْراً بَيْنَ يَدَي رَحْمَتِهِ، وَيُنَزِّلُ الْماءَ مِنَ السَّماءِ بِكَلِمَتِهِ وَيُنْبِتُ النَّباتَ بِقُدْرَتِهِ، وَيَسْقُطُ الْوَرَقُ بِعِلْمِهِ، سُبْحـانَ اللهِ الَّذي لا يَعْزُبُ عَنْهُ مِثْقالُ ذَرَّة فِي الاَرْضِ وَلا فِي السَّماءِ، وَلا اَصْغَرُ مِنْ ذلِكَ وَلا اَكْبَرُ إلاّ في كِتاب مُبين (4) سُبْحـانَ اللهِ بارِئِ النَّسَمِ، سُبْحـانَ اللهِ الُمصَوِّرِ، سُبْحـانَ اللهِ خالِقِ الاَزْواجِ كُلِّها، سُبْحـانَ اللهِ جاعِلِ الظُّلُماتِ وَالنُّورِ، سُبْحـانَ اللهِ فالِقِ الْحَبِّ وَالنَّوى، سُبْحـانَ اللهِ خالِقِ كُلِّ شَيء، سُبْحـانَ اللهِ خالِقِ ما يُرى، وَما لا يُرى سُبْحـانَ اللهِ مِدادَ كَلِماتِهِ، سُبْحـانَ اللهِ رَبِّ الْعالَمينَ، سُبْحـانَ اللهِ الَّذي يَعْلَمُ ما تَحْمِلُ كُلُّ اُنْثى وَما تَغيْضُ الاَرْحامُ وَما تَزْدادُ وَكُلُّ شَيْء عِنْدَهُ بِمِقْدار، عالِمُ الْغَيْبِ وَالشَّهادَةِ الْكَبيْرُ الْمُتَعالِ، سَواءٌ مِنْكُمْ مَنْ اَسَرَّ الْقَوْلَ وَمَنْ جَهَرَ بِهِ، وَمَنْ هُوَ مُسْتَخْف بِاللَّيْلِ وَسارِبٌ بِالنَّهارِ، لَهُ مُعَقِّباتٌ مِنْ بَيْنِ يَدَيْهِ وَمِنْ خَلْفِهِ يَحْفَظُونَهُ مِنَ اَمْرِ اللهِ، سُبْحانَ اللهِ الَّذي يُميتُ الاَحْياءَ، وَيُحْيِى الْمَوْتى، وَيَعْلَمُ ما تَنْقُصُ الاَرْضُ مِنْهُمْ، وَيُقِرُّ فِي الاَرْحامِ ما يَشاءُ اِلى اَجَل مُسَمّىً (5) سُبْحـانَ اللهِ بارِئِ النَّسَمِ، سُبْحـانَ اللهِ الُمصَوِّرِ، سُبْحـانَ اللهِ خالِقِ الاَزْواجِ كُلِّها، سُبْحـانَ اللهِ جاعِلِ الظُّلُماتِ وَالنُّورِ، سُبْحـانَ اللهِ فالِقِ الْحَبِّ وَالنَّوى، سُبْحـانَ اللهِ خالِقِ كُلِّ شَيء، سُبْحـانَ اللهِ خالِقِ ما يُرى وَما لا يُرى، سُبْحـانَ اللهِ مِدادَ كَلِماتِهِ، سُبْحـانَ اللهِ رَبِّ الْعالَمينَ، سُبْحـانَ اللهِ مالِكِ الْمُلْكِ تُؤْتِى الْمُلْكَ مَنْ تَشاءُ، وَتَنْزِعُ الْمُلْكَ مِمَّنْ تَشاءُ، وَتُعِزُّ مَنْ تَشاءُ، وَتُذِلُّ مَنْ تَشاءُ، بِيَدِكَ الْخَيْرُ اِنَّكَ عَلى كُلِّ شَيء قَديرٌ، تُولِجُ اللَّيْلَ فِي النَّهارِ، وَتُولِجُ النَّهارَ فِي اللَّيْلِ، تُخْرِجُ الْحَىَّ مِنَ الْمَيِّتِ، وَتُخْرِجُ الْمَيِّتَ مِنَ الْحَيِّ، وَتَرْزُقُ مَنْ تَشاءُ بِغَيْرِ حِسابِ (6) سُبْحـانَ اللهِ بارِئِ النَّسَمِ، سُبْحـانَ اللهِ الُمصَوِّرِ، سُبْحـانَ اللهِ خالِقِ الاَزْواجِ كُلِّها، سُبْحـانَ اللهِ جاعِلِ الظُّلُماتِ وَالنُّورِ، سُبْحـانَ اللهِ فالِقِ الْحَبِّ وَالنَّوى، سُبْحـانَ اللهِ خالِقِ كُلِّ شَيء، سُبْحـانَ اللهِ خالِقِ ما يُرى وَما لا يُرى، سُبْحـانَ اللهِ مِدادَ كَلِماتِهِ، سُبْحـانَ اللهِ رَبِّ الْعالَمينَ، سُبْحـانَ اللهِ الَّذي عِنْدَهُ مُفاتِحُ الْغَيْبِ لا يَعْلَمُها إلاّ هُوَ وَيَعْلَمُ ما فِي الْبَرِّ وَالْبَحْرِ، وَما تَسْقُطُ مِنْ وَرَقَة إلاَّ يَعْلَمُها، وَلا حَبَّة في ظُلُماتِ الاَرْضِ وَلا رَطْب وَلا يابِس إلاّ في كِتاب مُبين (7) سُبْحـانَ اللهِ بارِئِ النَّسَمِ، سُبْحـانَ اللهِ الُمصَوِّرِ، سُبْحـانَ اللهِ خالِقِ الاَزْواجِ كُلِّها، سُبْحـانَ اللهِ جاعِلِ الظُّلُماتِ وَالنُّورِ، سُبْحـانَ اللهِ فالِقِ الْحَبِّ وَالنَّوى، سُبْحـانَ اللهِ خالِقِ كُلِّ شَيء، سُبْحـانَ اللهِ خالِقِ ما يُرى وَما لا يُرى، سُبْحـانَ اللهِ مِدادَ كَلِماتِهِ، سُبْحـانَ اللهِ رَبِّ الْعالَمينَ، سُبْحـانَ اللهِ الَّذي لا يُحْصي مِدْحَتَهُ الْقائِلُونَ، وَلا يَجْزي بِـآلائِهِ الشّاكِرُونَ الْعابِدُونَ، وَهُوَ كَما قالَ وَفَوْقَ ما نَقُولُ، وَاللهُ سُبْحانَهُ كَما اَثْنى عَلى نَفْسِهِ وَلا يُحيطونَ بِشَئ مِنْ عِلْمِهِ اِلاّا بِما شاءَوَسِعَ كُرْسِيُّهُ السَّماواتِ وَالاَرْضَ وَلا يَؤُدُهُ حِفْظُهُما وَهُوَ الْعَلِيُّ الْعَظيمُ (8) سُبْحـانَ اللهِ بارِئِ النَّسَمِ، سُبْحـانَ اللهِ الُمصَوِّرِ، سُبْحـانَ اللهِ خالِقِ الاَزْواجِ كُلِّها، سُبْحـانَ اللهِ جاعِلِ الظُّلُماتِ وَالنُّورِ، سُبْحـانَ اللهِ فالِقِ الْحَبِّ وَالنَّوى، سُبْحـانَ اللهِ خالِقِ كُلِّ شَيء، سُبْحـانَ اللهِ خالِقِ ما يُرى وَما لا يُرى، سُبْحـانَ اللهِ مِدادَ كَلِماتِهِ، سُبْحـانَ اللهِ رَبِّ الْعالَمينَ، سُبْحـانَ اللهِ الَّذي يَعْلَمُ ما يَلِجُ فِى الاَرْضِ وَما يَخْرُجُ مِنْها وَما يَنْزِلُ مِنَ السَّماءِ وَما يَعْرُجُ فيها، وَلا يَشْغَلُهُ ما يَلِجُ فِى الاَرْضِ وَمايَخْرُجُ مِنْها عَمّا يَنْزِلُ مِنَ السَّماءِ وَما يَعْرُجُ فيها، وَلا يَشْغَلُهُ ما يَنْزِلُ مِنَ السَّماءِ وَما يَعْرُجُ فيها عَمّا يَلِجُ فِى الاَرْضِ وَما يَخْرُجُ مِنْها، وَلا يَشْغَلُهُ عِلْمُ شَىْء عَنْ عِلْمِ شَىْء وَلا يَشْغَلُهُ خَلْقُ شَىْء عَنْ خَلْقِ شَيْء، وَلا حِفْظُ شَيْء، عَنْ حِفْظِ شَيْء وَلا يُساويهِ شَيْءٌ وَلا يَعْدِلُهُ شَيْءٌ لَيْسَ كَمِثْلِهِ شَيْءٌ وَهُوَ السَّميعُ الْبَصيرُ (9) سُبْحـانَ اللهِ بارِئِ النَّسَمِ، سُبْحـانَ اللهِ الُمصَوِّرِ، سُبْحـانَ اللهِ خالِقِ الاَزْواجِ كُلِّها، سُبْحـانَ اللهِ جاعِلِ الظُّلُماتِ وَالنُّورِ، سُبْحـانَ اللهِ فالِقِ الْحَبِّ وَالنَّوى، سُبْحـانَ اللهِ خالِقِ كُلِّ شَيء، سُبْحـانَ اللهِ خالِقِ ما يُرى وَما لا يُرى، سُبْحـانَ اللهِ مِدادَ كَلِماتِهِ، سُبْحـانَ اللهِ رَبِّ الْعالَمينَ، سُبْحـانَ اللهِ فاطِرِ السَّماواتِ وَالاَرْضِ، جاعِلِ الْمَلائِكَةِ رُسُلاً اُولي اَجْنِحَة، مَثْنى وَثُلاثَ وَرُباعَ، يَزيدُ فِى الْخَلْقِ ما يَشاءُ اِنَّ اللهَ عَلى كُلِّ شَيْء قَديرٌ، ما يَفْتَحِ اللهُ لِلنّاسِ مِنْ رَحْمَة فَلا مُمْسِكَ لَها، وَما يُمْسِكُ فَلا مُرْسِلَ لَهُ مِنْ بَعْدِهِ وَهُوَ الْعَزيزُ الْحَكيمُ (10) سُبْحـانَ اللهِ بارِىءِ النَّسَمِ، سُبْحـانَ اللهِ الُمصَوِّرِ، سُبْحـانَ اللهِ خالِقِ الاَزْواجِ كُلِّها، سُبْحـانَ اللهِ جاعِلِ الظُّلُماتِ وَالنُّورِ، سُبْحـانَ اللهِ فالِقِ الْحَبِّ وَالنَّوى، سُبْحـانَ اللهِ خالِقِ كُلِّ شَيء، سُبْحـانَ اللهِ خالِقِ ما يُرى وَما لا يُرى، سُبْحـانَ اللهِ مِدادَ كَلِماتِهِ، سُبْحـانَ اللهِ رَبِّ الْعالَمينَ، سُبْحـانَ اللهِ الَّذي يَعْلَمُ ما فِى السَّماواتِ وَما فِى الاَرْضِ، ما يَكُونُ مِنْ نَجْوى ثَلاثَة إلاّ هوَ رابِعُهُمْ، وَلا خَمْسَة اِلاّا هُوَ سادِسُهُمْ، وَلا اَدْنى مِنْ ذلِكَ وَلا اَكْثَرَ إلاّ هُوَ مَعَهُمْ اَيْنَما كانُوا، ثُمَّ يُنَبِّئُهُمْ بِما عَمِلُوا يَوْمَ الْقِيامَةِ اِنَّ اللهَ بِكُلِّ شَيْء عَليمٌ.',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: 'الثّالث :',
                  subtitle:
                      'وقالا أيضاً: تصلّي في كلّ يوم من رمضان على النّبي تقول :\n\n'
                      'اِنَّ اللهَ وَمَلائِكَتَةُ يُصَلُّونَ عَلَى النَّبِيِّ يا اَيُّهَا الَّذينَ آمَنُوا صَلُّوا عَلَيْهِ وَسَلِّمُوا تَسْليما، لَبَّيْكَ يا رَبِّ وَسَعْدَيْكَ وَسُبْحانَكَ، اَللّـهُمَّ صَلّ عَلى مُحَمَّد وَآلِ مُحَمَّد، وَبارِكَ عَلى مُحَمَّد وَآلِ مُحَمَّد، كَما صَلَّيْتَ وَبارَكْتَ عَلى اِبْراهيمَ وَآلِ اِبْراهيمَ اِنَّكَ حَميدٌ مَجيدٌ، اَللّـهُمَّ ارْحَمْ مُحَمَّداً وَآلِ مُحَمَّد كَما رَحِمْتَ اِبْراهيمَ وآلَ اِبْراهيمَ اِنَّكَ حَميدٌ مَجيدٌ، اَللّـهُمَّ سَلِّمْ عَلى مُحَمَّد وَآلِ مُحَمَّد كَما سَلَّمْتَ عَلى نُوح فِى الْعالَمينَ، اَللّـهُمَّ امْنُنْ عَلى مُحَمَّد وَآلِ مُحَمَّد كَما مَنَنْتَ عَلى مُوسى وَهارُونَ، اَللّـهُمَّ صَلّ عَلى مُحَمَّد وَآلِ مُحَمَّد كَما شَرَّفْتَنا بِهِ اَللّهُمَّ صَلّ عَلى مُحَمَّد وَآلِ مُحَمَّد كَما هَدَيْتَنا بِهِ، اَللّـهُمَّ صَلّ عَلى مُحَمَّد وَآلِ مُحَمَّد وَابْعَثْهُ مَقاماً مَحْمُوداً يَغْبِطُهُ بِهِ الاَوَّلُونَ وَالاخِرُونَ، عَلى مُحَمَّد وَآلِهِ السَّلامُ كُلَّما طَلَعَتْ شَمْسٌ اَوْ غَرَبَتْ، عَلى مُحَمَّد وآلِهِ السَّلامُ كُلَّما طَرَفَتْ عَيْنٌ اَوْ بَرَقَتْ، عَلى مُحَمَّد وَآلِهِ السَّلامُ كُلَّما ذُكِرَ السَّلامُ، عَلى مُحَمَّد وَآلِهِ السَّلامُ كُلَّما سَبَّحَ اللهَ مَلَكٌ اَوْ قَدَّسَهُ، السَّلامُ عَلى مُحَمَّد وَآلِهِ فِى الاَوَّلينَ، والسَّلامُ عَلى مُحَمَّد وَآلِهِ فِى الاخِرِينَ، وَالسَّلامُ عَلى مُحَمَّد وَآلِهِ فِي الدُّنْيا وَالاخِرَةِ، اَللّـهُمَّ رَبَّ الْبَلَدِ الْحرامِ وَرَبَّ الرُّكْنِ وَالْمَقامِ، وَرَبَّ الْحِلِّ وَالْحَرامِ، اَبْلِغْ مُحَمَّداً نَبيَّكَ عَنَّا السَّلامَ، اَللّـهُمَّ اَعْطِ مُحَمَّداً مِنَ الْبَهاءِ وَالنَّضْرَةِ وَالسُّرُورِ وَالْكَرامَةِ وَالْغِبْطَةِ وَالْوَسيلَةِ وَالْمَنْزِلَةِ وَالْمَقامِ وَالشَّرَفِ وَالرِّفْعَةِ وَالشَّفاعَةِ عِنْدَكَ يَوْمَ الْقِيامَةِ اَفْضَلَ ما تُعْطي اَحَداً مِنْ خَلْقِكَ، وَاَعْطِ مُحَمَّداً فَوْقَ ما تُعْطِي الْخَلائِقَ مِنَ الْخَيْرِ اَضْعافاً كَثيرَةً لا يُحْصيها غَيْرُكَ، اَللّـهُمَّ صَلِّ عَلى مُحَمَّد وَآلِ مُحَمَّد اَطْيَبَ وَاَطْهَرَ وَأزْكى وَاَنْمى وَاَفْضَلَ ما صَلَّيْتَ عَلى اَحَد مِنَ الاَوَّلينَ وَالاخِرينَ، وَعَلى اَحَد مِنْ خَلْقِكَ يا اَرْحَمَ الرّاحِمينَ، اَللّـهُمَّ صَلِّ عَلى عَليٍّ اَميرِ الْمُؤْمِنينَ وَوالِ مَنْ والاهُ وَعادِ مَنْ عاداهُ وَضاعِفِ الْعَذابَ عَلى مَنْ شَرِكَ في دَمِهِ، اَللّـهُمَّ صَلِّ عَلى فاطِمَةَ بِنْتِ نَبيِّكَ مُحَمَّد عَلَيْهِ وَآلِهِ السَّلامُ وَالْعَنْ مَنْ آذى نَبِيَّكَ فيهاوَوال مَنْ والاها وعاد مَنْ عاداها وضا عِفِ العَذاب عَلى مَن ظَلَمَها واَلعَنْ مَنْ اذى نَبيِّك فيْها اَللّـهُمَّ صَلِّ عَلَى الْحَسَنِ وَالْحُسَيْنِ اِمامَىِ الْمُسْلِمينَ، وَوالِ مَنْ والاهُماوَعادِ مَنْ عاداهُما، وَضاعِفِ الْعَذابَ عَلى مَنْ شَرِكَ في دِمائِهِما، اَللّـهُمَّ صَلِّ عَلى عَلِيِّ بْنِ الْحُسَيْنِ اِمامِ الْمُسْلِمينَ وَوالِ مَنْ والاهُ وَعادِ مَنْ عاداهُ وَضاعِفِ الْعَذابَ عَلى مَنْ ظَلَمَهُ، اَللّـهُمَّ صَلِّ عَلى مُحَمَّد بنِ عَلِيٍّ اِمامِ الْمُسْلِمينَ وَوالِ مَنْ والاهُ وَعادِ مَنْ عاداهُ وَضاعِفِ الْعَذابَ عَلى مَنْ ظَلَمَهُ، اَللّـهُمَّ صَلِّ عَلى جَعْفَرِ بْنِ مُحَمَّد اِمامِ الْمُسْلِمينَ وَوالِ مَنْ والاهُ وَعادِ مَنْ عاداهُ وَضاعِفِ الْعَذابَ عَلى مَنْ ظَلَمَهُ، اَللّـهُمَّ صَلِّ عَلى مُوسَى بْنِ جَعْفَر اِمامِ الْمُسْلِمينَ وَوالِ مَنْ والاهُ وَعادِ مَنْ عاداهُ وَضاعِفِ الْعَذابَ عَلى مَنْ شَرِكَ في دَمِهِ، اَللّـهُمَّ صَلِّ عَلى عَلِيِّ بْنِ مُوسى اِمامِ الْمُسْلِمينَ وَوالِ مَنْ والاهُ وَعادِ مَنْ عاداهُ وَضاعِفِ الْعَذابَ عَلى مَنْ شَرِكَ في دَمِهِ، اَللّـهُمَّ صَلِّ عَلى مُحَمَّد بْنِ عَلِيٍّ اِمامِ الْمُسْلِمينَ وَوالِ مَنْ والاهُ وَعادِ مَنْ عاداهُ وَضاعِفِ الْعَذابَ عَلى مَنْ ظَلَمَهُ، اَللّـهُمَّ صَلِّ عَلى عَلِي بْنِ مُحَمَّد اِمامِ الْمُسْلِمينَ وَوالِ مَنْ والاهُ وَعادِ مَنْ عاداهُ وَضاعِفِ الْعَذابَ عَلى مَنْ ظَلَمَهُ، اَللّـهُمَّ صَلِّ عَلَى الْحَسَنِ بْنِ عَلِيٍّ اِمامِ الْمُسْلِمينَ وَوالِ مَنْ والاهُ وَعادِ مَنْ عاداهُ وَضاعِفِ الْعَذابَ عَلى مَنْ ظَلَمَهُ، اَللّـهُمَّ صَلِّ عَلَى الْخَلَفِ مِنْ بَعْدِهِ اِمامِ الْمُسْلِمينَ وَوالِ مَنْ والاهُ وَعادِ مَنْ عاداهُ وَعَجِّلْ فَرَجَهُ، اَللّـهُمَّ صَلِّ عَلَى الْقاسِمِ وَالطّاهِرِ اِبْنَي نَبِيِّكَ، اَللّـهُمَّ صَلِّ عَلَى رُقَيَّةَ بِنْتِ نَبِيِّكَ وَالْعَنْ مَنْ آذى نَبِيَّكَ فيها، اَللّـهُمَّ صَلِّ عَلَى اُمِّ كُلْثُومَ بِنْتِ نَبِيِّكَ وَالْعَنْ مَنْ آذى نَبِيَّكَ فيها، اَللّـهُمَّ صَلِّ عَلَى ذُرِّيَّةِ نَبِيِّكَ، اَللّـهُمَّ اخْلُفْ نَبِيَّكَ في اَهْلِ بَيْتِهِ، اَللّـهُمَّ مَكِّنْ لَهُمْ فِى الاَرْضِ، اَللّـهُمَّ اجْعَلْنا مِنْ عَدَدِهِمْ وَمَدَدِهِمْ وَاَنْصارِهِمْ عَلَى الْحَقِّ فِى السِّرِّ وَالْعَلانَيَةِ، اَللّـهُمَّ اطْلُبْ بِذِحْلِهِمْ وَوِتْرِهِمْ وَدِمائِهِمْ وَكُفَّ عَنّا وَعَنْهُمْ وَعَنْ كُلِّ مُؤْمِن وَمُؤْمِنَة بَأسَ كُلِّ باغ وَطاغ وَكُلِّ دابَّة اَنْتَ آخِذٌ بِناصِيَتِها اِنَّكَ اَشَدُّ بَأساً وَاَشَدُّ تَنْكيلاً.\n\n'
                      'وقال السّيّد ابن طاووس وتقول : يا عُدَّتي في كُرْبَتي، وَيا صاحِبي في شِدَّتي، وَيا وَلِيّي في نِعْمَتي، وَيا غايَتي في رَغْبَتي، اَنْتَ السّاتِرُ عَوْرَتي، وَالْمُؤْمِنُ رَوْعَتي، وَالْمُقيلُ عَثْرَتي، فَاغْفِرْ لي خَطيئَتي يا اَرْحَمَ الرّاحِمينَ وتقول : اَللّـهُمَّ اِنّي اَدْعُوكَ لِهَمٍّ لا يُفَرِّجُهُ غَيْرُكَ، وَلِرَحْمَة لا تُنالُ إلاّ بِكَ، وَلِكَرْب لا يَكْشِفُهُ إلاّ اَنْتَ، وَلِرَغْبَة لا تُبْلَغُ إلاّ بِكَ، وَلِحاجَة لا يَقْضيها إلاّ اَنْتَ، اَللّـهُمَّ فَكَما كانَ مِنْ شَأنِكَ ما اَذِنْتَ لي بِهِ مِنْ مَسْأَلَتِكَ وَرَحِمْتَني بِهِ مِنْ ذِكْرِكَ، فَلْيَكُنْ مِنْ شَأنِكَ سَيِّدي الاِجابَةُ لي فيـما دَعْوَتُكَ، وَعَوائِدُ الاِفْضالِ فيـما رَجَوْتُكَ، وَالنَّجاهُ مِمّا فَزِعْتُ اِلَيْكَ فيهِ، فَاِنْ لَمْ اَكُنْ اَهْلاً اَنْ اَبْلُغَ رَحْمَتَكَ فَاِنَّ رَحْمَتَكَ اَهْلٌ اَنْ تَبْلُغَني وَتَسَعَني، وَاِنْ لَمْ اَكُنْ لِلاِْجابَةِ اَهْلاً فَاَنْتَ اَهْلُ الْفَضْلِ، وَرَحْمَتُكَ وَسِعَتْ كُلَّ شَيْء، فَلْتَسَعْني رَحْمَتُكَ، يا اِلـهي يا كَريمُ اَسْاَلُكَ بِوَجْهِكَ الْكَريمِ اَنْ تُصَلِّيَ عَلى مُحَمَّد وَاَهْلِ بَيْتِهِ، وَاَنْ تُفَرِّجَ هَمّي، وَتَكْشِفَ كَرْبي وَغَمّي، وَترْحَمَني بِرَحْمَتِكَ، وَتَرْزُقَني مِنْ فَضْلِكَ اِنَّكَ سَميعُ الدُّعاءِ قَريبٌ مُجيبٌ.',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: 'الرّابع :',
                  subtitle: 'وقال الشّيخ والسّيد أيضاً : قل في كلّ يوم :\n\n'
                      'اَللّـهُمَّ اِنّي اَسْاَلُكَ مِنْ فَضْلِكَ بِاَفْضَلِهِ وَكُلُّ فَضْلِكَ فاضِلٌ، اَللّـهُمَّ اِنّي اَسْاَلُكَ بِفَضْلِكَ كُلِّه، اَللّـهُمَّ اِنّي اَسْاَلُكَ مِنْ رِزْقِكَ بِاَعَمِّهِ وَكُلُّ رِزْقِكَ عامٌّ، اَللّـهُمَّ اِنّي اَسْاَلُكَ بِرِزْقِكَ كُلِّهِ، اَللّـهُمَّ اِنّي اَسْاَلُكَ مِنْ عَطائِكَ بِأَهْنَئِهِ وَكُلُّ عَطائكَ هَنيءٌ، اَللّـهُمَّ اِنّي اَسْاَلُكَ بِعَطائِكَ كُلِّه، اَللّـهُمَّ اِنّي اَسْاَلُكَ مِنْ خَيْرِكَ بِاَعْجَلِهِ وَكُلُّ خَيْرِكَ عاجِلٌ، اَللّـهُمَّ اِنّي اَسْاَلُكَ بِخَيْرِكَ كُلِّهِ اَللّـهُمَّ اِنّي اَسْاَلُكَ مِنْ اِحْسانِكَ بِاَحْسَنِهِ وَكُلُّ اِحْسانِكَ حَسَنٌ، اَللّـهُمَّ اِنّي اَسْاَلُكَ بِاِحْسانِكَ كُلِّهِ، اَللّـهُمَّ اِنّي اَسْاَلُكَ بِما تُجيبُني بِهِ حينَ اَسْاَلُكَ فَاَجِبْني يا اَللهُ، وَصَلِّ عَلى مُحَمَّد وآلِ مُحَمَّد عَبْدِكَ الْمُرْتَضى، وَرسُولِكَ الْمُصْطَفى، وَاَمينِكَ وَنَجِيِّكَ دُونَ خلْقِكَ وَنَجيبِكَ مِنْ عِبادِكَ، وَنَبِيِّكَ بِالصِّدْقِ، وَحَبيبِكَ، وَصَلِّ عَلى رَسُولِكَ وَخِيَرَتِكَ مِنَ الْعالَمينَ، الْبَشيرِ الَّنذيرِ السِّراجِ الْمُنيرِ، وَعلى اَهْلِ بَيْتِهِ الاَبْرارِ الطّاهِرينَ، وَعَلى مَلائِكَتِكَ الَّذينَ اسْتَخْلَصْتَهُمْ لِنَفْسِكَ، وَحَجَبْتَهُمْ عَنْ خَلْقِكَ، وَعَلى اَنْبِيائِكَ الَّذينَ يُنبِئُونَ عَنْكَ بِالصِّدْقِ، وَعَلى رُسُلِكَ الَّذينَ خَصَصْتَهُمْ بِوَحْيِكَ، وَفَضَّلْتَهُمْ عَلَى الْعالَمينَ بِرِسالاتِكَ، وَعَلى عِبادِكَ الصّالِحينَ الَّذينَ اَدْخَلْتَهُمْ في رَحْمَتِكَ، الاَئِمَّةِ الْمُهْتَدينَ الرّاشِدينَ، وَاَوْلِيائِكَ الْمُطَهَّرينَ، وَعَلى جَبْرَئيلَ وَميكائيلَ وَاِسْرافيلَ وَمَلَكِ الْمَوْتِ، وَعَلى رِضْوانَ خازِنِ الْجِنانِ، وَعَلى مالِك خازِنِ النّارِ، وَرُوحِ الْقُدُسِ وَالرُّوحِ الاَمينِ، وَحَمَلَةِ عَرْشِكَ الْمُقَرَّبينَ، وَعَلى الْمَلَكَيْنِ الْحافِظَيْنِ عَلَيَّ بِالصَّلاةِ الَّتي تُحِبُّ اَنْ يُصَلِّيَ بِها عَلَيْهِمْ اَهْلُ السَّماواتِ وَاَهْلُ الاَرَضينَ صَلاةً طَيِّبَةً كَثيرةً مُبارَكَةً زاكِيَةً نامِيَةً ظاهِرَةً باطِنَةً شَريفَةً فاظِلَةً، تُبَيِّنُ بِها فَضْلَهُمْ عَلَى الاَوَّلينَ وَالاخِرِينَ، اَللّـهُمَّ اعْطِ مُحَمَّداً الْوَسيلَةَ وَالشَّرَفَ وَالْفَضيلَةَ واجْزِهِ خَيْرَ ما جَزَيْتَ نَبِيّاً عَنْ اُمَّتِهِ، اَللّـهُمَّ وَاَعْطِ مُحَمَّداً صَلَّى اللهُ عَلَيْهِ وَآلِهِ مَعَ كُلِّ زُلْفَة زُلْفَةً، وَمَعَ كُلِّ وَسيلَة وَسيلَةً، وَمَعَ كُلِّ فَضيلَة فَضيلَةً، وَمَعَ كُلِّ شَرَف شَرَفَاً تُعْطي اَللّـهُمَّ أعْطِ مُحَمَّداً وَآلَهُ يَوْمَ الْقِيامَةِ اَفْضَلَ ما اَعْطَيْتَ اَحَداً مِنَ الاَوَّلينَ والاخِرِينَ، اَللّـهُمَّ وَاجْعَلْ مُحَمَّداً صَلَّى اللهُ عَلَيْهِ وآلِهِ اَدْنَى الْمُرْسَلينَ مِنْكَ مَجْلِساً، وَأفْسَحَهُمْ فِى الْجَنَّةِ عِنْدَكَ مَنْزِلاً، وَاَقْرَبَهُمْ اِلَيْكَ وَسيلَةً، وَاْجْعَلْهُ اَوَّلَ شافِع، وَاَوَّلَ مُشَفَّع، وَاَوَّلَ قائِل، وَاَنْجَحَ سائِل، وَابْعَثْهُ الْمَقامَ الَْمحْمُودَ الَّذي يَغْبِطُهُ بِهِ الاَوَّلُونَ والاخِرُونَ يا اَرْحَمَ الرّاحِمينَ، وَاَسْاَلُكَ اَنْ تُصَلِّيَ عَلى مُحَمَّد وَآلِ مُحَمَّد وَاَنْ تَسْمَعَ صَوْتي وَتُجيبَ دَعْوَتي، وَتَجاوَزَ عَنْ خَطيئَتي، وَتَصْفَحَ عَنْ ظُلْمي، وَتُنْجِحَ طَلِبَتي، وَتَقْضِيَ حاجَتي، وَتُنْجِزَ لي ما وَعَدْتَني، وَتُقيلَ عَثْرَتي، وَتَغْفِرَ ذُنُوبي، وَتَعْفُوَ عَنْ جُرْمي، وَتُقْبِلَ عَلَيَّ وَلاتُعْرِضَ عَنّي، وَتَرْحَمَني وَلا تُعَذِّبَني وَتُعافِيَني وَلا تَبْتَلِيَني، وَتْرزُقَني مِنَ الرِّزْقِ اَطْيَبَهُ وَاَوْسَعَهُ وَلا تَحْرِمْني يا رَبِّ وَاقْضِ عَنّي دَيْني، وَضَعْ عَنّي وِزْري، وَلا تُحَمِّلْني ما لا طاقَةَ لي بِهِ، يامَوْلايَ اَدْخِلْني في كُلِّ خَيْر اَدْخَلْتَ فيهِ مُحَمَّداً وآلَ مُحَمَّد، وَاَخْرِجْني مِنْ كُلِّ سُوء اَخْرَجْتَ مِنْهُ مُحَمَّداً وَآلَ مُحَمَّد، صَلَواتُكَ عَلَيْهِ وَعَلَيْهِمْ، وَالسَّلامُ عَلَيْهِ وَعَلَيْهِمْ وَرَحْمَةُ اللهِ وَبَرَكاتُهُ.\n\n'
                      'ثمّ قل ثلاثاً : اَللّـهُمَّ اِنّي اَدْعُوكَ كَما اَمَرْتَني فَاسْتَجِبْ لي كَما وَعَدْتَني (ثمّ قل) اَللّـهُمَّ اِنّي اَسْاَلُكَ قَليلاً مِنْ كَثير مَعَ حاجَة بي اِلَيْهِ عَظيمَة، وَغِناكَ عَنْهُ قَديمٌ، وَهُوَ عِنْدي كَثيرٌ، وَهُوَ عَلَيْكَ سَهْلٌ يَسيرٌ، فَامْنُنْ عَلَيَّ بِهِ اِنَّكَ عَلى كُلِّ شَيء قَديْرٌ، آمينَ رَبَّ الْعالَمينَ.',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: 'الخامس :',
                  subtitle:
                      'أن يدعو بهذا الدّعاء اَللّـهُمَّ اِنِّي اَدْعُوكَ كَما اَمَرْتَني فَاسْتَجِبْ لي كَما وَعَدْتَني وقد تركناه لطوله فليطلب من كتاب الاقبال أو من زاد المعاد.',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: 'السّادس :',
                  subtitle:
                      'روى المفيد في المقنعة عن الثّقة الجليل عليّ بن مهزيار عن الامام محمّد التّقي (عليه السلام) انّه يستحبّ أن تكثر في شهر رمضان في ليله ونهاره من أوّله الى آخره :\n\n'
                      'يا ذَا الَّذي كانَ قَبْلَ كُلِّ شَيء، ثُمَّ خَلَقَ كُلَّ شَيء، ثُمَّ يَبْقى وَيَفْنى كُلُّ شَيء، يا ذَا الَّذي لَيْسَ كَمِثْلِهِ شيءٌ، وَيا ذَا الَّذي لَيْسَ فِي السَّماواتِ الْعُلى، وَلا فِى الاَرَضينَ السُفْلى، وَلا فَوقَهُنَّ وَلا تَحْتَهُنَّ، وَلا بَيْنَهُنَّ اِلـهٌ يُعْبَدُ غَيْرُهُ لَكَ الْحَمْدُ حَمْداً لا يَقْوى عَلى اِحْصائِهِ إلاّ اَنْتَ، فَصَلِّ عَلى مُحَمَّد وَآلِ مُحَمِّد  صَلاةً لا يَقْوى عَلى اِحْصائِها إلاّ اَنْتَ .',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: 'السّابع :',
                  subtitle:
                      'روى الكفعمي في البلد الامين وفي المصباح عن كتاب اختيار السّيد ابن باقي انّ من قرأ هذا الدّعاء في كلّ يوم من رمضان غفر الله له ذنوب أربعين سنة اَللّـهُمَّ رَبَّ شَهْرِ رَمَضانَ الَّذي اَنْزَلْتَ فيهِ الْقُرْآنَ، وَافْتَرَضْتَ عَلى عِبادِكَ فيهِ الصِّيامَ، ارْزُقْني حَجَّ بَيْتِكَ الْحَرام  في هذَا الْعامِ وَفي كُلِّ عام، وَاغْفِرْ لِيَ الذُّنُوبَ الْعِظامَ فَاِنَّهُ لا يَغْفِرُها غَيْرُكَ يا ذَا الْجَلالِ وَالاْكْرامِ.',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: 'الثّامن :',
                  subtitle:
                      'أن يذكر الله تعالى في كلّ يوم مائة مرّة بهذه الاذكار التي أوردها المحدّث الفيض في كتاب خلاصة الاذكار سُبْحانَ الضّارِّ النّافِعِ، سُبْحانَ الْقاضي بالْحَقِّ، سُبْحانَ الْعَلِيِّ الاعْلى، سُبْحانَهُ وَبِحَمْدِهِ، سُبْحانَهُ وَتَعالى.',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: 'التّاسع :',
                  subtitle:
                      'قال المفيد في المقنعة: انّ من سُنن شهر رمضان الصّلاة على النّبي (صلى الله عليه وآله وسلم) في كلّ يوم مائة مرّة، والافضل أن يزيد عليها.',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
            ],
          ),
        ),
        bottomNavigationBar: AddCustomBottomNavigationBar(
        pushNext: SouratAlroum.screenRoute,
        pushBack: DouaaAlsa7ar.screenRoute,
        soud: 'https://cdn.jsdelivr.net/gh/SounaDiab/image_audio@master/audio/في اعمال ايام شهر رمضان.mp3',
        onTap: (double fontSize) {
          // تحديث حجم الخط
          setState(() {
            isTablet ? _fontSizeTablet = fontSize : _fontSize = fontSize;
          });
          print('fontSize: $fontSize');
          // إغلاق Dialog
          Navigator.of(context).pop();
        },
        onLongPress: () {
          final snackBar = SnackBar(
            content: Center(
              child: Text(
                '${isTablet ? _fontSizeTablet.toInt() : _fontSize.toInt()}',
                style: TextStyle(
                  color: Colors.white,
                  fontSize: 16,
                ),
              ),
            ),
            width: 60,
            behavior: SnackBarBehavior.floating,
            backgroundColor: Colors.blue,
            duration: Duration(seconds: 2),
            shape: ShapeBorder.lerp(
              RoundedRectangleBorder(
                borderRadius: BorderRadius.circular(50),
              ),
              RoundedRectangleBorder(
                borderRadius: BorderRadius.circular(50),
              ),
              1,
            ),
          );
          ScaffoldMessenger.of(context).showSnackBar(snackBar);
        },
      ),
      ),
    );
  }
}
