import 'package:flutter/material.dart';
import 'package:maktabat_almoslim/widgets/container_scrollview.dart';
import 'package:provider/provider.dart';
import 'package:shared_preferences/shared_preferences.dart';

import '../../../widgets/add_custom_bottom_navigation_bar.dart';
import '../../../widgets/list_of_nine_verses.dart';
import '../../favorites_provider.dart';
import '../../favorites_screen.dart';
import '../nozor_men_a3mal_allail_walnahar.dart';
import 'alta3kibat_al3amaa.dart';
import 'fi_nozor_mema_yo3mal_fi_alnahar_mabaina_tolou3_alshames_w8roubaha.dart';

class Alta3kibatAl5asaBfaridatAlsob7 extends StatefulWidget {
  static String screenRoute = 'alta3kibat_al5asa_bfaridat_alsob7_screen';
  const Alta3kibatAl5asaBfaridatAlsob7({super.key});

  @override
  State<Alta3kibatAl5asaBfaridatAlsob7> createState() =>
      _Alta3kibatAl5asaBfaridatAlsob7State();
}

double _fontSize = 18;
double _fontSizeTablet = 30;

class _Alta3kibatAl5asaBfaridatAlsob7State
    extends State<Alta3kibatAl5asaBfaridatAlsob7> {
  bool isIcon = true;
  @override
  void initState() {
    super.initState();
    _loadFavoriteState();
  }

  Future<void> _loadFavoriteState() async {
    final prefs = await SharedPreferences.getInstance();
    bool? savedState =
        prefs.getBool('isFavorite_alta3kibat_al5asa_bfaridat_alsob7_screen');
    setState(() {
      isIcon = savedState ?? true;
    });
  }

  Future<void> _saveFavoriteState(bool value) async {
    final prefs = await SharedPreferences.getInstance();
    await prefs.setBool(
        'isFavorite_alta3kibat_al5asa_bfaridat_alsob7_screen', value);
  }

  Future<bool> _onWillPop() async {
    final args =
        ModalRoute.of(context)!.settings.arguments as Map<String, dynamic>?;
    final previousPage = args?['previousPage'];
    if (previousPage == 'favorite_screen') {
      Navigator.of(context).pushReplacementNamed(FavoritesScreen.screenRoute);
      return false;
    } else {
      Navigator.of(context)
          .pushReplacementNamed(NozorMenA3malAllailWalnahar.screenRoute);
      return false;
    }
  }

  @override
  Widget build(BuildContext context) {
    double size = MediaQuery.of(context).textScaleFactor;
    final screenWidth = MediaQuery.of(context).size.width;
    final isTablet = screenWidth >= 600;
    return WillPopScope(
      onWillPop: _onWillPop,
      child: Scaffold(
        appBar: AppBar(
          toolbarHeight: isTablet ? 100 : 50,
          centerTitle: true,
          leading: IconButton(
            onPressed: _onWillPop,
            icon: Icon(
              Icons.arrow_back,
              size: isTablet ? 50 : 25,
            ),
          ),
          actions: [
            IconButton(
              padding: EdgeInsets.only(left: isTablet ? 50 : 30),
              icon: Icon(
                isIcon ? Icons.favorite_border : Icons.favorite_rounded,
                size: isTablet ? 40 : 25,
                color: isIcon ? Colors.black : Colors.red,
              ),
              onPressed: () async {
                setState(() {
                  isIcon = !isIcon;
                });
                await _saveFavoriteState(isIcon);

                if (!isIcon) {
                  Provider.of<FavoritesProvider>(context, listen: false)
                      .addFavorite('التعقيبات الخاصة بفريضة الصبح',
                          Alta3kibatAl5asaBfaridatAlsob7.screenRoute);
                } else {
                  Provider.of<FavoritesProvider>(context, listen: false)
                      .removeFavorite(
                          'التعقيبات الخاصة بفريضة الصبح',
                          Alta3kibatAl5asaBfaridatAlsob7.screenRoute,
                          Alta3kibatAl5asaBfaridatAlsob7.screenRoute);
                }
              },
            ),
          ],
          title: Text(
            'التعقيبات الخاصة بفريضة الصبح',
            style: TextStyle(
              fontSize: isTablet
                  ? 40
                  : size > 1.0
                      ? 20
                      : 23,
              fontWeight: FontWeight.bold,
            ),
          ),
        ),
        body: ContainerScrollview(
          widget: Column(
            crossAxisAlignment: CrossAxisAlignment.start,
            children: [
              Container(
                child: Column(
                  children: [
                    Center(
                      child: Text(
                        'بسم الله الرحمن الرحيم',
                        style: TextStyle(
                          fontSize: isTablet ? _fontSizeTablet : _fontSize,
                          fontWeight: FontWeight.w900,
                        ),
                      ),
                    ),
                    Center(
                      child: Text(
                        'اللهم صلِّ على محمد وآل محمد',
                        style: TextStyle(
                          fontSize: isTablet ? _fontSizeTablet : _fontSize,
                          fontWeight: FontWeight.w900,
                        ),
                      ),
                    ),
                  ],
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: '',
                  subtitle:
                      'إعلم أنّ ماورد من الاذكار والدعوات لتعقيب صلاة الصبح أكثر مما ورد لغيرها والاحاديث في فضل هذا التعقيب خاصّة كثيرة.\n\n'
                      'وعن أمير المؤمنين (عليه السلام): إن ذكر الله بعد صلاة الغداة إلى طلوع الشمس أسرع في طلب الرزق من الضرب في الارض.\n\n'
                      'وعن النبي (صلّى الله عليه وآله وسلم) من جلس في مصلاه يعقب من صلاة الفجر إلى طلوع الشمس ستره الله من النار. وعن الباقر (عليه السلام): إنّ إبليس إنّما يبث جنوده، جنود النهار، من حين طلوع الفجر إلى مطلع الشمس، ويبث جنوده، جنود الليل، من حين غروب الشمس إلى ذهاب الحمرة المغربيّة. فاذكروا الله تعالى في هاتين الساعتين ذكراً كَثِيراً فإن إبليس يبذل جهده في هاتين الساعتين حتى يجعل المر غافلاً عن ذكر اللّه.\n\n'
                      'وروي بسند صحيح عن الرضا (عليه السلام) أنّه كان في خراسان إذا صلّى فريضة الصبح قعد في مصلاه يعقب إلى طلوع الشمس، ثم يؤتى إليه بخريطة فيها المساويك فيسوك بها واحداً واحداً ثم يمضغ شَيْئاً من الكندر، ثم يأخذ في تلاوة الكتاب المجيد. وعن النبي (صلّى الله عليه وآله وسلم): من قعد في مصلاه الذي صلّى فيه الفجر يذكر الله حتى تطلع الشمس كان له حج بيت اللّه. وفي الحديث القدسي قال الله تعالى: ياابن ادم اذكرني بعد الصباح بساعة وبعد العصر بساعة لكي اكفيك جميع ماأهمك.',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: 'وأما التعقيبات الخاصة بفريضة الصبح فهي كمايلي :\n\n'
                      'الأول :',
                  subtitle:
                      'روى ابن بابويه بسند معتبر عن الباقر (عليه السلام) قال: من استغفر الله تعالى بعد صلاة الفجر سبعين مرة غفر الله له ولو عمل ذلك اليوم سبعين ذنبا. وعلى رواية أخرى سبعمائة ذنب.',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: 'الثاني :',
                  subtitle:
                      'روى ابن بابويه أيضاً بسند صحيح وأسناد معتبرة عن أمير المؤمنين (عليه السلام) قال: من صلى صلاة الفجر ثم قرأ:\n\n'
                      'قل هو الله أحد إحدى عشرة مرة لم يتبعه في ذلك اليوم ذنب وإن رغم أنف الشيطان. وفي (البلد الامين) عن النبي ص قال: من قرأ التوحيد كل يوم عشر مرات لم يدركه في ذلك اليوم ذنب وإن جهد الشيطان.',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: 'الثالث :',
                  subtitle:
                      'روى الكليني بسند صحيح عن الصادق (عليه السلام): إن من قال بعد فريضة الفجر مائة مرة: ماشاءَ الله كانَ لا حَوْلَ وَلا قُوَّةَ إِلاّ بِالله العَلي العَظيمِ لم ير مكروها في ذلك اليوم. ورواها أيضاً الطوسي وغيره في كتب الدّعوات.',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: 'الرابع :',
                  subtitle:
                      'روى الكفعمي وغيره عن الباقر (عليه السلام) قال: من قرأ القدر بعد الصبح عشراً، وحين تزول الشمس عشراً، وبعد العصر عشراً، أتعب ألفي كاتب ثلاثين سنة.\n\n'
                      'وعنه أيضاً قال: ماقرأها عبد سبع مرّات بعد طلوع الفجر إِلاّ صلّى عليه صفُّ من الملائكة سبعين صلاة، وترحموا عليه سبعين رحمة. وقد روي عن محمد التقي (عليه السلام) ثواب جزيل لمن قرأ سورة القدر في كل يوم وليلة ستا وسبعين مرة يقرؤها بعد طلوع الفجر قبل صلاة الغداة سبعا، وبعدها عشراً، وإذا زالت الشمس قبل النافلة عشراً، وبعد نوافل الزوال إحدى وعشرين، وبعد صلاة العصر عشراً، وبعد العشاء الاخرة سبعاً، وحين يأوي إلى فراشه إحدى عشرة، ومن ثوابها أنّه يخلق الله تعالى له ألف ملك يكتبون ثوابها ستة وثلاثين ألف عام.',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: 'الخامس :',
                  subtitle:
                      'روى ابن بابويه وغيره من العلماء رضوان الله عليهم بأسناد معتبرة عن الباقر (عليه السلام) أنّه قال: قال النبي (صلّى الله عليه وآله وسلم) إذا صليت الصبح فقل عشر مرات: سُبْحانَ الله العَظيمِ وَبِحَمْدِهِ وَلا حَوْلَ وَلا قُوَّةَ إِلاّ بِالله العَليّ العَظيمِ فإنّ الله عزَّ وجلَّ يعافيك بذلك من العمى والجنون والجذام والفقر والهدم أو الهرم.',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: 'السادس :',
                  subtitle:
                      'في (البلد الامين) عن أمير المؤمنين (عليه السلام) قال: قال رسول الله (عليه السلام) من أراد أن يؤخر الله تعالى أجله ويظفره بأعدائه ويصونه من ميتة السوء فليتحافظ على هذا الدعاء في كل صباح ومساء يقول ثلاثا: سُبْحانَ الله مِلأ الميزانِ وَمُنْتَهى العِلْمِ وَمَبْلَغِ الرِّضا وَزِنَةَ العَرْشِ وَسَعَةَ الكُرْسي وثلاثا الحَمْدُ لله مِلأ الميزانِ وَمُنْتَهى العِلْمِ وَمَبْلَغَ الرِّضا وَزِنَةَ العَرْشِ وَسَعَةَ الكُرْسي وثلاثا: لا إِلهَ إِلاّ الله مِلا الميزانِ وَمُنْتَهى العِلْمِ وَمَبْلَغَ الرِّضا وَزِنَةَ العَرْشِ وَسَعَةَ الكُرْسي وثلاثا: الله أكْبَرُ مِلا الميزانِ وَمُنْتَهى العِلْمِ وَمَبْلَغَ الرِّضا وَزِنَةَ العَرْشِ وَسَعَةَ الكُرْسي.',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: 'السابع :',
                  subtitle:
                      'روى السيد بن طاووس بسند معتبر عن الرضا (عليه السلام) قال: من قال بعد صلاة الفجر مائة مرة: بِسْمِ اللّهِ الرَّحْمنِ الرَّحيمِ لا حَوْلَ وَلا قُوَّةَ إِلاّ بِالله العَليّ العَظيمِ. كان اقرب إلى اسم الله الاعظم من سواد العين إلى بياضها. وبأسناد معتبرة عن الصادق والكاظم (عليه السلام): إنّ من دعا بهذا الدعاء في دبر صلاة الصبح وصلاة المغرب قبل أن يتكلم أو يتحول من مكانه سبع مرات دفع الله عنه سبعين نوعا من أنواع البلاء أهونها الجذام والبرص وكيد الشيطان وشرّ السلطان. وعلى بعض الروايات المعتبرة يقوله ثلاث مرات، وفي بعضها يقوله عشر مرّات، وأقله ثلاث مرّات، وأكثره مائة مرة، وإن زاد زيد له في ثوابه.',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: 'الثامن :',
                  subtitle:
                      'روى احمد بن فهد وغيره أنّه أتى رجل أبا الحسن الكاظم (عليه السلام) فشكا إليه حرفته وأنّه لايتوجه في حاجاته فتقضى له، فقال أبو الحسن (عليه السلام): قل بعد صلاة الفجر عشرا: سُبْحانَ الله العَظيمِ وبِحَمْدِهِ اسْتَغْفِرُ الله وَأسْئَلُهُ مِنْ فَضْلِهِ. قال الراوي: فلزمت ذلك فوالله مالبثت إِلاّ قليلاً حتى ورد عليّ قوم من البادية فأخبروني أنّ رجلاً من قومي مات ولم يعرف له وارث غيري فانطلقت وقبضت ميراثه ولم أزل مستغنيا.\n\n'
                      'وفي كتابي (الكافي) و(المكارم): أن رجلاً يدعى حلقام قال له (عليه السلام) جعلت فداك علمني دعاءً جامعاً للدنيا والاخرة وأوجز، فعلّمه هذا الدعاء ليدعو به في دبر الفجر إلى أن تطلع الشمس، فواظب عليه وحسن حاله.',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: 'التاسع :',
                  subtitle:
                      'روى العياشي عن عبد الله بن سنان قال: ذهبت إلى الصادق (عليه السلام) فقال: ألا أعلمك شَيْئاً إذا قلته قضى اللّه دينك وأنعش حالك. فقلت: ماأحوجني إلى ذلك، فقال: قل في دبر صلاة الفجر: تَوَكَلْتُ عَلى الحَيّ القَيّومِ الَّذِي لايَمُوتُ وَالحَمْدُ لله الَّذِي لَمْ يَتَّخِذْ وَلَداً وَلَمْ يَكُنْ لَهُ شَريكٌ في المُلْكِ وَلَمْ يَكُنْ لَهُ وَليُّ مِنَ الذِّلِ وَكَبِرْهُ تَكْبيراً، اللَّهُمَّ إِنِّي أعوذُ بِكَ مِنَ البؤسِ وَالفَقْرِ وَمِنْ غَلَبَةِ الدَّينِ وَالسَقْمِ، وَأَسْأَلُكَ أَنْ تُعينَني عَلى أداءِ حَقِّكَ إلَيْكَ وإِلى النّاسِ. وعلى رواية الطوسي وغيره: ومِنْ غَلَبَةِ الدَّينِ فصَلِّ عَلى مُحَمَّدٍ وَآل مُحَمَّدٍ وَأَعِنّي عَلى أداءِ حَقِّكَ إلَيْكَ وإِلى النّاسِ.',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: 'العاشر :',
                  subtitle:
                      'روى الكفعمي أنّ رجلاً شكا إلى رسول الله (صلّى الله عليه وآله وسلم) الفقر والبؤس والمرض فوصاه بأن يدعو بهذا الدعاء في كل صباح ومساء عشر مرات. فواظب عليه ثلاثة أيام ونفي عنه الفقر والسقم.\n\n'
                      'وأتى الطوسي وغيره بهذا الدعاء لتعقيب فريضة الصبح وهو هذا الدعاء: لا حَوْلَ وَلا قُوَّةَ إِلاّ بِالله تَوَكَلْتُ عَلى الحَيّ القَيّومِ الَّذِي لايَمُوتُ وَالحَمْدُ لله الَّذِي لَمْ يَتَّخِذْ وَلَداً وَلَمْ يَكُنْ لَهُ شَريكٌ في المُلْكِ وَلَمْ يَكُنْ لَهُ وَليُّ مِنَ الذِّلِ وَكَبِرْهُ تَكْبيراً.',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: 'الحادي عشر :',
                  subtitle:
                      'روى الطوسي والكفعمي وغيرهما عن النبي (صلّى الله عليه وآله وسلم) أنّه قال لاصحابه: أيعجز أحدكم أن يتخذ كل صباح ومساء عهداً عند الله تعالى، قالوا: وكيف ذلك ؟ قال: يدعو بهذا الدعاء فإذا دعا به طبع عليه بطابع، ووضع تحت العرش، فإذا كان يوم القيامة نادى منادٍ أين الذين لهم عند الرحمن عهداً فيعطون ذلك العهد ويدخلون الجنة. وقد ذكر الطوسي هذا الدعاء لتعقيب فريضة الصبح: اللَّهُمَّ فاطِرَ السَّماواتِ وَالارضِ عالِمَ الغَيبِ وَالشَّهادَةِ الرَّحْمنِ الرَّحيمِ أعْهَدُ إلَيْكَ في هِذِهِ الدُّنْيا أنَّكَ انْتَ الله لا إِلهَ إِلاّ أنْتَ وَحْدَكَ لا شَريكَ لَكْ وَأنَّ مُحَمَّدا صَلّى الله عَلَيْهِ وَآلِهِ عَبْدِكَ وَرَسُولِكَ، اللَّهُمَّ فصَلِّ عَلى مُحَمَّدٍ وَآلِهِ ولاتَكِلْني إِلى نَفْسي طُرْفَةَ عَيْنٍ أبَدا وَلا إِلى أحَدٍ مَنْ خَلْقِكَ فإِنَّكَ إنْ وَكَلْتَني إلَيْها تُباعِدْنِي مِنَ الخَيْرِ وَتُقَرِّبْني مِنَ الشَّرِّ. رَبِّ لا أثِقُ إِلاّ بِرَحْمَتِكَ فصَلِّ عَلى مُحَمَّدٍ وَآلِهِ الطَّيِّبينَ وَاجْعَلْ لي عِنْدَكَ عَهْداً تؤدِّيهِ إِلى يَوْمِ القيامَةِ إنَّكَ لا تُخْلِفُ الميعادَ.',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: 'الثاني عشر :',
                  subtitle:
                      'في كتاب (عدة الداعي) عن الصادق (عليه السلام) قال: إنّ من دعا بهذا الدعاء في دبر صلاة الفجر قبل أن يتكلم بشيٍ : رَبِّ صَلِّ عَلى مُحَمَّدٍ وَأهْلِ بَيْتِهِ وقى الله وجهه من نار جهنم. وروى ابن بابويه في كتاب (ثواب الاعمال) بسند معتبر: قل بعد فريضة الفجر مائة مرة: اللَّهُمَّ صَلِّ عَلى مُحَمَّدٍ وَآل مُحَمَّدٍ. لكي يقي الله تعالى وجهك من نار جهنم. وعلى رواية أخرى قل مائة مرة قبل أن تتكلم بشي: يارَبِّ صَلِّ عَلى مُحَمَّدٍ وَآل مُحَمَّدٍ وَاعْتِقْ رَقَبَتي مِنَ النّار. في سجدة الشكر فإذا فرغت من التعقيب فاسجد سجدة الشكر، وهي بإجماع من علماء الشيعة سنّة عند تجدد نعمة أو دفع بلا.\n\n'
                      'والافضل من هذه السجدة ماكانت بعد الصلاة شكراً لتوفيق الله تعالى لادائهما. وبسند معتبر عن الباقر (عليه السلام) قال: إن علي بن الحسين (عليهما السلام) ماذكر لله عزَّ وجلَّ نعمة عليه إِلاّ سجد، ولا قرأ آية من كتاب الله عزَّ وجلَّ فيها سجود إِلاّ سجد، ولا دفع الله عزَّ وجلَّ عنه سوءاً يخشاه إِلاّ سجد، ولا فرغ من صلاة مفروضة إِلاّ سجد، ولا وفق لاصلاح بين اثنين إِلاّ سجد.\n\n'
                      'وكان أثر السجود في جميع مواضع سجوده فسمّي السّجاد لذلك. وأيضاً بسند صحيح عن الصادق (عليه السلام) قال: أيّما مؤمن سجد لله سجدة لشكر نعمة في غير صلاة كتب الله له بها عشر حسنات ومحا عنه عشر سيئات ورفع له عشر درجات في الجنان. وبأسناد معتبرة عنه (عليه السلام) قال: أقرب مايكون العبد إلى الله وهو ساجد باكِ. وقال (عليه السلام) في صحيح اَّخر: سجدة الشكر واجبة على كل مسلم تتم بها صلواتك وترضي بها ربّك وتعجب بها الملائكة منك، وإنّ العبد إذا صلّى ثم سجد سجدة الشكر فتح الرب تعالى الحجاب بين العبد وبين الملائكة. فيقول: ياملائكتي انظروا إلى عبدي أدّى فرضي وأتم عهدي ثم سجد لي شكراً على ما أنعمت به عليه. ملائكتي ماذا له ؟ قال: فتقول الملائكة: يا ربنا رحمتك. ثم يقول الرب تبارك وتعالى: ماذا له ؟ فتقول الملائكة: ياربنا جنّتك. فيقول الرب تبارك وتعالى: ماذا ؟ فتقول الملائكة: ياربنا كفاية مهمة. فيقول الرب تبارك وتعالى: ماذا له ؟ قال: فلايبقى شي من الخير إِلاّ قالته الملائكة. فيقول الله تبارك وتعالى: ياملائكتي ثم ماذا ؟ فتقول الملائكة: ياربنا لا علم لنا. قال: فيقول الله تبارك وتعالى: أشكر له كما شكر لي وأقبل إليه بفضلي وأريه رحمتي العظيمة في يوم القيامة.\n\n'
                      'وبسند صحيح عن الصادق (عليه السلام) قال: إنما اتخذ الله إبراهيم خليلاً، لكثرة سجوده على الارض. وقال فى حديث معتبر آخر: إذا ذكرت نعمة من نعم الله تعالى وكنت حيث لايراك من المخالفين أحد فضع خدّك على الارض وإن كنت تتقي منهم وكنت بمرأى منهم فاركع تواضعا لله تعالى واضعا يدك حدر بطنك تفعل ذلك لكي يظن المخالف إنك امتعضت. وفي روايات عديدة: أنّه أوحى الله عزَّ وجلَّ إلى موسى (عليه السلام): أتدري لم اصطفيتك لكلامي دون خلقي ؟ فقال موسى (عليه السلام): لا يارب. فقال:\n\n'
                      'ياموسى إني قلّبت عبادي ظهراً لبطن، فلم أجد فيهم أحداً أذلّ لي منك ياموسى إنك إذا صليت وضعت خديك على التراب.\n\n'
                      'وبسند موثق عن الرضا (عليه السلام) قال: السجدة بعد الصلاة المكتوبة شكر لله على توفيقه عبده لاداء فرضه، وأدنى مايقال في هذه السجدة: شكراً لله ثلاثاً. فسأل الراوي مامعنى شكراً لله ؟ فأجاب (عليه السلام): إنّ معناه أنّ هذه السجدة هي شكر منّي لله تعالى على أن وفقني لان قمت بخدمته وأدّيت فرضه، وشكر الله يوجب زيادة النعمة وتوفيق الطاعة، وإذا كان قد بقي في الصلاة تقصير ولم تتم بالنوافل أتمّتها هذه السجدة.\n\n'
                      'وصفة هذه السجدة: إنّها لايشترط فيها شرط فتصح كيفما أتي بها والاحوط أن تكون السجدة على الارض وأن تسجد على المواضع السبعة كما تفعل في الصلاة وأن تضع جبهتك على ما يصحّ السجود عليه في الصلاة والافضل أن تلصق ساعديك وبطنك بالارض عكس ماتعمل في الصلاة وسنة فيها أن تضع جبهتك أولاً على الارض ثم خدّك الايمن ثم الايسر ثم تعود إلى السجود فتضع جبهتك على الارض ثانيا ولاجل ذلك يقال سجدتا الشكر، وتصح السجدة على الظاهر إذا خلت من أي دعاء او ذكر ولكن المسنون أن لاتخلو من شي منهما.\n\n'
                      'والاحسن ان يختار مايقوله فيها مما سيأتي من الاذكار والادعية. ويستحب إطالة هذا السجود كما روي عن الكاظم (عليه السلام) أنّه كان يظلّ ساجداً من بعد طلوع الفجر إلى الزوال ومن بعد العصر إلى المساء. وفي حديث آخر: إنه كانت له (عليه السلام) بضع عشرة سنة كل يوم يسجد بعد ابيضاض الشمس إلى وقت الزوال. وروي بسند صحيح أن الرضا (عليه السلام) كان يطيل سجوده حتى يبتل حصى المسجد من عرقه، وكان يلصق خديه بالمسجد. وفي كتاب (الرجال) للكشّي: إن الفضل بن شاذان قال: دخلت على محمد بن أبي عمير وهو ساجد فأطال السجود فلما رفع رأسه وذكر له طول سجوده قال: كيف لو رأيت سجود جميل بن درّاج. ثم حدّث أنّه دخل على جميل بن درّاج فوجده ساجداً فأطال السجود جداً فلما رفع راسه قال له محمد بن أبي عمير: أطلت السجود فقال: فكيف لو رأيت سجود معروف بن خرّبوذ ؟ وروي أيضاً عن الفضل بن شاذان قال: إن حسن بن علي بن فضال كان يخرج إلى الصحراء للعبادة فيسجد السجدة فتجي الطير فتقع عليه فما يظنّ إِلاّ أنّه ثوب أو خرقة وإنّ الوحوش لترعى حوله فلاتنفر منه لما قد اَّنست به. وروي أيضاً أن علي بن مهرياز كان إذا طلعت الشمس أهوى إلى السجود فلا يرفع راسه إِلاّ إذا دعا لالف من إخوانه المؤمنين بمثل ما يدعو به لنفسه، وكان على جبينه ثفنة كثفنة البعير من طول السجود. وروي أيضاً أن ابن أبي عمير يسجد بعد صلاة الصبح فلا يرفع رأسه إِلاّ عند الظهر.\n\n'
                      'والافضل أن تكون سجدة الشكر عقيب التعقيبات وقبل النوافل. وأما لصلاة المغرب فمذهب الاكثر تأخيرها عن النوافل أيضا، ومذهب البعض تقديمها عليها، والعمل بأيهما كان فهو حسن، ولكن تقديمها على النوافل أفضل كما رواه الحميري عن الحجّة المنتظر عجل الله تعالى فرجه، ولعل العمل بهما معا هو الاحسن.',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: 'وما يدعى به في هذه السجدة كثير وأيسره مايلي :\n\n'
                      'الأول :',
                  subtitle:
                      'روي بسند معتبر عن الرضا (عليه السلام): أنك إذا شئت فقل مائة مرة: شُكراً شُكراً، وإن شئت فقل مائة مرة:\n\n'
                      'عَفْوا عَفْوا. وفي كتاب (عيون أخبار الرضا ع) عن رجاء بن أبي الضحّاك: إنّ الرضا (عليه السلام) في طريقه إلى خراسان كان يسجد بعد الفراغ من تعقيب العصر سجدة يقول فيها مائة مرة: حَمْداً لله.',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: 'الثاني :',
                  subtitle:
                      'روى الكليني بسند معتبر عن الصادق (عليه السلام): أن أقرب مايكون العبد إلى الله هو ما إذا كان ساجداً يدعو ربه فإذا سجدت فقل: يارَبَّ الارْبابِ وَيامَلِكَ المُلُوكِ وَياسَيِّدَ السّاداتِ وَياجَبّارِ الجَبابِرَةِ وياإلهِ الالِهَةِ صَلِّ عَلى مُحَمَّدٍ وَآل مُحَمَّدٍ. ثم سل حاجتك. ثم قل: فَإنّي عَبْدُكَ ناصِيَتي في قَبْضَتِكَ. ثم ادعُ الله فإنَّه غفار للذنوب ولايستعصي عليه مسألة.',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: 'الثالث :',
                  subtitle:
                      'روى الكليني بسند موثوق عن الصادق (عليه السلام) قال: رأيت أبي ذات ليلة في المسجد ساجداً فسمعت حنينه وهو يقول: سُبْحانَكَ اللَّهُمَّ أنْتَ رَبّي حَقّا حَقّا سَجَدْتُ لَكَ يارَبِّ تَعَبُّداً وَرِقَّا، اللَّهُمَّ إنَّ عَمَلي ضَعيفٌ فَضاعِفْهُ لي، اللَّهُمَّ قِني عَذابَكَ يَوْمَ تَبْعَثُ عِبادَكَ وَتُبْ عَليّ إنَّكَ أنْتَ التَوّابُ الرَّحيمُ.',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: 'الرابع :',
                  subtitle:
                      'روى الكليني أيضاً بسند معتبر: أن الإمام موسى بن جعفر (عليهما السلام) كان يقول في سجوده: أعُوذُ بِكَ مِنَ نارٍ حَرُّها لايُطْفى وَأعوذُ بِكَ مِنْ نارٍ جَديدُها لايُبْلى وَأعوذُ بِكَ مِنْ نارٍ عَطْشانُها لايُرْوى وأعُوذُ بِكَ مِنْ نارٍ مَسْلُوبُها لايُكْسى.',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: 'الخامس :',
                  subtitle:
                      'روى الكليني أيضاً بسند معتبر أنّه شكا رجل إلى الصادق (عليه السلام) علّة كانت بأمّ ولدٍ يملكها فقال (عليه السلام): قل في سجدة الشكر بعد كل فريضة: يارَؤوفُ يارَحيمُ يارَبِّ ياسَيّدي. ثم سل حاجتك.',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: 'السادس :',
                  subtitle:
                      'روي بأسناد عديدة معتبرة: إن الصادق والكاظم (عليهما السلام) كانا يكثران في سجدة الشكر من قول: أَسْأَلُكَ الرَّاحَةَ عِنْدَ المُوتِ وَالعَفْوَ عِنْدَ الحِسابِ.',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: 'السابع :',
                  subtitle:
                      'روي بسند صحيح: أن الصادق (عليه السلام) كان يقول في سجوده: سَجَدَ وَجْهي اللَّئيمُ لِوَجْهِ رَبّي الكَريمِ.',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: 'الثامن :',
                  subtitle:
                      'في بعض الكتب المعتبرة عن أمير المؤمنين (عليه السلام) قال: أحب الكلام إلى الله تعالى أن يقول العبد وهو ساجد: إِنِّي ظَلَمْتُ نَفْسي فَاغْفِرْ لي ثلاثاً.',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: 'التاسع :',
                  subtitle:
                      'روي في (الجعفريات) بسند صحيح عن الصادق (عليه السلام) قال: إن رسول الله (صلّى الله عليه وآله وسلم) كان يقول إذا وضع وجهه للسجود: اللَّهُمَّ مَغْفِرَتُكَ أوْسَعُ مِنْ ذَنُوبي وَرَحْمَتُكَ أرْجى عِنْدي مِنْ عَمَلي فَاغْفِرْ لي ذَنُوبِي ياحَيّا لايَموتُ.',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: 'العاشر :',
                  subtitle:
                      'روى القطب الراوندي عن الصادق (عليه السلام) قال: إذا عرضتك شدة أو غم وتفاقمت فاسجد على الارض وقل: يامُذِلَّ كَلِّ جَبّارٍ يامُعِزَّ كُلِّ ذَليلٍ قَدْ وَحَقِّكَ بَلَغَ مَجْهودي فصَلِّ عَلى مُحَمَّدٍ وَآل مُحَمَّدٍ وَفَرّجْ عَنِّي. وفي عدة الداعي عنه (عليه السلام) قال: إذا نزل برجل نازلة أو شديدة أو كرب فليكشف عن ركبتيه وذراعيه إلى مرفقيه ويلصقها بالارض وليلصق جؤجؤه بالارض ثم ليدع بحاجته.',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: 'الحادي عشر :',
                  subtitle:
                      'روى ابن بابويه بسند معتبر عن الصادق (عليه السلام) قال: إذا قال العبد وهو ساجد: ياالله يارَبَّاهُ ياسيِّداهُ ثلاث مرات، أجابه تبارك وتعالى: لبيك عبدي سل حاجتك. وفي كتاب (مكارم الاخلاق): إن العبد إذا سجد فقال: يارَبّاهُ ياسَيّداهُ حتى ينقطع نفسه، قال له الرب تبارك وتعالى: لبيك ماحاجتك.',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: 'الثاني عشر :',
                  subtitle:
                      'في (مكارم الاخلاق) عن الصادق (عليه السلام): إن النبي (صلّى الله عليه وآله وسلم) مر برجل ساجد وهو يقول في سجوده: يارَبِّ ماذا عَلَيكَ أنْ تُرْضيَ عَنِّي كُلَّ مَنْ كانَ لَهُ عِنْدي تَبِعَةٌ وَأنْ تَغْفِرَ لي ذُنُوبي وَأنْ تُدْخِلَني الجَنَّةَ بِرَحْمَتِكَ ؟ فإنَّما عَفْوُكَ عَنْ الظّالِمينَ وَأنا مِنَ الظّالِمينَ فَلْتَسَعْنِي رَحْمَتُكَ ياأرْحَمَ الرّاحِمينَ.\n\n'
                      'فقال له النبي (صلّى الله عليه وآله وسلم) إرفع راسك فقد استجيب لك فإنّك قد دعوت بدعاء نبي عاش في قوم عاد. أقول: قد أوردنا دعوات يدعى بها في السجود في ضمن أعمال جامع الكوفة ومسجد زيد من كتاب (مفاتيح الجنان).\n\n'
                      'وقال الطوسي في كتاب (مصباح المتهجد) عند ذكر سجدة الشكر: ويستحب أن يدعو لاخوانه المؤمنين في السجود فيقول: اللَّهُمَّ رَبَّ الفَجْرِ وَاللّيالي العَشْرِ وَالشَفْعِ وَالوَتْرِ وَاللّيلِ إذا يَسْرِ وَرَبِّ كُلَّ شَيٍ وَمَلِكَ كُلِّ شَيٍ صَلِّ عَلى مُحَمَّدٍ وَآلِهِ وافْعَلْ بي وَبِفُلانٍ وَفُلانٍ ماأنْتَ أهْلُهُ وَلاتَفْعَلْ بِنا مانَحْنُ أهْلَهُ فإنَّكَ أهْلُ التَّقْوى وَأهْلِ المَغْفِرَةِ. فإذا رفعت رأسك من السجود مسحت بيدك على موضع السجود فمررت بها على وجهك تمسح بها جانب وجهك الايمن ثم جبهتك ثم جانب وجهك الايسر ثلاث مرات وتقول في كل مرة: اللَّهُمَّ لَكَ الحَمْدُ لا إلهَ إِلاّ أنْتَ عالِمُ الغَيبِ والشَّهادَةِ الرَّحْمنُ الرَّحيمِ، اللَّهُمَّ أذْهِبْ عَنّي الهَمَّ وَالحُزْنَ وَالغِيَرَ وَالفِتَنَ ماظَهَرَ مِنْها وَمابَطِنَ.',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
            ],
          ),
        ),
        bottomNavigationBar: AddCustomBottomNavigationBar(
          pushNext: FiNozorMemaYo3malFiAlnaharMabainaTolou3AlshamesW8roubaha.screenRoute,
          pushBack: Alta3kibatAl3amaa.screenRoute,
          soud: '',
          onTap: (double fontSize) {
            // تحديث حجم الخط
            setState(() {
              isTablet ? _fontSizeTablet = fontSize : _fontSize = fontSize;
            });
            print('fontSize: $fontSize');
            // إغلاق Dialog
            Navigator.of(context).pop();
          },
          onLongPress: () {
            final snackBar = SnackBar(
              content: Center(
                child: Text(
                  '${isTablet ? _fontSizeTablet.toInt() : _fontSize.toInt()}',
                  style: TextStyle(
                    color: Colors.white,
                    fontSize: 16,
                  ),
                ),
              ),
              width: 60,
              behavior: SnackBarBehavior.floating,
              backgroundColor: Colors.blue,
              duration: Duration(seconds: 2),
              shape: ShapeBorder.lerp(
                RoundedRectangleBorder(
                  borderRadius: BorderRadius.circular(50),
                ),
                RoundedRectangleBorder(
                  borderRadius: BorderRadius.circular(50),
                ),
                1,
              ),
            );
            ScaffoldMessenger.of(context).showSnackBar(snackBar);
          },
        ),
      ),
    );
  }
}
