import 'package:flutter/material.dart';
import 'package:maktabat_almoslim/widgets/container_scrollview.dart';
import 'package:provider/provider.dart';
import 'package:shared_preferences/shared_preferences.dart';

import '../../../widgets/add_custom_bottom_navigation_bar.dart';
import '../../../widgets/list_of_nine_verses.dart';
import '../../favorites_provider.dart';
import '../../favorites_screen.dart';
import '../nozor_men_a3mal_allail_walnahar.dart';
import 'alta3kibat_al5asa_bfaridat_alsob7.dart';
import 'fima_yata3alak_bel8odat.dart';

class Alta3kibatAl3amaa extends StatefulWidget {
  static String screenRoute = 'alta3kibat_al3amaa_screen';
  const Alta3kibatAl3amaa({super.key});

  @override
  State<Alta3kibatAl3amaa> createState() => _Alta3kibatAl3amaaState();
}

double _fontSize = 18;
double _fontSizeTablet = 30;

class _Alta3kibatAl3amaaState extends State<Alta3kibatAl3amaa> {
  bool isIcon = true;
  @override
  void initState() {
    super.initState();
    _loadFavoriteState();
  }

  Future<void> _loadFavoriteState() async {
    final prefs = await SharedPreferences.getInstance();
    bool? savedState = prefs.getBool('isFavorite_alta3kibat_al3amaa_screen');
    setState(() {
      isIcon = savedState ?? true;
    });
  }

  Future<void> _saveFavoriteState(bool value) async {
    final prefs = await SharedPreferences.getInstance();
    await prefs.setBool('isFavorite_alta3kibat_al3amaa_screen', value);
  }

  Future<bool> _onWillPop() async {
    final args =
        ModalRoute.of(context)!.settings.arguments as Map<String, dynamic>?;
    final previousPage = args?['previousPage'];
    if (previousPage == 'favorite_screen') {
      Navigator.of(context).pushReplacementNamed(FavoritesScreen.screenRoute);
      return false;
    } else {
      Navigator.of(context)
          .pushReplacementNamed(NozorMenA3malAllailWalnahar.screenRoute);
      return false;
    }
  }

  @override
  Widget build(BuildContext context) {
    double size = MediaQuery.of(context).textScaleFactor;
    final screenWidth = MediaQuery.of(context).size.width;
    final isTablet = screenWidth >= 600;
    return WillPopScope(
      onWillPop: _onWillPop,
      child: Scaffold(
        appBar: AppBar(
          toolbarHeight: isTablet ? 100 : 50,
          centerTitle: true,
          leading: IconButton(
            onPressed: _onWillPop,
            icon: Icon(
              Icons.arrow_back,
              size: isTablet ? 50 : 25,
            ),
          ),
          actions: [
            IconButton(
              padding: EdgeInsets.only(left: isTablet ? 50 : 30),
              icon: Icon(
                isIcon ? Icons.favorite_border : Icons.favorite_rounded,
                size: isTablet ? 40 : 25,
                color: isIcon ? Colors.black : Colors.red,
              ),
              onPressed: () async {
                setState(() {
                  isIcon = !isIcon;
                });
                await _saveFavoriteState(isIcon);

                if (!isIcon) {
                  Provider.of<FavoritesProvider>(context, listen: false)
                      .addFavorite(
                          'التعقيبات العامة', Alta3kibatAl3amaa.screenRoute);
                } else {
                  Provider.of<FavoritesProvider>(context, listen: false)
                      .removeFavorite(
                          'التعقيبات العامة',
                          Alta3kibatAl3amaa.screenRoute,
                          Alta3kibatAl3amaa.screenRoute);
                }
              },
            ),
          ],
          title: Text(
            'التعقيبات العامة',
            style: TextStyle(
              fontSize: isTablet
                  ? 40
                  : size > 1.0
                      ? 20
                      : 23,
              fontWeight: FontWeight.bold,
            ),
          ),
        ),
        body: ContainerScrollview(
          widget: Column(
            crossAxisAlignment: CrossAxisAlignment.start,
            children: [
              Container(
                child: Column(
                  children: [
                    Center(
                      child: Text(
                        'بسم الله الرحمن الرحيم',
                        style: TextStyle(
                          fontSize: isTablet ? _fontSizeTablet : _fontSize,
                          fontWeight: FontWeight.w900,
                        ),
                      ),
                    ),
                    Center(
                      child: Text(
                        'اللهم صلِّ على محمد وآل محمد',
                        style: TextStyle(
                          fontSize: isTablet ? _fontSizeTablet : _fontSize,
                          fontWeight: FontWeight.w900,
                        ),
                      ),
                    ),
                  ],
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: '',
                  subtitle:
                      'وهي مايعقب بها عامّة الصلوات فلاتخص صلاة خاصّة، وهي كثيرة ونكتفي بإيراد جملة منها :',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: 'الأول :',
                  subtitle:
                      'تسبيح فاطمة الزهراء (عليها السلام)، والاحاديث المأثورة في فضل هذا التسبيح تفوق حد الاحصاء.\n\n'
                      'وعن الصادق (عليه السلام) أنّه قال: إنا نأمر صبياننا بتسبيح فاطمة الزهراء (عليه السلام) كما نأمرهم بالصلاة فالزمه فإنّه لم يلزمه عبد فشقي.\n\n'
                      'وقد أتى في الروايات المعتبرة أنّ الذكر الكثير المأمور به في الكتاب العزيز هو هذا التسبيح ومن واظب عليه بعد الصلوات فقد ذكر الله ذكراً كَثِيراً وعمل بهذه الآية الكريمة: واذْكُروا الله ذِكْراً كَثِيراً.\n\n'
                      'وبسند معتبر عن الباقر (عليه السلام) أنّه قال: من سبّح تسبيح فاطمة سلام الله عليها ثم استغفر الله غفر الله له وهو مائة على اللّسان وألف في الميزان ويطرد الشيطان ويرضي الرب.\n\n'
                      'وبأسناد صحاح عن الصادق (عليه السلام) أنّه قال: من سبح بتسبيح فاطمة (عليها السلام) قبل أن يثني رجليه من صلاة الفريضة غفر له ووجبت له الجنة.\n\n'
                      'وفي سندٍ معتبر آخر عنه (عليه السلام) أنّه قال: تسبيح الزهراء فاطمة (عليها السلام) في دبر كل فريضة أحب إليّ من صلاة ألف ركعة في كل يوم.\n\n'
                      'وفي رواية معتبرة عن الباقر (عليه السلام) قال: ما عبد الله بشي من التسبيح والتمجيد أفضل من تسبيح فاطمة (عليها السلام) ولو كان شي افضل منه لاعطاه النبي (صلّى الله عليه وآله وسلم) فاطمة (عليها السلام) والاحاديث في فضل ذلك أكثر من أن تستوعبها هذه الرسالة.\n\n'
                      'وفي وصف هذا التسبيح: فقد اختلفت الروايات وهو على الاشهر والاظهر: أربع وثلاثون مرة: الله أكْبَرُ، وثلاث وثلاثون مرة: الحَمْدُ لله ، وثلاث وثلاثون مرة: سُبْحانَ اللّهِ. وذكر سبحان الله قد أتى في بعض الاحاديث مقدما على الحمد للّه. وقد جمع بين هذه الرويات بعض العلماء فراي أن يؤتى بالتسبيحات على الطريقة الأولى في أعقاب الصلوات وعلى الطريقة الثانية عند النوم، والعمل على الطريقة الأولى المشهورة هو الأولي على الظاهر سواء عند النوم، أو عقيب الصلوات.\n\n'
                      'ومن المسنون أن يهلل بعد التسبيحات قائلاً: لا إِلهَ إِلاّ اللّه. فعن الصادق (عليه السلام) أنّه قال: من سبح بعد كل فريضة بتسبيح فاطمة (عليها سلام اللّه) وعقبه بلا اله إِلاّ الله غفر الله له. والافضل أن يحصي عدد التسبيحات بسبحة مصنوعة من تربة الحسين (عليه السلام) وهو سنّة في جميع الاذكار.\n\n'
                      'ويستحب للمرء أيضاً أن يحمل معه سبحة من تراب الحسين (عليه السلام) وهي حرز من البلايا ومورثة لمثوبات غير متناهية.\n\n'
                      'وروي أن فاطمة (عليها السلام) كانت سبحتها من خيط صوف مفتل معقود عليه، فكانت تديرها بيدها تكبّر وتسبح إلى أن قتل حمزة بن عبد المطلب (رضي الله تعالى عنه) فاستعملت تربته وعملت التسابيح فاستعملها الناس، فلما قتل الحسين سيّد الشهداء (عليه السلام) عدل بالأمر إليه فاستعملوا تربته. وعن الإمام المنتظر (عليه السلام) قال: من نسي الذكر وفي يده سبحة من تربة الحسين (عليه السلام) كتب له أجره.\n\n'
                      'وعن الصادق (عليه السلام): السبحة التي من قبر الحسين (عليه السلام) تسبح بيد الرجل من غير أن يُسبّح. وقال: من أدار الحجر من تربة الحسين (عليه السلام) فاستغفر به مرّة واحدة كتب الله له سبعين مرة، وإن أمسك السبحة بيده ولم يسبّح بها ففي كلّ حبّة منها سبع مرات.\n\n'
                      'وعلى رواية أخرى: إن أدارها مع الذكر كتب له بكل حبّة أربعون حسنة. وروي أن الحور العين إذا أبصرن بواحد من الاملاك يهبط إلى الارض لأمر ما، يستهدين منه السبح والترب من طين قبر الحسين (عليه السلام).\n\n'
                      'وفي الصحيح عن الإمام موسى (عليه السلام) قال: لايخلو المؤمن من خمسة: سواك، ومشط، وسجّادة، وسبحة فيها أربع وثلاثون حبّة وخاتم عقيق.\n\n'
                      'والظاهر أن للسبحة من الخزف أيضاً فضل، ولكنّها من الطين الذي لايمسّه النار أحسن. وعن الصادق (عليه السلام) قال: من سبح بسبحة من طين قبر الحسين (عليه السلام) تسبيحة كتب الله له أربعمائة حسنة ومحا عنه أربعمائة سيئة وقضيت له أربعمائة حاجة ورفعت له أربعمائة درجة. وروي استحباب أن يكون لون خيطها أزرق. ويستفاد من بعض الروايات أن الافضل للنساء أن يعقدن بالانامل، ولكن الاحاديث الدّاله على استحباب العقد بالتربة مطلقا هي الاكثر والاقوى.',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: 'الثاني :',
                  subtitle:
                      'يستحب أن يكبر بعد الفريضة ثلاثا يرفع عند كل تكبيرة يديه إلى حيال وجهه ثم ينزلهما إلى ركبتيه أو قريبا منهما. كما روى علي بن طاووس وابن بابويه بأسناد معتبرة عن المفضّل بن عمر قال: قلت للصادق (عليه السلام) لاي علة يكبّر المصلّي بعد التسليم ثلاثاً يرفع بها يديه ؟ فقال (عليه السلام): لان النبي (صلّى الله عليه وآله وسلم) لمّا فتح مكة صلّى بأصحابه الظهر عند الحجر الاسود فلما سلّم رفع يديه وكبّر ثلاثا وقال: لا إلهَ إِلاّ الله وَحْدَهُ وَحْدَهُ وَحْدَهُ أنْجَزَ وَعْدَهُ وَنَصَرَ عَبْدَهُ وَأعَزَّ جُنْدَهُ وَغَلَبَ الاَحزابَ وَحْدَهُ، فَلَهُ المُلْكَ وَلَهُ الحَمْدُ يُحْيي وَيُميتُ وَهُوَ عَلى كُلِّ شَيٍ قَديرٌ.\n\n'
                      'ثم أقبل على أصحابه فقال: لا تدعوا هذا التكبير وهذا القول في دبر كل صلاة مكتوبة فإن من فعل ذلك بعد التسليم وقال هذا القول كان قد أدّى مايجب عليه من شكر الله تعالى ذكره على تقوية الاسلام وجنده. وفي الصحيح عن الصادق (صلوات الله وسلامه عليه) أنه كان إذا فرغ من الصلاة يرفع يديه فوق رأسه ويدعو. وعن الإمام محمّد الباقر(صلوات الله وسلامه عليه) أنه قال: إذا رفع العبد كفّه إلى الله تعالى استحى الله أن يردّها خالية فإذا دعوتم فلا تضعوا أيديكم إلا وتمسحون بها وجوهكم.',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: 'الثالث :',
                  subtitle:
                      'روى الكليني بسند معتبر عن الباقر (عليه السلام) أنه قال: من دعا بهذا الدعاء ثلاث مرات بعد الفريضة قبل أن يحوّل رجليه غفر الله ذنوبه وإن كانت كزبد البحار: أسْتَغْفِرُ الله الَّذِي لا إلهَ إِلاّ هُوَ الحَيُّ القَيّومُ ذُوالجَلالِ وَالاكْرامِ وَأتُوبُ إلَيْهِ. وعلى رواية أخرى أن من استغفر الله في كل يوم بهذا الاستغفار غفر الله له أربعين كبيرة من سيئاته.',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: 'الرابع :',
                  subtitle:
                      'روى الكليني عن الإمام الصادق (عليه السلام) قال: لاتدع أن تقول بعد كل صلاة: أعيذُ نَفْسي وَما رَزَقَني رَبِّي بِالله الواحِدِ الصَمَدِ الَّذِي لَمْ يَلِدْ وَلَمْ يُولَدْ وَلَمْ يَكُنْ لَهُ كُفْوا أحَدٌ، وَأعِيذُ نَفْسي وَمارَزَقَني رَبِّي بِرَبِّ الفَلَقِ مِنْ شَرِّ ماخَلَقَ وَمِنْ شَرِّ غاسِقٍ إِذا وَقَبَ وَمِنْ شَرِّ النَفّاثاتِ في العُقَدِ وَمِنْ شَرِّ حاسِدٍ إذا حَسَدْ، وَأعِيذُ نَفْسي وَمارَزَقَني رَبِّي بِرَبِّ النّاسِ مَلِكِ النّاسِ إلهِ النّاس مِنْ شَرِّ الوِسْواسِ الخَنّاسَ الَّذِي يُوَسْوِسُ في صُدُورِ النّاسِ مِنَ الجِنّةِ وَالنّاسِ.',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: 'الخامس :',
                  subtitle:
                      'روى الكليني في حديث معتبر عن عليّ بن مهزيار قال: كتب محمد بن إبراهيم إلى أبي الحسن النقي ع: إن رأيت ياسيّدي أن تعلّمني دعاء أدعو به في دبر صلاتي يجمع الله لي به خير الدنيا والاخرة فكتب (عليه السلام) تقول:\n\n'
                      'أعُوذ بِوَجْهِكَ الكَريمُ وَعِزَّتِكَ الَّتي لاتُرامُ وَقُدْرَتِكَ الَّتي لايَمْتَنِعُ مِنْها شَيٌ مِنْ شَرِّ الدُّنْيا وَالاخِرَةِ وَمِنْ شَرِّ الاوْجاعِ كُلِّها. وزاد في اَّخره في بعض الروايات: وَلا حَوْلَ وَلاقُوَةَ إِلاّ بِالله العَليّ العَظيمِ.',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: 'السادس :',
                  subtitle:
                      'روى الكليني وابن بابويه بأسناد صحاح وغير صحاح عن الباقر والصادق (عليه السلام): إن أدنى مايجزي من الدعاء بعد المكتوبة أن تقول:\n\n'
                      'اللَّهُمَّ إِنِّي أَسْأَلُكَ مِنْ كُلِّ خَيْرٍ أحاطَ بِهِ عِلْمُكْ وَأعُوذُ بِكَ مِنْ كُلِّ شَرٍّ أحاطَ بِهِ عِلْمُكَ، اللَّهُمَّ إِنِّي أَسْأَلُكَ عافِيَتِكَ في أُموري كُلِّها وَأعوذُ بِكَ مِنْ خِزْي الدُّنْيا وَعَذابِ الاخِرَةِ. وعلى رواية ابن بابويه: اللَّهُمَّ صَلِّ عَلى مُحَمَّدٍ وَآل مُحَمَّدٍ، اللَّهُمَّ إِنِّي أَسْأَلُكَ… إلى اَّخر الدعاء.',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: 'السابع :',
                  subtitle:
                      'من المسنون أن يقول إذا فرغ من الصلاة: اللَّهُمَّ صَلِّ عَلى مُحَمَّدٍ وَآل مُحَمَّدٍ وَأجِرْني مِنَ النّارِ وَأدْخِلْني الجَنَّةَ وَزَوجْني الحُورَ العينَ. كما في الحديث المعتبر عن أمير المؤمنين (عليه السلام) قال: لايفتل العبد من صلاته حتى يسأل الله الجنة ويستجير به من النار ويسأله أن يزوّجه من الحور العين.',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: 'الثامن :',
                  subtitle:
                      'بسند موثق عن الصادق (عليه السلام) أنه قال: لما أمر الله عزَّ وجلَّ هذه الايات أن يهبطن إلى الارض تعلّقن بالعرش وقلن أي رب إلى أين تهبطنا إلى اهل الخطايا والذنوب ؟ فأوحى الله عزَّ وجلَّ إليهنّ أن اهبطن، فوعزتي وجلالي لايتلوكنَّ أحد من آل محمد وشيعتهم إِلاّ نظرت إليه بعيني المكنونة في كل يوم سبعين نظرة أقضي له في كل نظرة سبعين حاجة وقبلته على مافيه من المعاصي. وقال على رواية أخرى من تلاها عقيب كل صلاة اسكنته حظيرة قدسي على مافيه من المعاصي، وإن لم أصنع ذلك نظرت إليه نظرتي الخاصة في كل يوم سبعين نظرة، وإن لم أصنع قضيت له في كل يوم سبعين حاجة أدناها غفران الذنوب، وإن لم أصنع عوّذته من الشيطان ومن كل عدو ونصرته عليهم ولم يمنعه من دخول الجنة مانع سوى الموت. وهذه الايات هي: سورة الفاتحة إلى اَّخرها، وآية الكرسي وقراءتها إلى: هم فيها خالدون أحسن، وآية الشهادة وهي: شَهِدَ الله أَنَّهُ لا إِلهَ إِلاّ هُوَ وَالمَلائِكَةُ وَأولوا العِلْمِ قائِما بِالقِسْطِ لا إِلهَ إِلاّ هُوَ العَزيزُ الحَكيمُ إنَّ الدّينَ عِنْدَ الله الاسْلامُ وَمااخْتَلَفَ الَّذينَ أُوتوا الكِتابَ إِلاّ مِنْ بَعْدِ ماجأَهُمْ العِلْمُ بَغْيا بَيْنَهُمْ وَمَنْ يَكْفُرْ بِآياتِ الله فِإنَ الله سَريعُ الحِسابِ. وآية الملك وهي: قُلْ اللَّهُمَّ مالِكَ المُلْكِ تؤتي المُلْكَ مَنْ تَشاءُ وَتَنْزِعُ المُلْكَ مِمّنْ تَشاءُ وَتُعِزّ مِنْ تَشاءُ وَتُذِلّ مَنْ تَشاءُ بِيَدِكَ الخَيْرُ إِنَّكَ عَلى كُلِّ شَيٍ قَديرٌ تُولِجُ اللّيْلَ في النَّهارِ وَتُولِجُ النَّهارَ في اللَّيْلِ وَتُخْرِجُ الحَيَّ مِنَ المَيِّتِ وَتُخْرجُ المَيِّتَ مِنَ الحَيّ وَتَرْزِقُ مَنْ تَشاءُ بِغَيْرِ حِسابٍ.\n\n'
                      'وبسند معتبر عن موسى بن جعفر (عليه السلام) قال: من قرأ آية الكرسي دبر كل صلاة لم يضره ذو حمة. وقال (عليه السلام) في رواية معتبرة أخرى قال رسول الله (صلّى الله عليه وآله وسلم): ياعلي عليك بتلاوة آية الكرسي دبر كل صلاة مكتوبة فإنّه لايتحافظ عليها إِلاّ نبي أو صدّيق أو شهيد.\n\n'
                      'وعن النبي (صلّى الله عليه وآله وسلم) قال: من تلا آية الكرسي دبر كل صلاة فليس له مانع من دخول الجنّة سوى الموت.\n\n'
                      'وعلى رواية أخرى: من تلاها بعد كل فريضة قبلت صلاته وكان في أمان الله وصانه الله من البلايا والذنوب.',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: 'التاسع :',
                  subtitle:
                      'روى الكليني وابن بابويه وغيرهما بأسناد معتبرة عن محمّد الباقر (عليه السلام) قال: أتى رجل النبي (صلّى الله عليه وآله وسلم) يقال له شيبة الهذلي فقال: يارسول الله (صلّى الله عليه وآله وسلم) إني شيخ قد كبرت سنّي وضعفتْ قوتي عن عمل كنت قد عوّدته نفسي من صلاة وصيام وحجّ وجهاد. فعلّمني يارسول الله كلاما ينفعني الله به وخفّف عليّ يارسول اللّه. فقال: أعدها فأعادها ثلاث مرات فقال رسول الله (صلّى الله عليه وآله وسلم): ماحولك شجرة ولامدرة إِلاّ وقد بكت من رحمتك فإذا صليت الصبح فقل عشر مرات:\n\n'
                      'سُبْحانَ اللهِ العَظيمِ وَبِحَمْدِهِ وَلاحَوْلَ وَلا قُوَّةَ إِلاّ بِالله العَلي العَظيمِ فإن الله عزَّ وجلَّ يعافيك بذلك من العمى والجنون والجذام والفقر والهرم. فقال: يارسول الله (صلّى الله عليه وآله وسلم) هذا للدنيا فما للاخرة. فقال: تقول في دبر كل صلاة:\n\n'
                      'اللَّهُمَّ اهْدِني مِنْ عِنْدِكَ وَأفِضِ عَليّ مِنْ فَضْلِكَ وَأنْشُرْ عَليَّ مِنْ رَحْمَتِكَ وَأنْزِلْ عَليَّ مِنْ بَرَكاتِكَ. فقال النبي (صلّى الله عليه وآله وسلم): أما أنّه إن وافى بها يوم القيامة لم يدعها متعمداً فتحت له ثمانية أبواب الجنّة يدخلها من أيها شاء. والدعاء يختلف عن هذا الدعاء على رواية أخرى مروية أيضاً بأسناد معتبرة.',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: 'العاشر :',
                  subtitle:
                      'أن يسبّح بالتسبيحات الاربعة كما روى الطوسي وابن بابويه والحميري بأسناد صحيحة عن الصادق (عليه السلام) قال: قال رسول الله (صلّى الله عليه وآله وسلم) لاصحابه ذات يوم: أترون لو جمعتم ماعندكم من الانية والمتاع، أكنتم ترونه يبلغ السماء قالوا: لا يارسول الله ، قال: أفلا أدلّكم على شي أصله في الارض وفرعه في السماء. قالوا: بلى يارسول اللّه.\n\n'
                      'قال: يقول أحدكم إذا فرغ من الصلاة: سُبْحانَ الله وَالحَمْدُ لله وَلا إِلهَ إِلاّ الله وَالله أكْبَرُ. ثلاثين مرة فإن أصلهنَّ في الارض وفرعهن في السماء، وهنّ يدفعن الحرق والغرق والهدم والتردي في البئر وافتراس السباع وميتة السوء وما ينزل في ذلك اليوم من السماء، وهنّ الباقيات الصالحات المذكورة في القرآن. وبأسناد أُخر صحيحة عن الصادق (عليه السلام) قال: مَنْ سبّح بهذه التسبيحات عقيب كل فريضة أربعين مرة قبل أن يتحول من مصلاه قضي له ماسأل.\n\n'
                      'وفي صحيح آخر عن الصادق (عليه السلام): أنّ من قال دبر الفريضة: سُبْحانَ الله ثلاثين مرة مابقي عليه ذنب إِلاّ وتساقط. وعنه (صلّى الله عليه وآله وسلم) في صحيح اَّخر قال: الذكر الكثير الذي مدحه الله تعالى في كلامه المجيد هو أن تقول: سُبْحانَ الله بعد كل فريضة ثلاثين مرة. روى القطب الراوندي أنه: قال أمير المؤمنين (عليه السلام) للبراء بن عازب: ألا أدلّك على أمر إذا فعلته كنت ولي الله حقا ؟ قلت بلى. قال: تسبّح الله في دبر كل صلاة عشراً بالتسبيحات الاربعة. يصرف ذلك عنك ألف بليّة في الدنيا أحدها الردّة عن دينك، ويدخر لك في الاخرة ألف منزلة أحدها مجاورة نبيّك محمد (صلّى الله عليه وآله وسلم).',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: 'الحادي عشر :',
                  subtitle:
                      'عن الكليني عن الصادق (عليه السلام) قال: من قال في دبر الفريضة: يامَنْ يَفْعَلُ مايَشاءُ ولايَفْعَلُ مايَشاءُ أحَدٌ غَيْرَهُ ثلاثا ثم سأل، أعطي ماسأل.',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: 'الثاني عشر :',
                  subtitle:
                      'روى البرقي في الموثق عن الصادق (عليه السلام) قال: من هلّل بعد فراغه من الصلاة قبل أن يزوّل ركبتيه بهذا التهليل عشر مرّات محا الله عنه أربعين ألف ألف سيئة وكتب له أربعين ألف ألف حسنة وكان مثل من قرأ القرآن اثنتي عشرة مرة. ثم التفت إليّ فقال: أما أنا فلا أزوّل ركبتي حتى أقولها مائة مرة وأما أنتم فقولوها عشر مرات: أشْهَدُ أنْ لا إِلهَ إِلاّ الله وَحْدَهُ لا شَريكَ لَهُ إِلها وَاحِداً أحَداً صَمَداً لَمْ يَتَّخِذْ صاحِبَةٍ وَلا وَلَداً. وقد روي لهذا التهليل فضل كثير لاسيّما إذا عقب به صلاة الصبح وصلاة العشاء، وإذا قري عند طلوع الشمس وغروبها.',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: 'الثالث عشر :',
                  subtitle:
                      'روى الكليني وابن بابويه وغيرهما بأسناد صحيحة عن الصادق (عليه السلام) قال: جاء جبرائيل إلى يوسف (عليهما السلام) في السجن وقال: قل في دبر كل صلاة: اللَّهُمَّ اجْعَلْ لِي فَرَجاً وَمَخْرَجاً وَارْزُقْني مِنْ حَيْثُ أحْتَسِبُ وَمِنْ حَيْثُ لا أحْتَسِبُ.',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: 'الرابع عشر :',
                  subtitle:
                      'في كتاب (البلد الامين) عن النبي (صلّى الله عليه وآله وسلم) قال: من أراد أن لايوقفه الله يوم القيامة على قبيح أعماله ولاينشر له ديوان، فليقرأ هذا الدعاء في دبر كل صلاة وهو: اللَّهُمَّ إِنَّ مَغْفِرَتَكَ أرْجى مِنْ عَمَلي وَإِنَّ رَحْمَتَكَ أوْسَعُ مِنْ ذَنْبِي، اللَّهُمَّ إنْ كانَ ذَنْبي عِنْدَكَ عَظِيما فَعَفوُكَ أعْظَمُ مِنْ ذَنْبِي، اللَّهُمَّ إنْ لَمْ أكُنْ أهْلاً أنْ تَرْحَمَني فَرَحْمَتُكَ أهْلٌ أنْ تَبْلُغَني وَتَسَعَني لاَنَّها وَسِعَتْ كُلَّ شَيٍ بِرَحْمتِكَ ياأَرْحَمَ الرّاحِمينَ.',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: 'الخامس عشر :',
                  subtitle:
                      'روى الكفعمي عن النبي (صلّى الله عليه وآله وسلم) أنّ رجلاً شكا إليه العلة والفقر فقال (صلّى الله عليه وآله وسلم): قل في دبر الفرائض:\n\n'
                      'تَوَكَّلْتُ عَلى الحَيُّ الَّذِي لايَموتُ وَالحَمْدُ لله الَّذِي لَمْ يَتَّخِذْ صاحِبَةً وَلا وَلَداً وَلَمْ يَكُنْ لَهُ شَريكٌ في المُلْكِ وَلَمْ يَكُنْ لَهُ وَليُّ مِنَ الذُّلِّ وَكَبِّرْهُ تَكْبيراً.\n\n'
                      'وعلى رواية أخرى قال (صلّى الله عليه وآله وسلم): ماعرضت لي شده إِلاّ وتمثل لي جبرائيل وقال: قل هذه الكلمات. وعلى روايات معتبرة يكرر هذا الدعاء لوساوس الصدور والدين والفاقة، وصُدّر الدعاء في بعض الروايات ب:‍‍ (لا حول ولا قوة إلاّ باللّه).',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: 'السادس عشر :',
                  subtitle:
                      'ورد المفيد في المقنعة هذا الدعاء لتعقيب كل صلاة:\n\n'
                      'اللَّهُمَّ انْفَعْنا بِالعِلْمِ وَزَيِّنَّا بِالحِلْمِ وجَمِّلْنا بِالعافيةِ وَكَرِّمْنا بِالتَقْوى إنَّ وَليّيَ الله الَّذِي نَزَّلَ الكِتابَ وَهُو يَتَولّى الصّالِحينَ.',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: 'السابع عشر :',
                  subtitle:
                      'عن الطوسي وابن بابويه وغيرهما بأسناد معتبرة عن أمير المؤمنين (عليه السلام) قال: من أحبّ أن يخرج من الدنيا وقد خلص من الذنوب كما يخلص الذهب لا كدر فيه، وليس احد يطالبه بمظلمة فليقرأ في دبر الصلوات الخمس نسبة الله عزَّ وجلَّ قُلْ هُوَ الله أَحَد اثنتي عشرة مرة، ثم يبسط يده ويدعو بهذا الدعاء ثم قال (عليه السلام): هذا من المنجيات مما علمني رسول الله (صلّى الله عليه وآله وسلم) وأمرني أن أعلمه الحسن والحسين (عليهما السلام) وهو هذا الدعاء:\n\n'
                      'اللَّهُمَّ إِنِّي أَسْأَلُكَ بِاسْمِكَ المَكْنُونِ المَخْزونِ الطّاهِرِ الطُّهْرِ المُبارَكِ وَأسأَلُكَ بِاسْمِكَ العَظيمُ وَسُلْطانِكَ القَديمُ، ياواهِبَ العَطايا يامُطْلِقَ الاُسارى يافَكّاكَ الرِّقابِ مِنَ النّارِ صَلِّ عَلى مُحَمَّدٍ وَآل مُحَمَّدٍ وَفُكَّ رَقَبَتي مِنَ النّار وَاخْرِجْني مِنَ الدُّنْيا آمِنا وَأدْخِلْني الجَنَّةَ سالِما، وَاجْعَلْ دُعائي أوَّلَهُ فَلاحا وَأوسَطَهُ نَجاحا وَآخِرَهُ صَلاحا إنَّكَ أنْتَ عَلاّمُ الغُيوبِ.\n\n'
                      'والدعاء في بعض النسخ المعتبرة هكذا: يافَكّاكَ الرّقابِ مِنَ النّارِ أسأَلُكَ أنْ تُصَلّي عَلى مُحَمَّدٍ وَآلِ مُحَمَّدٍ وَأنْ تَعْتِقَ رَقَبَتي مِنَ النّارِ وَأنْ تُخْرِجَني مِنَ الدُّنيا سالِما وَتُدْخِلَني الجَنَّةَ آمِنا وَأنْ تَجْعَلْ دُعائي أوَّلَهُ فَلاحا وَأوسَطَهُ نَجاحا وَآخِرَهُ صَلاحا إنَّكَ أنْتَ عَلاّ مُ الغُيوبِ.\n\n'
                      'وروى الكليني بسند معتبر عن الصادق (عليه السلام) أن من اَّمن بالله واليوم الاخر فلايدع تلاوة قل هو الله أحد بعد كل فريضة فان من تلاها جمع الله له خير الدنيا والاخرة وغفر الله له ولوالديه ولمن انحدر عنهما. وفي رواية أخرى: من قرأ التوحيد دبر كل فريضة عشراً، زوّجه الله من الحور العين.\n\n'
                      'وروى السيد ابن طاووس عن النبي (صلّى الله عليه وآله وسلم): أن من تلا سورة التوحيد بعد كل صلاة أمطرت عليه الرحمة من السماء وأنزلت عليه السكينة ونظر الله تعالى إليه نظر الرحمة وغفر له ذنوبه وقضى له ماسأل وكان في أمان اللّه.',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: 'الثامن عشر :',
                  subtitle:
                      'روى الكليني رض وغيره بسند معتبر عن أهل البيت (عليهم السلام): إنّ من قال بعد كل صلاة وهو آخذ بلحيته بيده اليمنى ويده اليسرى مرفوعة بطنها إلى مايلي السماء: ياذا الجَلالِ وَالاكْرامِ ارْحَمْني مِنَ النّار ثلاثا ثم يقول ثلاثا: أجِرْني مِنْ العَذابِ الاليمِ.\n\n'
                      'ثم يؤخر اليمنى عن لحيته ويجعل بطنها ممايلي السماء ثم يقول: ياعَزيزُ ياكَريمُ يارَحْمنُ ياغَفورُ يارَحيمُ، ثلاثا ويقلب يديه ويجعل ظهورهما مما يلي السماء ثم يقول ثلاثا: أجِرْني مِنْ العَذابِ الاليمِ، ثم يقول: وَصَلَّى الله عَلى مُحَمَّدٍ وَآله وَالمَلائِكَةُ وَالرّوحُ ؛ من فعل ذلك غفر الله له ورضي عنه، ووصله جميع الخلائق بالاستغفار حتّي يموت إِلاّ الثقلين الجِنَّ والانس.',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: 'التاسع عشر :',
                  subtitle:
                      'روى المفيد في المجالس عن محمد بن الحنفية قال: بينا أمير المؤمنين (عليه السلام) يطوف بالبيت إذا رجل متعلق بالاستار وهو يدعو بهذا الدعاء، فقال أمير المؤمنين (عليه السلام) هذا دعاؤك ؟ قال له الرجل: وهل سمعته ؟ قال: نعم.\n\n'
                      'قال: فادع به في دبر كل صلاة فوالله مايدعو به أحد من المؤمنين في أدبار الصلاة إِلاّ غفر الله له ذنوبه ولو كانت عدد نجوم السماء وقطرها وحصى الارض وثراها. فقال له أمير المؤمنين (عليه السلام) إنّ علم ذلك عندي والله واسع كريم. فقال له الرجل وهو الخضر (عليه السلام): صدقت والله ياأمير المؤمنين وفوق كل ذي علم عليم. ورواه أيضاً الكفعمي في كتاب (البلد الامين) وهو هذا الدعاء: يامَنْ لايَشْغَلُهُ سَمْعٌ عَنْ سَمْعٍ يامَنْ لايُغَلِّطُهُ السّائِلونَ ويامَنْ لايُبْرِمُهُ إلحاحُ المُلحّينَ أذِقْنِي بَرْدَ عَفْوِكَ وَمَغْفِرَتِكَ وَحَلاوَةَ رَحْمَتَكَ.',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: 'العشرون :',
                  subtitle:
                      'روى الديلمي في كتاب (أعلام الدين) عن ابن عبّاس أنّ رسول الله (صلّى الله عليه وآله وسلم) قال: من قرأ هذه الثلاث آيات ثلاث مرات دبر صلاة المغرب أدرك مافات في يومه ذلك وقبل صلاته، فإن قرأها دبر كل صلاة من فريضة أو تطوع كتب له من الحسنات عدد نجوم السماء وقطر المطر وعدد ورق الشجر وعدد تراب الارض فإذا مات أجرى له بكل حسنة عشر حسنات في قبره، وهي هذه الايات: فَسُبْحانَ الله حينَ تُمْسُونَ وَحينَ تُصبِحُونَ وَلَهُ الحَمْدُ فِي السَّماواتِ وَالارضِ وَعَشِيَّا وَحينَ تُظْهِرُونَ. يُخْرِجُ الحَيَّ مِنَ المَيِّتِ وَيُخْرِجُ المَيِّتَ مِنَ الحَيِّ وَيُحْيي الارضَ بَعْدَ مَوْتِها وَكَذلِكَ تُخْرَجُونَ. سُبْحانَ رَبِّكَ رَبِّ العِزَّةِ عَمّا يَصِفُونَ وَسَلامٌ عَلى المُرسَلينَ وَالحَمْدُ لله رَبِّ العالَمينَ.',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: 'الحادي والعشرون :',
                  subtitle:
                      'روى السيد ابن طاووس بسند معتبر عن جميل ابن دارج قال: دخل رجل على الصادق (عليه السلام) فقال له: ياسيدي علت سني ومات أقاربي وأنا خائف أن يدركني الموت وليس لي من اَّنس به وأرجع إليه. فقال له:\n\n'
                      'إن من إخوانك المؤمنين من هو أقرب نسبا أو سببا وأنسك به خير من أنسك بقريب، وإذا أردت أن يطول عمرك وعمر أقاربك، فعليك بأن تقول عقب كل صلاة: اللَّهُمَّ صَلِّ عَلى مُحَمَّدٍ وَآل مُحَمَّدٍ، اللَّهُمَّ إنَّ رَسُولَكَ الصّادِقَ المُصَدَّقَ صَلَواتُكَ عَلَيهِ وَآلِهِ قالَ: إِنَّكَ قُلْتَ: ماتَرَدَّدْتُ في شَيٍ أنا فاعِلُهُ كَتَردُّدي في قَبْضِ روحِ عَبْديَ المؤمِنِ يَكْرَهُ المَوْتَ وَأكْرَهُ مُسائَتَهُ، اللَّهُمَّ فصَلِّ عَلى مُحَمَّدٍ وَآل مُحَمَّدٍ وَعَجِّلْ لِوَليّكَ الفَرَجَ والعافِيةَ وَالنَصْرَ وَلاتَسؤْني في نَفْسي وَلا في أحَدٍ من أحِبَّتي.\n\n'
                      'وان شئت فسمّ أحبّتك واحداً واحداً فقل: وَلا في فُلانٍ وَلا في فُلانٍ. قال الرجل: والله لقد عشت حتى سئمت الحياة وهذا دعاء في غاية الاعتبار مرويّ في جميع كتب الدّعوات.',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
            ],
          ),
        ),
        bottomNavigationBar: AddCustomBottomNavigationBar(
          pushNext: Alta3kibatAl5asaBfaridatAlsob7.screenRoute,
          pushBack: FimaYata3alakBel8odat.screenRoute,
          soud: 'https://cdn.jsdelivr.net/gh/SounaDiab/image_audio@master/audio/التعقيبات العامة.mp3',
          onTap: (double fontSize) {
            // تحديث حجم الخط
            setState(() {
              isTablet ? _fontSizeTablet = fontSize : _fontSize = fontSize;
            });
            print('fontSize: $fontSize');
            // إغلاق Dialog
            Navigator.of(context).pop();
          },
          onLongPress: () {
            final snackBar = SnackBar(
              content: Center(
                child: Text(
                  '${isTablet ? _fontSizeTablet.toInt() : _fontSize.toInt()}',
                  style: TextStyle(
                    color: Colors.white,
                    fontSize: 16,
                  ),
                ),
              ),
              width: 60,
              behavior: SnackBarBehavior.floating,
              backgroundColor: Colors.blue,
              duration: Duration(seconds: 2),
              shape: ShapeBorder.lerp(
                RoundedRectangleBorder(
                  borderRadius: BorderRadius.circular(50),
                ),
                RoundedRectangleBorder(
                  borderRadius: BorderRadius.circular(50),
                ),
                1,
              ),
            );
            ScaffoldMessenger.of(context).showSnackBar(snackBar);
          },
        ),
      ),
    );
  }
}
