import 'package:flutter/material.dart';
import 'package:maktabat_almoslim/widgets/container_scrollview.dart';
import 'package:provider/provider.dart';
import 'package:shared_preferences/shared_preferences.dart';

import '../../../widgets/add_custom_bottom_navigation_bar.dart';
import '../../../widgets/list_of_nine_verses.dart';
import '../../favorites_provider.dart';
import '../../favorites_screen.dart';
import '../nozor_men_a3mal_allail_walnahar.dart';
import 'fi_azkar_wda3awat_tokra2_saba7an_wamasa2an.dart';
import 'fima_yo3mal_men_7in_al8ouroub_2ela_7in_alnawm.dart';

class FiL2intibahMenAlnawmWsalatAllayl extends StatefulWidget {
  static String screenRoute = 'fi_l2intibah_men_alnawm_wsalat_allayl_screen';
  const FiL2intibahMenAlnawmWsalatAllayl({super.key});

  @override
  State<FiL2intibahMenAlnawmWsalatAllayl> createState() =>
      _FiL2intibahMenAlnawmWsalatAllaylState();
}

double _fontSize = 18;
double _fontSizeTablet = 30;

class _FiL2intibahMenAlnawmWsalatAllaylState
    extends State<FiL2intibahMenAlnawmWsalatAllayl> {
  bool isIcon = true;
  @override
  void initState() {
    super.initState();
    _loadFavoriteState();
  }

  Future<void> _loadFavoriteState() async {
    final prefs = await SharedPreferences.getInstance();
    bool? savedState = prefs
        .getBool('isFavorite_fi_l2intibah_men_alnawm_wsalat_allayl_screen');
    setState(() {
      isIcon = savedState ?? true;
    });
  }

  Future<void> _saveFavoriteState(bool value) async {
    final prefs = await SharedPreferences.getInstance();
    await prefs.setBool(
        'isFavorite_fi_l2intibah_men_alnawm_wsalat_allayl_screen', value);
  }

  Future<bool> _onWillPop() async {
    final args =
        ModalRoute.of(context)!.settings.arguments as Map<String, dynamic>?;
    final previousPage = args?['previousPage'];
    if (previousPage == 'favorite_screen') {
      Navigator.of(context).pushReplacementNamed(FavoritesScreen.screenRoute);
      return false;
    } else {
      Navigator.of(context)
          .pushReplacementNamed(NozorMenA3malAllailWalnahar.screenRoute);
      return false;
    }
  }

  @override
  Widget build(BuildContext context) {
    double size = MediaQuery.of(context).textScaleFactor;
    final screenWidth = MediaQuery.of(context).size.width;
    final isTablet = screenWidth >= 600;
    return WillPopScope(
      onWillPop: _onWillPop,
      child: Scaffold(
        appBar: AppBar(
          toolbarHeight: isTablet ? 100 : 50,
          centerTitle: true,
          leading: IconButton(
            onPressed: _onWillPop,
            icon: Icon(
              Icons.arrow_back,
              size: isTablet ? 50 : 25,
            ),
          ),
          actions: [
            IconButton(
              padding: EdgeInsets.only(left: isTablet ? 50 : 30),
              icon: Icon(
                isIcon ? Icons.favorite_border : Icons.favorite_rounded,
                size: isTablet ? 40 : 25,
                color: isIcon ? Colors.black : Colors.red,
              ),
              onPressed: () async {
                setState(() {
                  isIcon = !isIcon;
                });
                await _saveFavoriteState(isIcon);

                if (!isIcon) {
                  Provider.of<FavoritesProvider>(context, listen: false)
                      .addFavorite('في الانتباه من النوم وصلاة الليل',
                          FiL2intibahMenAlnawmWsalatAllayl.screenRoute);
                } else {
                  Provider.of<FavoritesProvider>(context, listen: false)
                      .removeFavorite(
                          'في الانتباه من النوم وصلاة الليل',
                          FiL2intibahMenAlnawmWsalatAllayl.screenRoute,
                          FiL2intibahMenAlnawmWsalatAllayl.screenRoute);
                }
              },
            ),
          ],
          title: Text(
            'في الانتباه من النوم وصلاة الليل',
            style: TextStyle(
              fontSize: isTablet
                  ? 40
                  : size > 1.0
                      ? 20
                      : 23,
              fontWeight: FontWeight.bold,
            ),
          ),
        ),
        body: ContainerScrollview(
          widget: Column(
            crossAxisAlignment: CrossAxisAlignment.start,
            children: [
              Container(
                child: Column(
                  children: [
                    Center(
                      child: Text(
                        'بسم الله الرحمن الرحيم',
                        style: TextStyle(
                          fontSize: isTablet ? _fontSizeTablet : _fontSize,
                          fontWeight: FontWeight.w900,
                        ),
                      ),
                    ),
                    Center(
                      child: Text(
                        'اللهم صلِّ على محمد وآل محمد',
                        style: TextStyle(
                          fontSize: isTablet ? _fontSizeTablet : _fontSize,
                          fontWeight: FontWeight.w900,
                        ),
                      ),
                    ),
                  ],
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: '',
                  subtitle:
                      'إعلم أن الروايات المأثورة عن المعصومين (عليهم السلام) في فضل قيام الليل كثيرة، وروي أن ذلك شرف المؤمن، وأن صلاة الليل يورث صحة البدن، وهي كفارة لذنوب النهار ومزيلة لوحشة القبر، تبيض الوجه وتطيب النكهة وتجلب الرزق، وأن المال والبنين زينة الحياة الدنيا، وثماني ركعات من آخر الليل، والوتر زينة الاخرة. وقد يجمعهما الله لاقوام، وأنه كذب من زعم أنّه يصلّي صلاة الليل وهو يجوع، إن صلاة الليل تضمن رزق النهار. وعن الصادق (عليه السلام) قال: قال النبي (صلّى الله عليه وآله وسلم) في وصيته لعلي عليهما واَّلهما السلام: ياعلي أوصيك في نفسك بعدة خصال فاحفظها. ثم قال: اللهم أعنه. ثم ذكر عدة خصال إلى أن قال: وعليك بصلاة الليل وعليك بصلاة الليل وعليك بصلاة الليل وعليك بصلاة الزوال وعليك بصلاة الزوال وعليك بصلاة الزوال.\n\n'
                      'والظاهر أن المراد بصلاة الليل هو الثلاث عشرة ركعة وبصلاة الزوال الثماني ركعات نافلة الزوال. وعن أنس قال: سمعت النبي (صلّى الله عليه وآله وسلم) يقول: صلاة ركعتين في جوف الليل أحب إلي من الدنيا وما فيها. وروي أنّه سئل الإمام زين العابدين (عليه السلام) مابال المتهجّدين بالليل من أحسن الناس وجها ؟ قال: لانهم خلوا بربهم فكساهم الله من نوره. وبالاجمال فالرويات في ذلك جمّة، ويكره ترك القيام في الليل. وروى الشيخ بسند صحيح عن الصادق (عليه السلام) قال: ما من عبد إِلاّ وهو يتيقظ مرّة أو مرّتين في الليل أو مراراً فإن قام وإِلاّ فحج الشيطان فبال في أذنه، ألا يرى أحدكم إذا كان منه ذاك قام ثقيلاً وكسلانا.\n\n'
                      'وروى البرقي بسند معتبر عن الباقر (صلوات الله وسلامه عليه) قال: إن للّيل شيطانا يقال له (الرّها) فإذا إستيقظ العبد وأراد القيام إلى الصلاة قال له: ليست ساعتك ثم يستيقظ مرة أخرى فيقول: لم يئن لك، فما يزال كذلك يزيله ويحبسه حتى يطلع الفجر فإذا طلع الفجر بال في أذنه ثم انصاع يمصع ذنبه . وروى ابن أبي جمهور عن النبي (صلّى الله عليه وآله وسلم): أنه قال يوما لاصحابه: إنّ أحدكم إذا نام عقد الشيطان على رأسه ثلاث عقد مكان كل عقدة عليك ليل طويل فأرقد فإذا انتبه وذكر الله حُلّت منها عقدة، فإذا توضأ حلّت أخرى، فإذا صلّى حلّت العقدة الثالثة فأصبح نشيطا طيب النفس، وإِلاّ أصبح خبيث النفس كسلانا، وهذا الحديث مروي أيضاً في كتب أهل السنّة.\n\n'
                      'وروى القطب الراوندي عن أمير المؤمنين (عليه السلام) قال: لاتطمع في ثلاث مع ثلاث: في قيام الليل مع الاكثار من الطعام، ولا في نور الوجه مع النوم في الليل كله، ولا في الامان من الدنيا مع مصاحبة الفسّاق. وروى القطب الراوندي أيضاً أن عيسى (عليه السلام) نادى أمه بعد موتها فقال كلّميني ياأمّي هل تريدين العود إلى الدنيا فأجابت بلى لكي أصلي لله في جوف الليل القارس وأصوم في اليوم الشديد الحرّ يابني إنّ هذا طريق رهيب.\n\n'
                      'وأما صفة صلاة الليل: على طريقة سهلة وجيزة يتيسر لكل أحد أداؤها فهي كما يلي: إذا انتبهت من النوم فاسجد لله تعالى، ويحسن أن تقول في سجودك أو عند رفع رأسك منه: الحَمْدُ لله الَّذِي أحْياني بَعْدَ ما أماتَني وَإلِيهِ النُشورُ، الحَمْدُ لله الَّذِي رَدَّ عَليّ روحي لاحْمَدَهُ وَأعْبُدَهُ.\n\n'
                      'فإذا قمت ووقفت فقل: اللَّهُمَّ أعِنّي عَلى هَوْلِ المَطْلَّعِ وَوَسِّعْ عَليَّ المَضْجَعَ وَارْزُقْنِي خَيْرَ ما بَعْدَ المَوتِ.\n\n'
                      'فإذا سمعت صياح الديك فقل: سُبّوحٌ قُدُّوسٌ رَبُّ المَلائِكَةِ وَالرّوحِ، سَبِقَت رَحْمَتَكَ غَضَبَكَ. لا إلهَ إِلاّ أنْتَ عَمِلْتُ سوءاً وَظَلَمْتُ نَفْسي فَاغْفِرْ لي إنَّهُ لايَغْفِرُ الذُّنُوبَ إِلاّ أنْتَ فَتُبْ عَلَيَّ إنَّكَ أنْتَ التَّوابُ الرَّحيمُ.\n\n'
                      'فإذا نظرت إلى أطراف السماء فقل: اللَّهُمَّ إنَّهُ لايواري مِنْكَ لَيلٌ ساجٍ وَلا سَماءٌ ذاتُ أبْراجٍ وَلا أرْضٌ ذاتُ مِهادٍ وَلا ظُلُماتٌ بَعْضُها فَوْقَ بَعْضٍ وَلا بَحْرٌ لُجّيُّ تُدْلِجُ بَيْنَ يَدَي المُدْلِجِ مِنْ خَلْقِكَ، تُدْلِجَ الرَّحْمَةَ عَلى مَنْ تَشاءُ مِنْ خَلْقِكَ تَعْلَمُ خائِنَةَ الاعْيُنِ وَما تُخْفي الصُّدورُ، غَارَتْ النُّجومُ وَنامَتِ العُيونُ وَأنْتَ الحَيُّ القَيومُ لاتأخُذُكَ سِنَةٌ وَلانَوْمٌ، سُبْحانَ الله رَبِّ العالَمينَ وَإلهِ المُرْسَلينَ وَالحَمْدُ لله رَبِّ العالَمينَ.\n\n'
                      'ثم اتلو الخمس اَّيات من آل عمران: إنَّ في خَلْقِ السَّماواتِ وَالارضِ وَاخْتِلافِ اللَّيْلِ وَالنَّهارِ لاياتٍ لأولي الالْبابِ الَّذينَ يَذْكُرونَ الله قياما وَقَعُوداً وَعَلى جُنوبِهِمْ وَيَتَفَكَّرونَ في خَلْقِ السَّماواتِ وَالارضِ رَبَّنا ماخَلَقْتَ هذا باطِلاً سُبْحانَكَ فَقِنا عَذابَ النّارِ رَبَّنا إنَّكَ مِنْ تُدْخِلْ النّارَ فَقَدْ أخْزَيْتَهُ وَما لِلظالِمينَ مِنْ أنْصارٍ رَبَّنا إنَّنا سَمِعْنا مُنادِيا يُنادي لِلايمانِ أنْ اَّمِنوا بِرَبِّكُمْ فَاَّمَنّا رَبَّنا فاغْفِرْ لَنا ذُنوبَنا وَكَفِّرْ عَنّا سَيئاتِنا وَتَوَفَّنا مَعَ الابرارِ رَبَّنا وَآتِنا ما وَعَدْتَنا عَلى رُسُلِكَ وَلاتُخْزِنا يَوْمَ القيامَةِ إنَّكَ لاتُخْلِفُ الميعادَ.\n\n'
                      'فإذا أردت أن تتوجه إلى العبادة واحتجت التخلّي لقضاء الحاجة فابدأ به، فإذا خرجت من الخلوة فابدأ بالاستياك وتوضأ بعد ذلك وضؤا تاما وتطيب وانهض لصلاة الليل.\n\n'
                      'ويبدأ وقتها عند انتصاف الليل. وكلما اقترب الوقت من طلوع الفجر الصادق ازدادت فضيلة، فإذا بان الفجر وكان المصلّي قد أتى منها أربع ركعات فليقتصر الحمد وحدها فيما بقي من الركعات.\n\n'
                      'وصلاة الليل ثماني ركعات يسلّم بعد كل ركعتين، ويحسن أن يقرأ التوحيد ستين مرّة في الثنائية الأولى، يقرأها بعد الحمد في كل ركعة منهما ثلاثين مرة لكي ينصرف من الصلاة ولم يك بينه وبين الله عزَّ وجلَّ ذنب. أو أن يقرأ بعد الحمد في الأولى التوحيد وفي الثانية قل ياأيهاالكافرون ويقرأ في سائر الركعات ماشاء من السور، ويجزي الحمد والتوحيد في كل ركعة ويجوز الاقتصار على الحمد وحدها.\n\n'
                      'والقنوت كما هو مسنون في الفرائض مسنون في النوافل في الركعة الثانية من كل ثنائية من ركعاتها ويجزي في القنوت أن تقول: سُبْحانَ الله ثلاث مرات أو أن تقول: اللَّهُمَّ اغْفِرْ لَنا وَارْحَمْنا وَعافِنا في الدُّنْيا وَالاخِرَةِ إنَّكَ عَلى كُلِّ شَيٍ قَديرٌ. أو أن تقول: رَبِّ اغْفَرْ وَارْحَمْ وَتَجاوَزْ عَمّا تَعْلَمُ إنَّكَ أنْتَّ الاعَزْ الاكْرَمْ.\n\n'
                      'وروي أنّ الإمام موسى بن جعفر (عليه السلام) كان إذا قام في محرابه ليلاً قال: اللَّهُمَّ إنَّكَ خَلَقْتَني سَوِيا، وهذا هو الدعاء الخمسون من أدعية الصحيفة الكاملة.\n\n'
                      'فإذا فرغت من الثماني ركعات صلاة الليل فصلّ الشفع ركعتين والوتر ركعة واحدة، واقرأ في هذه الثلاث ركعات بعد الحمد قل هو الله احد. حتى يكون لك أجر ختمة كاملة من القرآن، فإنّ لسورة التوحيد أجر ثلث القرآن. أو اقرأ في الأولى من الشفع الفاتحة وسورة قل أعوذ برب الناس وفي الثانية الحمد وقل أعوذ برب الفلق.\n\n'
                      'ويستحب أن تدعو إذا فرغت من الشفع بدعاء: إلهي تَعَرَّضَ لَكَ في هذا اللّيلِ المُتَعَرِّضونَ، وهذا الدعاء قد ذكرناه في (المفاتيح) في أعمال ليلة النصف من شعبان.\n\n'
                      'فإذا فرغت من ركعتي الشفع فانهض لركعة الوتر واقرأ فيها الحمد وسورة التوحيد. أو اقرأ بعد الحمد سورة قل هو الله أحد ثلاث مرات والمعوذتين أعني قل أعوذ برب الفلق، وقل أعوذ برب الناس. ثم خذ يديك للقنوت وادع بما شئت. وقال الطوسي رض والادعية للقنوت لاتحصى وليس في ذلك شي مؤقت لايجوز خلافه.\n\n'
                      'ويستحب أن يبكي الانسان في القنوت من خشية الله والخوف من عقابه، أو يتباكى ويدعو لاخوانه المؤمنين، ويستحب أن يذكر أربعين نفسا منهم فإنّ من دعا لاربعين نفسا من المؤمنين استجيب دعاؤه إن شاء الله ، ويدعو بما يشاء.\n\n'
                      'وروى الصدوق في الفقيه أنّ النبي (صلّى الله عليه وآله وسلم) كان يقول في الوتر في قنوته:\n\n'
                      'اللَّهُمَّ اهْدِنِي فيمَنْ هَدَيْتَ وَعافِني فيمَنْ عافَيْتَ وَتَوَلَّني فيمَنْ تَوَلَّيْتَ وَبارِكْ لي فيما أعْطَيْتَ وَقِني شَرَّ ما قَضَيْتَ، فَإنَّكَ تَقْضِي وَلايُقْضى عَلَيكَ، سُبْحانَكَ رَبَّ البَيْتِ أسْتَغْفِرُكَ وَأتوبُ إلَيكَ وَأُؤْمِنُ بِكَ وَأتَوَكَّلُ عَلَيْكَ ولاحَوْلَ وَلاقُوَّةَ إِلاّ بِكَ يارَحيمُ.\n\n'
                      'وينبغي أن يقول سبعين مرة: أسْتَغْفِرُ الله رَبّي وَأتُوبُ إلَيهِ. وينبغي في ذلك أن يرفع يده اليسرى للاستغفار ويحصي عدده باليمنى. وروي أنّ النبي (صلّى الله عليه وآله وسلم) كان يستغفر في الوتر سبعين مرّة ويقول سبع مرات: هذا مَقامُ العائِذِ بِكَ مِنَ النّارِ.\n\n'
                      'وروي أيضاً أنّ الإمام زين العابدين (عليه السلام) كان يقول في السحر في صلاة الوتر ثلاث مائة مرة: العَفْوَ العَفْوَ.\n\n'
                      'وليقل بعد ذلك: رَبِّ اغْفِرْ لي وَارْحَمْني وَتُبْ عَليّ إنَّكَ أنْتَ التَّوابُ الغَفُورُ الرَّحيمُ. وينبغي أن يطيل القنوت، فإذا فرغ منه ركع، فإذا رفع رأسه دعا بهذا الدعاء الذي رواه الشيخ في التهذيب عن موسى بن جعفر (عليه السلام): هذا مَقامُ مَنْ حَسَناتُهُ نِعْمَةٌ مِنْكَ وَشُكْرُهُ ضَعيفٌ وَذَنْبُهُ عَظيمٌ، وَلَيْسَ لِذلِكَ إِلاّ رِفْقُكَ وَرَحْمَتُكَ فَإنَّكَ قُلْتَ في كِتابِكَ المُنَزَّلِ عَلى نَبيّكَ المُرْسَلِ صَلّى الله عَلَيهِ وآلِهِ كانوا قَليلاً مِنَ اللَّيْلِ مايَهْجَعونَ وَبِالاسْحارِ هُمْ يَسْتَغْفِرونَ.\n\n'
                      'طالَ هُجوعي وَقَلَّ قيامي وَهذا السَّحَرُ وَأنا اسْتَغْفِرُكَ لِذُنوبِي اسْتِغْفارَ مَنْ لايَجِدُ لِنَفْسِهِ ضُراً وَلانَفْعا وَلامَوْتا وَلاحَياةً وَلانُشوراً. ثم يسجد، ويتم الصلاة ويسبح بعد السلام تسبيح الزهراء (عليها السلام) ثم يقول:\n\n'
                      'الحَمْدُ لِرَبِّ الصَّباحِ الحَمْدُ لِفالِقِ الاصْباحِ. ويقول: سُبْحانَ رَبّيَ المَلِكِ القُدّوسِ العَزيزِ الحَكيمِ ثلاثا. ثم يقول: يا حَيُّ يا قَيومُ يابَرُّ يارَحيمُ ياغَنيُ ياكَريمُ إرْزُقْنِي مِنَ التِّجارَةِ أعظَمَها فَضْلاً وَأوْسَعَهاً رِزْقاً وَخَيرَها لي عاقِبَةً فإنَّهُ لاخَيْرَ فيما لاعاقِبَةَ لَهُ.'
                      'وينبغي أن يدعو بعد هذا بدعاء الحزين: أُناجيكَ يامَوْجودُ في كُلِّ مَكانٍ… الخ . ثم يسجد ويقول خمس مرات: سُبّوحٌ قُدّوسٌ رَبُّ المَلائِكَةِ والرّوحِ. ثم يجلس ويقرأ آية الكرسي.'
                      'ثم يهوي ثانيا إلى السجود ويكرّر نفس الذكر خمس مرات.\n\n'
                      'ثم ينهض لنافلة الصبح وهي ركعتان يقرأ بعد الحمد في الأولى سورة قل ياأيّها الكافرون، وفي الثانية سورة التوحيد، فإذا سلّم نام على يمينه مستقبلاً القبلة على هيئة الميت في اللحد، ووضع خده الايمن على يده اليمنى وقال:\n\n'
                      'اسْتَمْسَكْتُ بِعرْوَةِ الله الوِثْقى الَتي لا انْفِصامَ لَها وَاعْتَصَمْتُ بِحَبْلِ الله ، المَتينِ وَأعوذُ بِا لله مِنْ شَرِّ فَسَقَةِ العَرَبِ وَالعَجَمِ، وأعوذُ بِالله مِنْ فَسَقَةِ الجِّنِ وَالانْسِ. ثم يقول ثلاثا: سُبْحانَ رَبِّ الصَّباحِ فالِقَ الاصْباحِ، ويقرأ الخمس آيات من آل عمران: إنَّ في خَلْقِ السَّماواتِ وَالارضِ (في ص1011). ثم يجلس ويسبّح تسبيح الزهراء (عليها السلام).\n\n'
                      'وقال في كتاب من (لايحضره الفقيه): روي أنّ من صلى على محمد وآل محمد مائة مرة فيما بين نافلة الصبح وفريضته وقى الله وجهه حرّ النار. ومن قال مائة مرة: سُبْحانَ رَبّيَ العَظيمِ وَبِحَمْدِهِ، أسْتَغْفِرُ الله رَبّي العَظيمِ وبِحَمْدِهِ، أسْتَغْفِرُ الله رَبّي وأتوبُ إلَيهِ بنى الله له بيتا في الجنة. ومن قرأ إحدى وعشرين مرة سورة قل هو الله احدٌ بنى الله له بيتا في الجنة. وإنّ من قرأها أربعين مرة غفر الله له.\n\n'
                      'وينبغي أن يدعى بعد الفراغ من صلاة الليل بالدعاء الثاني والثلاثين من أدعية الصحيفة الكاملة: اللَّهُمَّ ياذا المُلْكِ المُتَأبِّدِ بِالخُلُودِ. ثم يسجد سجدة الشكر وينبغي أن يدعو فيها لاخوانه المؤمنين ويدعو بالدعاء: اللَّهُمَّ رَبَّ الفَجْرِ، الذي قد مضى في دعوات سجدة الشكر (ص 999).\n\n'
                      'والمرجوّ من إخواني المؤمنين ان يخصّوا بدعواتهم هذا المذنب الذي اسود وجهه من الذنوب فإني شديد الحاجة إلى الدعاء والله الموفق.',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
            ],
          ),
        ),
        bottomNavigationBar: AddCustomBottomNavigationBar(
          pushNext: FiAzkarWda3awatTokra2Saba7anWamasa2an.screenRoute,
          pushBack: FimaYo3malMen7inAl8ouroub2ela7inAlnawm.screenRoute,
          soud: '',
          onTap: (double fontSize) {
            // تحديث حجم الخط
            setState(() {
              isTablet ? _fontSizeTablet = fontSize : _fontSize = fontSize;
            });
            print('fontSize: $fontSize');
            // إغلاق Dialog
            Navigator.of(context).pop();
          },
          onLongPress: () {
            final snackBar = SnackBar(
              content: Center(
                child: Text(
                  '${isTablet ? _fontSizeTablet.toInt() : _fontSize.toInt()}',
                  style: TextStyle(
                    color: Colors.white,
                    fontSize: 16,
                  ),
                ),
              ),
              width: 60,
              behavior: SnackBarBehavior.floating,
              backgroundColor: Colors.blue,
              duration: Duration(seconds: 2),
              shape: ShapeBorder.lerp(
                RoundedRectangleBorder(
                  borderRadius: BorderRadius.circular(50),
                ),
                RoundedRectangleBorder(
                  borderRadius: BorderRadius.circular(50),
                ),
                1,
              ),
            );
            ScaffoldMessenger.of(context).showSnackBar(snackBar);
          },
        ),
      ),
    );
  }
}
