import 'package:flutter/material.dart';
import 'package:maktabat_almoslim/widgets/container_scrollview.dart';
import 'package:provider/provider.dart';
import 'package:shared_preferences/shared_preferences.dart';

import '../../../widgets/add_custom_bottom_navigation_bar.dart';
import '../../../widgets/list_of_nine_verses.dart';
import '../../favorites_provider.dart';
import '../../favorites_screen.dart';
import '../nozor_men_a3mal_allail_walnahar.dart';
import 'fi_azkar_wda3awat_tokra2_saba7an_wamasa2an.dart';
import 'fima_yata3alak_bel8odat.dart';

class FimaYod3aBihiFikolSa3aMenSa3atAlyawm extends StatefulWidget {
  static String screenRoute =
      'fima_yod3a_bihi_fikol_sa3a_men_sa3at_alyawm_screen';
  const FimaYod3aBihiFikolSa3aMenSa3atAlyawm({super.key});

  @override
  State<FimaYod3aBihiFikolSa3aMenSa3atAlyawm> createState() =>
      _FimaYod3aBihiFikolSa3aMenSa3atAlyawmState();
}

double _fontSize = 18;
double _fontSizeTablet = 30;

class _FimaYod3aBihiFikolSa3aMenSa3atAlyawmState
    extends State<FimaYod3aBihiFikolSa3aMenSa3atAlyawm> {
  bool isIcon = true;
  @override
  void initState() {
    super.initState();
    _loadFavoriteState();
  }

  Future<void> _loadFavoriteState() async {
    final prefs = await SharedPreferences.getInstance();
    bool? savedState = prefs.getBool(
        'isFavorite_fima_yod3a_bihi_fikol_sa3a_men_sa3at_alyawm_screen');
    setState(() {
      isIcon = savedState ?? true;
    });
  }

  Future<void> _saveFavoriteState(bool value) async {
    final prefs = await SharedPreferences.getInstance();
    await prefs.setBool(
        'isFavorite_fima_yod3a_bihi_fikol_sa3a_men_sa3at_alyawm_screen', value);
  }

  Future<bool> _onWillPop() async {
    final args =
        ModalRoute.of(context)!.settings.arguments as Map<String, dynamic>?;
    final previousPage = args?['previousPage'];
    if (previousPage == 'favorite_screen') {
      Navigator.of(context).pushReplacementNamed(FavoritesScreen.screenRoute);
      return false;
    } else {
      Navigator.of(context)
          .pushReplacementNamed(NozorMenA3malAllailWalnahar.screenRoute);
      return false;
    }
  }

  @override
  Widget build(BuildContext context) {
    double size = MediaQuery.of(context).textScaleFactor;
    final screenWidth = MediaQuery.of(context).size.width;
    final isTablet = screenWidth >= 600;
    return WillPopScope(
      onWillPop: _onWillPop,
      child: Scaffold(
        appBar: AppBar(
          toolbarHeight: isTablet ? 100 : 50,
          centerTitle: true,
          leading: IconButton(
            onPressed: _onWillPop,
            icon: Icon(
              Icons.arrow_back,
              size: isTablet ? 50 : 25,
            ),
          ),
          actions: [
            IconButton(
              padding: EdgeInsets.only(left: isTablet ? 50 : 30),
              icon: Icon(
                isIcon ? Icons.favorite_border : Icons.favorite_rounded,
                size: isTablet ? 40 : 25,
                color: isIcon ? Colors.black : Colors.red,
              ),
              onPressed: () async {
                setState(() {
                  isIcon = !isIcon;
                });
                await _saveFavoriteState(isIcon);

                if (!isIcon) {
                  Provider.of<FavoritesProvider>(context, listen: false)
                      .addFavorite('فيما يدعى به في كل ساعة من ساعات اليوم',
                          FimaYod3aBihiFikolSa3aMenSa3atAlyawm.screenRoute);
                } else {
                  Provider.of<FavoritesProvider>(context, listen: false)
                      .removeFavorite(
                          'فيما يدعى به في كل ساعة من ساعات اليوم',
                          FimaYod3aBihiFikolSa3aMenSa3atAlyawm.screenRoute,
                          FimaYod3aBihiFikolSa3aMenSa3atAlyawm.screenRoute);
                }
              },
            ),
          ],
          title: Text(
            'فيما يدعى به في كل ساعة من ساعات اليوم',
            style: TextStyle(
              fontSize: isTablet
                  ? 40
                  : size > 1.0
                      ? 20
                      : 23,
              fontWeight: FontWeight.bold,
            ),
          ),
        ),
        body: ContainerScrollview(
          widget: Column(
            crossAxisAlignment: CrossAxisAlignment.start,
            children: [
              Container(
                child: Column(
                  children: [
                    Center(
                      child: Text(
                        'بسم الله الرحمن الرحيم',
                        style: TextStyle(
                          fontSize: isTablet ? _fontSizeTablet : _fontSize,
                          fontWeight: FontWeight.w900,
                        ),
                      ),
                    ),
                    Center(
                      child: Text(
                        'اللهم صلِّ على محمد وآل محمد',
                        style: TextStyle(
                          fontSize: isTablet ? _fontSizeTablet : _fontSize,
                          fontWeight: FontWeight.w900,
                        ),
                      ),
                    ),
                  ],
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: '',
                  subtitle:
                      'وما يدعى به في كل يوم ولايخص ساعة معينة منه إعلم أنّ الشيخ الطوسي والسيد ابن باقي والشيخ الكفعمي قد قسموا اليوم إلى اثنتي عشرة ساعة ونسبوا كلاً منها إلى‌إمام من الأئمة الاثني عشر صلوات الله عليهم أجمعين وذكروا لكلّ منها دعاء للتوسل‌بمن نسبت‌إليه تلك الساعة وهم وإن لم يرووا في هذا الموضوع حديثا عن‌المعصوم ولكنّهم كما هو المعلوم من شأنهم ، لم يصدر منهم ذلك مالم يقفوا على رواية تدل عليه، ونحن نقتصر في هذه الرسالة على ما في كتاب (مصباح المتهجد) قال:',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: ' الساعة الأولى :',
                  subtitle:
                      'وهي من طلوع الفجر إلى طلوع الشمس لأمير المؤمنين (عليه السلام).\n\n'
                      'وهذا دعاؤها : اللَّهُمَّ رَبَّ البَهاءِ وَالعَظَمَةِ والكِبْرياءِ وَالسُلْطانِ أظْهَرْتَ القُدْرَةَ وَكَيْفَ شِئْتَ وَمَنَنْتَ عَلى عِبادِكَ بِمَعْرِفَتِكَ وَتَسَلَّطْتَ عَلَيْهِمْ بِجَبَروتِكَ وَعَلَّمْتَهُمْ شُكْرَ نَعْمَتِكَ، اللَّهُمَّ فَبِحَقِّ عَليٍّ المُرْتَضى لِلدينِ وَالعالِمِ بِالحُكْمِ وَمَجاري التُقى إمامِ المُتَّقين‌صَلِّ عَلى مُحَمَّدٍ وَآل‌مُحَمَّدٍ في‌الأولينَ وَالاخِرينَ، وَأُقَدِّمَهُ بَيْنَ يَدَي حَوائِجي أن تُصَلِّيَ عَلى مُحَمَّدٍ وَآلِ مُحَمَّدٍ وَأنْ تَفْعَلْ بي كَذا وَكَذا.',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: 'الساعة الثانية :',
                  subtitle: 'للحسن بن علي (عليهما السلام).\n\n'
                      'وهي من طلوع الشمس إلى ذهاب الحمرة: اللَّهُمَّ لَبِسْتَ بَهأَكَ في أعْظَمِ قُدْرَتِكَ وَصَفا نُورُكَ في أنْورِ ضَوئِكَ وَفاضَ عِلْمُكَ حِجابَكَ وَخَلَّصْتَ فيهِ أهْلَ الثِّقَةِ بِكَ عِنْدَ جودِكَ فَتَعالَيْتَ في كِبْريائكَ عُلوا، عَظُمَتْ فيهِ مِنَّتُكَ على أهْلِ طاعَتِكَ فَباهَيْتَ بِهِمْ أهْلَ سَماواتِكَ بِمِنَّتِكَ عَلَيْهِمْ، اللَّهُمَّ فَبِحَقِّ الحَسَنِ بِنْ عَلي عَلَيْكَ أَسْأَلُكَ وَبِهِ أسْتَغيثُ إلَيْكَ وَأقَدِّمُهُ بَيْنَ يَدَيْ حَوائِجي أنْ تُصَلِّيَ عَلى مُحَمَّدٍ وَآلِ مُحَمَّدٍ وَأنْ تَفْعَلْ بي كَذا وَكَذا.',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: 'الساعة الثالثة :',
                  subtitle:
                      'وهي من ذهاب الشعاع إلى ارتفاع النهار للحسين بن علي (عليهما السلام).\n\n'
                      'يامَنْ تَجَبَّرَ فَلا عَيْنٌ تَراهُ ياَمْن تَعَظَّمَ فَلا تَخْطِرُ القُلوبُ بِكُنْهِهِ ياحَسَنَ المَنِّ ياحَسَنَ التَّجاوِزِ ياحَسَنَ العَفو ياجَوادُ ياكَريمُ يامَنْ لايُشْبِهُهُ شَيٌ مِنْ خَلْقِهِ، يامَنْ مَنَّ عَلى خَلْقِهِ بأوْلِيائِهِ إذ ارْتَضاهُمْ لِدينِهِ وَأدَّبَ بِهِمْ عِبادَهُ وَجَعَلَهُمْ حُجَجا مَنَّا مِنْهُ عَلى خَلْقِهِ ؛ أَسْأَلُكَ بِحَقِّ الحُسَينِ بِنْ عَلي عَلَيْهِما السَّلامُ السِّبْطِ التّابِعِ لِمَرْضاتِكَ وَالنّاصِحِ في دينِكَ وَالدَّليلِ عَلى ذاتِكَ، أَسْأَلُكَ بِحَقِّهِ وَأُقَدِّمُهُ بَيْنَ يَدَي حَوائِجي أنْ تُصَلِّيَ عَلى مُحَمَّدٍ وَآلِ مُحَمَّدٍ وَأنْ تَفْعَلَ بي كَذا وَكَذا.',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: 'الساعة الرابعة :',
                  subtitle: 'لعلي بن الحسين (عليهما السلام).\n\n'
                      'وهي من ارتفاع النهار إلى زوال الشمس: اللَّهُمَّ صَفا نورُكَ في أتَمِّ عَظَمَتِكَ وَعَلا ضياؤكَ في أبْهى ضَوْئِكَ، أَسْأَلُكَ بِنُورِكَ الَّذِي نَوَّرْتَ بِهِ السَّماواتِ وَالارَضينَ وقَصَمْتَ بِهِ الجَّبابِرَةَ وَأحْيَيْتَ بِهِ الامْواتَ وَأمَتَّ بِهِ الاحْياءَ وَجَمَعْتَ بِهِ المُتَفَرِّقَ وَفَرَّقْتَ بِهِ المُجْتَمِعَ وَأتْمَمْتَ بِهِ الكَلِماتِ وَأقَمْتَ بِهِ السَّماواتِ، أَسْأَلُكَ بِحَقِّ وَليَّكَ عَلي بِنْ الحُسَينِ عَلَيْهِما السَّلامُ الذّابِ عَنْ دينِكَ وَالمُجاهِدِ في سَبيلِكَ، وَأُقَدِّمُهُ بَيْنَ يَدَي حَوائِجي أنْ تُصَلِّيَ عَلى مُحَمَّدٍ وَآلِ مُحَمَّدٍ وَأنْ تَفْعَلَ بي كَذا وَكَذا.',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: 'الساعة الخامسة :',
                  subtitle: 'لمحمد بن علي الباقر (عليهما السلام).\n\n'
                      'وهي من زوال الشمس إلى أربع ركعات من الزوال: اللَّهُمَّ رَبَّ الضياءِ وَالعَظَمَةِ وَالنورِ وَالكِبْرياءِ وَالسُّلْطانِ، تَجَبَّرْتَ بِعَظَمَةِ بَهائِكَ وَمَنَنْتَ عَلى عِبادِكَ بِرأفَتِكَ وَرَحْمَتِكَ وَدَلَلْتَهُمْ عَلى مَوْجودِ رِضاكَ وَجَعَلْتَ لَهُمْ دَليلاً يَدُلّهُمْ عَلى مَحَبَتِكَ وَيُعَلِّمُهُمْ مَحابّكَ وَيَدُلُّهُمْ عَلى مَشيَتِكَ، اللَّهُمَّ فَبِحَقِّ مُحَمَّدٍ بِنْ عَلي عَلَيْهِما السَّلامُ عَلَيكَ، وَأُقَدِّمُهُ بَيْنَ يَدَي حَوائِجي أنْ تُصَلِّيَ عَلى مُحَمَّدٍ وَآلِ مُحَمَّدٍ وَأنْ تَفْعَلَ بي كَذا وَكَذا.',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: 'الساعة السادسة :',
                  subtitle: 'لجعفر بن محمد الصادق (عليهما السلام).\n\n'
                      'وهي من مقدار أربع ركعات من الزوال إلى صلاة الظهر: يامَنْ لَطُفَ عَنْ إدْراكِ الاوْهامِ يامَنْ كَبُرَ عَنْ مَوْجودِ البَصَرِ يامَنْ تَعالى عَنْ الصِّفاتِ كُلِّها يامَنْ جَلَّ عَنْ مَعاني اللُّطْفِ وَلَطُفَ عَنْ مَعاني الجَلالِ، أَسْأَلُكَ بِنورِ وَجْهِكَ وَضياءِ كِبْريائِكَ وأَسْأَلُكَ بِحَقِّ عَظَمَتِكَ العافِيَةِ مِنْ نارِكَ وَأَسْأَلُكَ بِحَقِّ جَعْفَرِ بِنْ مُحَمَّدٍ عَلَيكَ، وَأُقَدمُهُ بَيْنَ يَدَي حَوائِجي أنْ تُصَلِّيَ عَلى مُحَمَّدٍ وَآلِ مُحَمَّدٍ وَأنْ تَفْعَلَ بي كَذا وَكَذا.',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: 'الساعة السابعة :',
                  subtitle: 'لموسى بن جعفر (عليهما السلام).\n\n'
                      'وهي من صلاة الظهر إلى مقدار أربع ركعات من قبل العصر: يامَنْ تَكَبَّرَ عَنْ الاوهامِ صورَتُهُ يامَنْ تَعالى عَنِ الصِّفاتِ نورُهُ يامَنْ قَرُبَ عِنْدَهُ دُعاءُ خَلْقِهِ يامَنْ دَعاهُ المُضْطَرونَ وَلَجَأ إليهِ الخائِفونَ وَسَألَهُ المؤمِنونَ وَعَبَدَهُ الشّاكِرونَ وَحَمِدُهُ المُخْلِصونَ، أَسْأَلُكَ بِحَقِّ نورِكَ المُضيِ وَبِحَقِّ موسى بِنْ جَعْفَرِ عَلَيْكَ وَأتَقَرَّبُ بِهِ إلَيكَ، وَأُقَدِّمُهُ بَيْنَ يَدَي حَوائِجي أنْ تُصَلِّيَ عَلى مُحَمَّدٍ وَآلِ مُحَمَّدٍ وَأنْ تَفْعَلَ بي كَذا وَكَذا.',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: 'الساعة الثامنة :',
                  subtitle:
                      'لعلي بن موسى الرضا (عليهما السلام) وهي من مقدار أربع ركعات بعد الظهر إلى صلاة العصر: ياخَيْرَ مَدْعوٍ ياخَيْرَ مَنْ أعْطى ياخَيْرَ مَنْ سُئِلْ يامَنْ أضاءَ بِاسْمِهِ ضَوْءُ النَّهارِ وَأظْلَمَ بِهِ ظُلْمَةُ اللَّيْلِ وَسالَ بِإسْمِهِ وَابِلُ السَّيْلِ وَرَزَقَ أوْلياَئهُ كُلَّ خَيْرٍ يامَنْ عَلا السَّماواتِ نورُهُ وَالارضَ ضوؤُهُ وَالشَّرْقَ وَالغَرْبَ رَحْمَتُهُ ياواسِعَ الجودِ، أَسْأَلُكَ بِحَقِّ عَلي بِنْ موسى الرِّضا عَلَيْهِما السَّلامُ، وَأُقَدِّمُهُ بَيْنَ يَدَي حَوائِجي أنْ تُصَلِّيَ عَلى مُحَمَّدٍ وَآلِ مُحَمَّدٍ وَأنْ تَفْعَلَ بي كَذا وَكَذا.',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: 'الساعة التاسعة :',
                  subtitle: 'لمحمد بن علي التقي (عليهما السلام).\n\n'
                      'وهي من صلاة العصر إلى أن تمضي ساعتان تقول: يامَنْ دَعاهُ المُضْطَرّونَ فَأجابَهُمْ وَالتَجَأ إليهِ الخائِفُونَ فَآمَنَهُمْ وَعَبَدَهُ الطائِعونَ فَشَكَرَهُمْ وَشَكَرَهُ المؤمِنونَ فَحَباهُمْ وَأطاعوهُ فَعَصَمَهُمْ وَسَأَلُوهُ فَأعْطاهُمْ وَنَسوا نِعْمَتَهُ فَلَمْ يُخْلِ شُكْرَهُ مِنْ قُلُوبِهِمْ، وَامْتَنَّ عَلَيْهِمْ فَلَمْ يَجْعَلْ اسْمَهُ مَنْسيّا عِنْدَهُمْ، أَسْأَلُكَ بِحَقِّ مُحَمَّدٍ بن عَلي عَلَيْهِما السَّلامُ حُجَّتَكَ البالِغَةَ ونِعْمَتَكَ السّابِغَةَ وَمَحَجَّتَكَ الواضِحَةَ، وَأُقَدِّمُهُ بَيْنَ يَدَي حَوائِجي أنْ تُصَلِّيَ عَلى مُحَمَّدٍ وَآلِ مُحَمَّدٍ وَأنْ تَفْعَلَ بي كَذا وَكَذا.',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: 'الساعة العاشرة :',
                  subtitle: 'لعلي بن محمد النقي (عليهما السلام).\n\n'
                      'وهي من ساعتين بعد صلاة العصر إلى قبل اصفرار الشمس: يامَنْ عَلا فَعَظُمَ يامَنْ تَسَلَّطَ فَتَجَبَّرَ وَتَجَبَّرَ فَتَسَلَّطَ يامَنْ عَزَّ فَاسَتَكْبَرَ في عِزِّهِ يامَنْ مَدَّ الظِّلَّ عَلى خَلْقِهِ يامَنْ امْتَنَّ بِالمَعْروفِ عَلى عِبادِهِ، ياعَزيزاً ذا انْتِقامٍ يا مُنْتَقِما بِعِزَّتِهِ مِنْ أهْلِ الشِّرْكِ، أَسْأَلُكَ بِحَقِّ عَلي بِنْ مُحَمَّدٍ عَلَيْهِما السّلامُ، وَأُقَدِّمُهُ بَيْنَ يَدَي حَوائِجي أنْ تُصَلِّيَ عَلى مُحَمَّدٍ وَآلِ مُحَمَّدٍ وَأنْ تَفْعَلَ بي كَذا وَكَذا.',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: 'الساعة الحادية عشرة :',
                  subtitle: 'للحسن العسكري (عليه السلام).\n\n'
                      'وهي من قبل اصفرار الشمس إلى اصفرارها: ياأوّلاً بِلا أوَليَةٍ وَياآخِرْ بِلا آخِريَةٍ ياقَيُّوما بِلا مُنْتَهى لِقِدَمِهِ ياعَزيزاً بِلا انْقِطاعَ لِعِزّتِهِ يامُتَسَلِّطاً بِلا ضَعْفٍ مِنْ سُلْطانِهِ ياكَريماً بِدَوامِ نِعْمَتِهِ ياجَبّاراً وَمُعِزّاً لأوليائِهِ يا خَبيراً بِعِلْمِهِ وَياعَلِيماً بِقُدْرَتِهِ ياقَديراً بِذاتِهِ، أَسْأَلُكَ بِحَقِّ الحَسَنِ بِنْ عَلي عَلَيْهِما السَّلامُ، وَأُقَدِّمُهُ بَيْنَ يَدَي حَوائِجي أنْ تُصَلِّيَ عَلى مُحَمَّدٍ وَآلِ مُحَمَّدٍ وَأنْ تَفْعَلَ بي كَذا وَكَذا.',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: 'الساعة الثانية عشرة :',
                  subtitle: 'لإمام العصر (عليه السلام).\n\n'
                      'وهي من اصفرار الشمس إلى غروبها: يامَنْ تَوَحَّدَ بِنَفْسِهِ عَنْ خَلْقِهِ يامَنْ غَني عَنْ خَلْقِهِ بِصُنْعِهِ يامَنْ عَرَّفَ نَفْسَهُ خَلْقَهُ بِلُطْفِهِ يامَنْ سَلَكَ بِأهْلِ طاعَتِهِ مَرْضاتَهُ يامَنْ أعانَ أهْلَ مَحَبّتِهِ عَلى شُكْرِهِمْ يامَنْ مَنَّ عَلَيْهِمْ بِدينِهِ وَلَطُفَ لَهُمْ بِنائِلِهِ، أَسْأَلُكَ بِحَقِّ الخَلَفِ الصّالِحِ عَلَيهِ السَّلامُ عَلَيْكَ وأتَضَرَّعُ إلَيكَ بِهِ، وَأُقَدِّمُهُ بَيْنَ يَدَي حَوائِجي أنْ تُصَلِّيَ عَلى مُحَمَّدٍ وَآلِ مُحَمَّدٍ وَأنْ تَفْعَلَ بي كَذا وَكَذا اللَّهُمَّ صَلِّ عَلى مُحَمَّدٍ وَآل مُحَمَّدٍ أولي الأمْرِ الَّذينَ أمَرْتَ بِطاعَتِهِمْ وأولي الارْحامِ الَّذينَ أمَرْتَ بِصِلَتَهُمْ وَذَوي القُرْبى الَّذينَ أمَرْتَ بِمَوَدَّتِهِمْ وَالمَوالي الَّذينَ أمَرْتَ بِعِرْفانِ حَقِّهِمْ وَأهْلِ البَيْتِ الَّذينَ أذْهَبْتَ عَنْهُمْ الرِّجْسَ وَطَهَرْتَهُمْ تَطْهيراً أنْ تُصَلِّيَ عَلى مُحَمَّدٍ وَآل مُحَمَّدٍ وَأنْ تَفْعَلَ بي كَذا وَكَذا.\n\n'
                      'قال العلامة المجلسي في كتاب (مقباس المصابيح): روي بأسناد معتبرة عن الصادق (عليه السلام) قال: إنّ لله عزَّ وجلَّ ثلاث ساعات في الليل وثلاث ساعات في النهار يمجّد فيهن نفسه. فأول ساعات النهار حين تكون الشمس من هذا الجانب يعني من المشرق مقدارها من العصر من هذا الجانب يعني من المغرب (أي عند الضحى) إلى الصلاة الأولى (صلاة الظهر) وأول ساعات الليل في الثلث الاخير من الليل إلى أن ينفجر الصبح. فما من عبد مؤمن يمجّد الله عزَّ وجلَّ بما مرّ من التمجيد مقبلاً قلبه إلى الله إِلاّ قضى الله عزَّ وجلَّ له حاجته ولو كان شقيا رجوت أن يحوّل سعيداً.\n\n'
                      'أقول: الانسب أن يمجّد في هذه الساعات بهذا التمجيد: أنْتَ الله لا إلهَ إِلاّ أنْتَ رَبُّ العالمينَ أنْتَ الله لا إلهَ إِلاّ أنْتَ الرَّحْمنُ الرَّحيمُ أنْتَ الله لا إلهَ إِلاّ أنْتَ العَليّ الكَبيرُ أنْتَ الله لا إلهَ إِلاّ أنْتَ مَلِكُ يَوْمَ الدِّينِ أنْتَ الله لا إلهَ إِلاّ أنْتَ الغَفُورُ الرَّحيمُ أنْتَ الله لا إلهَ إِلاّ أنْتَ العَزيزُ الحَكيمُ أنْتَ الله لا إلهَ إِلاّ أنْتَ مِنْكَ بَدُْ كُلِّ شَيٍ وَإلَيْكَ يَعودُ أنْتَ الله لا إلهَ إِلاّ أنْتَ لَمْ تَزَلْ وَلاتَزالُ أنْتَ الله لا إلهَ إِلاّ أنْتَ خالِقُ الخَيْرِ وَالشَّرِّ أنْتَ الله لا إلهَ إِلاّ أنْتَ خالِقُ الجَنَّةِ وَالنّارِ أنْتَ الله لا إلهَ إِلاّ أنْتَ الاحَدُ الصَّمَدُ لَمْ يَلِدْ وَلَمْ يولَدْ وَلَمْ يَكُنْ لَهُ كُفْوا أحَدٌ أنْتَ الله لا إلهَ إِلاّ أنْتَ المَلِكُ القُدُّوسُ السَّلامُ المؤمِنُ المُهَيْمِنُ العَزيزُ الجَبّارُ المُتَكَبِّرُ، سُبْحانَ الله عَمّا يُشْرِكونَ أنْتَ الله الخالِقُ الباريُ المُصَوِّرُ لَكَ الاسَّماء الحُسْنى يُسَبِّحُ لَكَ مافي السَّماواتِ وَالارضِ وَأنْتَ العَزيزُ الحَكيمُ أنْتَ الله لا إلهَ إِلاّ أنْتَ الكَبيرُ المُتَعالِ والكِبْرياءُ رِداؤكَ.\n\n'
                      'روى ابن بابويه عن الصادق (عليه السلام) قال: مامن عبد يقول كل يوم سبع مرات: أسْأَلُ الله الجَنَّةَ وَأَعُوذُ بِالله مِنَ النَّارِ . إِلاّ قالت النار يارب أعذه. وبسند معتبر اَّخر عنه (عليه السلام) قال: ما من مؤمن يقترف في كل يوم أو ليلة أربعين كبيرة يستغفر الله وهو نادم بهذا الاستغفار إِلاّ غفر الله له: أسْتَغْفِرُ الله الَّذِي لا إلهَ إِلاّ هوَ الحيّ القَيّومُ بَديعُ السَّماواتِ وَالارضِ ذو الجَّلالِ وَالاكْرامِ وَأسْأَلَهُ أنْ يَتُوبَ عَليّ. وروى أيضاً بسند معتبر عنه (عليه السلام) قال: من قال في كل يوم سبع مرات: الحَمْدُ لله عَلى كُلِّ نِعْمَةٍ كانَتْ أو هَي كائِنَةٌ. فقد أدّى شكر مامضى وشكر مابقي. وروى أيضاً بسند معتبر عنه (عليه السلام) قال: من قال كل يوم خمسا وعشرين مرة: اللَّهُمَّ اغْفِرْ لِلمؤمِنينَ وَالمؤمِناتِ وَالمُسْلِمينَ وَالمِسْلِماتِ كتب الله له بعدد كل مؤمن مضى وكل مؤمن بقي إلى يوم القيامة حسنة ومحا عنه سيئة ورفع له درجة.\n\n'
                      'وروى أيضاً بسند معتبر عنه (عليه السلام) قال: من قال في كل يوم مائة مرة: لا حَوْلَ وَلا قُوَّةَ إِلاّ بِالله دفع الله بها عنه سبعين نوعا من البلا أيسرها الهمّ. وعلى رواية أخرى: لم يصبه فقر أبداً. وروى الكليني والطبرسي وغيرهما بأسناد بعضها حسنة وبعضها معتبرة عن الصادق (عليه السلام): أن النبي (صلّى الله عليه وآله وسلم) كان يقول كل يوم سبعين مرة: أسْتَغْفِرُ اللّهَ. وسبعين مرة: أتوبُ إِلى اللّهِ.\n\n'
                      'وفي (كشف الغمة) و(أمالي الشيخ الطوسي) بسند معتبر عن رسول الله (صلّى الله عليه وآله وسلم) قال: من قال في كل يوم مائة مرة: لا إلهَ إِلاّ الله المَلِكُ الحَقُّ المُبينُ. كان له أمان من الفقر وأمن من وحشة القبر واستجلب الغنى وفتحت له أبواب الجنة. والذكر في (الامالي): لا إلهَ إِلاّ الله الحَقُّ المُبينُ. وعدده على رواية (ثواب الاعمال) و(المحاسن) للبرقي ثلاثون مرة.\n\n'
                      'وروى القطب الراوندي في دعواته عن الرضا (صلوات الله وسلامه عليه) قال: قال رسول الله (صلّى الله عليه وآله وسلم): من أحبّ أن يعلو ثناؤه على ثناء المجاهدين في الملا الاعلى فليقل هذا القول في كل يوم فإن كانت له حاجة قضيت أو عدو كبت أو دين قضي أو كرب كشف وخرق كلامه السماوات السبع حتى يكتب في اللوح المحفوظ وهو هذا: سُبْحانَ الله كَما يَنْبَغي لله وَالحَمْدُ لله كَما يَنْبَغي لله وَلا إلهَ إِلاّ الله كَما يَنْبَغي لله وَالله أكْبَرُ كَما يَنْبَغي لله وَلا حَولَ وَلا قوةَ إِلاّ بِالله وَصَلى الله عَلى مُحَمَّدٍ النَبي وَعلى أهْلِ بَيْتِهِ وَجَميعِ المُرْسَلينَ وَالنَبيينَ حَتّى يَرْضى اللّهُ.\n\n'
                      'وبسند معتبر عن الرضا (عليه السلام) قال: وجد رجل صحيفة فأتى بها رسول الله (صلّى الله عليه وآله وسلم) فنادى الصلاة جامعة فما تخلف أحد فرقي المنبر وقال: هذا كتاب يوشع بن نون وصي موسى (عليه السلام) وفيها: بِسْمِ الله الرَّحْمنِ الرَّحِيمِ إنَّ رَبَّكُمْ لَرَؤُوفٌ رَحِيمٌ إِلاّ إنّ خير عباد الله التقي النقي الحفي وإنّ شرَّ عباد الله المشار إليه بالاصابع فمن أحبّ أن يكتال بالمكيال الاوفى وأن يوفي الحقوق التي أنعم الله بها عليه فليقل في كل يوم: سُبْحانَ الله كَما يَنْبَغي لله وَالحَمْدُ لله كَما يَنْبَغي لله وَلا إلهَ إِلاّ الله كَما يَنْبَغي لله وَلا حَولَ وَلا قوةَ إِلاّ بِالله وَصَلى الله عَلى مُحَمَّدٍ وَأهْلِ بَيْتِهِ النَبي الاُمِّي وَعلى جَميعِ المُرْسَلينَ وَالنَبيينَ حَتّى يَرْضى اللّهُ.\n\n'
                      'وفي (البلد الامين) عن رسول الله (صلّى الله عليه وآله وسلم) قال: من قال كل يوم عشر مرات: بِسْمِ الله الرَّحْمنِ الرَّحيمِ لا حَوْلَ وَلا قوَةَ إِلاّ بِالله العَلي العَظيمِ خرج من ذنوبه كيوم ولدته أمّه ودفع الله عنه سبعين بابا من البلاء منها الجنون والجذام والبرص والفالج ووكّل الله تعالى به سبعين ألف ملك يستغفرون له. وعن الصادق (عليه السلام) قال: من قال كل يوم مائة مرة : لا حَولَ وَلا قوةَ إِلاّ بِالله لم يصبه الفقر.\n\n'
                      'ومن قال كل يوم مائة مرة: سُبْحانَ الله وَالحَمْدُ لله وَلا إلهَ إِلاّ الله وَالله أكْبَرُ حرّم الله جسده على النار.\n\n'
                      'وروي في (البلد الامين) عن النبي (صلّى الله عليه وآله وسلم): أن من قال هذه الكلمات في كل يوم عشراً غفر الله تعالى له أربعة اَّلاف كبيرة ووقاه من شر سكرات الموت وضغطة القبر ومائة هول من أهوال يوم القيامة ووقي من شر إبليس وجنوده وقضي دينه وكشف همّه وغمّه وفرّج كربه وهي هذه: أعْدَدْتُ لِكُلِّ هَولٍ لا إلهَ إِلاّ الله وَلِكُلِّ هَمٍّ وَغَمٍّ ماشاء الله وَلِكُلِّ نِعْمَةٍ الحَمْدُ لله وَلِكُلِّ رَخاءٍ الشُّكْرُ لله وَلِكُلِّ أُعْجوبَةٍ سَبْحانَ الله وَلِكُلِّ ذَنْبٍ أسْتَغْفِرُ الله وَلِكُلِّ مُصيبَةٍ إنّا لله وَإنّا إلَيهِ راجِعونَ وَلِكُلِّ ضيقٍ حَسْبي الله وَلِكُلِّ قَضاء وَقَدَرٍ تَوَكَّلْتُ عَلى الله وَلِكُلِّ عَدوٍّ إعْتَصَمْتُ بِالله وَلِكُلِّ طاعَةٍ وَمَعْصيةٍ لا حَولَ وَلا قوةَ إِلاّ بِالله العَليّ العَظيم.\n\n'
                      'وروى الكليني وابن بابويه والبرقي رحمة الله عليهم بأسناد معتبرة عن الصادق (عليه السلام): أن من قال كل يوم عشر مرات هذا القول كتب الله له خمساً وأربعين ألف حسنة ومحا عنه خمسا وأربعين ألف سيئة ورفع له في الجنة خمساً وأربعين ألف درجة وكان له حرزاً من الشيطان والسلطان ولم تحط به كبيرة من الذنوب، وعلى رواية أخرى كان كمن قرأالقرآن اثنتي عشرة مرة وبنى الله له بيتا في الجنة. ورواية ابن بابويه لم يذكر فيها العدد عشر مرات وهو هذا الدعاء: أشْهَدُ أنْ لا إلهَ إِلاّ الله وَحْدَهُ لاشَريكَ لَهُ إلها وَاحِداً أحَداً صَمَداً لَمْ يَتَّخِذَ صاحِبَةً وَلا وَلَداً. وفي (ثواب الاعمال) و (المحاسن) و (الكافي) عن الصادق (عليه السلام) قال: قال رسول الله (صلّى الله عليه وآله وسلم): من قال في كل يوم خمس عشرة مرة: لا إلهَ إِلاّ الله حَقا حَقا لا إلهَ إِلاّ الله إيمانا وَتَصْديقا لا إلهَ إِلاّ الله عُبوديَّةً وَرِقا. أقبل الله عليه بوجهه ولم يصرف عنه حتى يدخل الجنّة.\n\n'
                      'وفي (المحاسن) عن النبي (صلّى الله عليه وآله وسلم) قال: من سبح الله مائة مرة كل يوم كان أفضل ممن ساق مائة بدنة إلى بيت الله الحرام، ومن حمد الله مائة تحميدة، كان أفضل ممن أعتق مائة عبد. ومن كبر الله مائة تكبيرة كان أفضل ممن حمل مائة فرس في سبيل الله بسروجها ولجمها. ومن هلل الله مائة تهليلة كان أفضل الناس عملاً إِلاّ من قال أكثر من هذا.\n\n'
                      'وروى القطب الراوندي أنّ عابداً من بني إسرائيل سأل الله عزَّ وجلَّ فقال: يارب ماحالي عندك أخير فازداد في خيري أو شر فأتوب قبل الموت ؟ فبعث الله إليه ملكا فقال له ليس لك عند الله خير، قال: يارب وأين عملي ؟ قال كنت إذا عملت خيراً أخبرت الناس به فكنت تريد أن تعد خيّراً بين الناس يذكروك بالخير فليس لك منه إِلاّ الذي رضيت به لنفسك.\n\n'
                      'قال: فشق ذلك عليه وأحزنه فكرّر الله إليه الرسول فقال: يقول الله تبارك وتعالى فمن الان فاشتر مني نفسك فيما تستقبل بصدقة تخرجها عن كل عرق كل يوم صدقة. قال: يارب أويطيق هذا أحد ؟ فقال تعالى: قل كل يوم ثلاثمائة وستين مرة بعدد عروقك: سُبْحانَ الله وَالحَمْدُ لله وَلا إلهَ إِلاّ الله وَالله أكْبَرُ وَلا حَوْلَ وَلا قوَةَ إِلاّ بِاللّهِ.\n\n'
                      'قال: يارب زدني. قال: إن زِدْتَ زِدْتُ لك. وروى الكليني بسند معتبر عن الصادق (عليه السلام) قال: كان رسول الله (صلّى الله عليه وآله وسلم) يقول في كل يوم ثلاثمائة وستين مرة عدد عروق الجسد: الحَمْدُ لله رَبِّ العالَمينَ كَثِيراً عَلى كُلِّ حالٍ.\n\n'
                      'وفي رواية أخرى عنه (عليه السلام): من قال هذا القول كل يوم أربعمائة مرة شهرين متتابعين رزق كَثِيراً من علم أو كَثِيراً من مال: أسْتَغْفِرُ الله الَّذِي لا إلهَ إِلاّ هوَ الحَيُّ القَيومُ الرَّحْمنُ الرَّحيمُ بَديعُ السَّماواتِ وَالارضِ مِنْ جَميعِ ظُلْمي وَجُرْمي وَإسْرافي عَلى نَفْسي وَأتوبُ إليهِ. وروى الطوسي وغيره أنّ من المسنون الدعاء بهذا الدعاء في كل يوم:\n\n'
                      'اللَّهُمَّ إِنِّي أَسْأَلُكَ بِنورِ وَجْهِكَ المُشْرِقِ الحَي الباقي الكَريمِ وَأَسْأَلُكَ بِنورِ وَجْهِكَ القُدّوسِ الَّذِي أشْرَقَتْ بِهِ السَّماواتُ وَانْكَشَفَتْ بِهِ الظُّلُماتُ وَصَلُحَ عَليهِ أمْرُ الأولينَ وَالاخِرينَ أنْ تُصَلِّيَ عَلى مُحَمَّدٍ وَآلِ مُحَمَّدٍ وَأنْ تُصْلِحَ لي شَأني كُلَّهُ.\n\n'
                      'وروى الكفعمي عن الباقر (صلوات الله وسلامه عليه) قال من قال هذا القول كل يوم كفاه الله همّ داريه بِسْمِ الله حَسْبيَ الله تَوَكَّلْتُ عَلى الله اللَّهُمَّ إِنِّي أَسْأَلُكَ خَيْرَ أموري كُلِّها وَأعوذُ بِكَ مِنْ خِزْي الدُّنيا وَعَذابِ الاخِرَةِ.\n\n'
                      'وروى أيضاً أن من قال هذا القول في كل يوم سبع مرات كفاه الله ما اهمه من امر داريه: حَسْبيَ الله رَبّيَ الله لا إلهَ إِلاّ هوَ عَليهِ تَوَكَّلْتُ وَهوَ رَبُّ العَرْشِ العَظيمِ. وروى أيضاً أن من قال كل يوم مرة في سنة كاملة هذا القول لم يمت حتى يرى مقعده في الجنة: سُبْحانَ الدّائِمِ القائِمِ سُبْحانَ القائِمِ الدّائِمِ سُبْحانَ الواحِدِ الاحَدِ سُبْحانَ الفَرْدِ الصَّمَدِ سُبْحانَ الحَيِّ القَيّومِ سُبْحانَ الله وَبِحَمْدِهِ سُبْحانَ الحَيّ الَّذِي لايَموتُ سُبْحانَ المَلِكِ القُدّوسِ سُبْحانَ رَبِّ المَلائِكَةِ وَالرّوحِ سُبْحانَ العَليّ الاعْلى سُبْحانَهُ وَتَعالى.',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
            ],
          ),
        ),
        bottomNavigationBar: AddCustomBottomNavigationBar(
          pushNext: FimaYata3alakBel8odat.screenRoute,
          pushBack: FiAzkarWda3awatTokra2Saba7anWamasa2an.screenRoute,
          soud: '',
          onTap: (double fontSize) {
            // تحديث حجم الخط
            setState(() {
              isTablet ? _fontSizeTablet = fontSize : _fontSize = fontSize;
            });
            print('fontSize: $fontSize');
            // إغلاق Dialog
            Navigator.of(context).pop();
          },
          onLongPress: () {
            final snackBar = SnackBar(
              content: Center(
                child: Text(
                  '${isTablet ? _fontSizeTablet.toInt() : _fontSize.toInt()}',
                  style: TextStyle(
                    color: Colors.white,
                    fontSize: 16,
                  ),
                ),
              ),
              width: 60,
              behavior: SnackBarBehavior.floating,
              backgroundColor: Colors.blue,
              duration: Duration(seconds: 2),
              shape: ShapeBorder.lerp(
                RoundedRectangleBorder(
                  borderRadius: BorderRadius.circular(50),
                ),
                RoundedRectangleBorder(
                  borderRadius: BorderRadius.circular(50),
                ),
                1,
              ),
            );
            ScaffoldMessenger.of(context).showSnackBar(snackBar);
          },
        ),
      ),
    );
  }
}
