import 'package:flutter/material.dart';
import 'package:maktabat_almoslim/widgets/container_scrollview.dart';
import 'package:provider/provider.dart';
import 'package:shared_preferences/shared_preferences.dart';

import '../../../widgets/add_custom_bottom_navigation_bar.dart';
import '../../../widgets/list_of_nine_verses.dart';
import '../../favorites_provider.dart';
import '../../favorites_screen.dart';
import '../nozor_men_a3mal_allail_walnahar.dart';
import 'alta3kibat_al3amaa.dart';
import 'fima_yod3a_bihi_fikol_sa3a_men_sa3at_alyawm.dart';

class FimaYata3alakBel8odat extends StatefulWidget {
  static String screenRoute = 'fima_yata3alak_bel8odat_screen';
  const FimaYata3alakBel8odat({super.key});

  @override
  State<FimaYata3alakBel8odat> createState() => _FimaYata3alakBel8odatState();
}

double _fontSize = 18;
double _fontSizeTablet = 30;

class _FimaYata3alakBel8odatState extends State<FimaYata3alakBel8odat> {
  bool isIcon = true;
  @override
  void initState() {
    super.initState();
    _loadFavoriteState();
  }

  Future<void> _loadFavoriteState() async {
    final prefs = await SharedPreferences.getInstance();
    bool? savedState =
        prefs.getBool('isFavorite_fima_yata3alak_bel8odat_screen');
    setState(() {
      isIcon = savedState ?? true;
    });
  }

  Future<void> _saveFavoriteState(bool value) async {
    final prefs = await SharedPreferences.getInstance();
    await prefs.setBool('isFavorite_fima_yata3alak_bel8odat_screen', value);
  }

  Future<bool> _onWillPop() async {
    final args =
        ModalRoute.of(context)!.settings.arguments as Map<String, dynamic>?;
    final previousPage = args?['previousPage'];
    if (previousPage == 'favorite_screen') {
      Navigator.of(context).pushReplacementNamed(FavoritesScreen.screenRoute);
      return false;
    } else {
      Navigator.of(context)
          .pushReplacementNamed(NozorMenA3malAllailWalnahar.screenRoute);
      return false;
    }
  }

  @override
  Widget build(BuildContext context) {
    double size = MediaQuery.of(context).textScaleFactor;
    final screenWidth = MediaQuery.of(context).size.width;
    final isTablet = screenWidth >= 600;
    return WillPopScope(
      onWillPop: _onWillPop,
      child: Scaffold(
        appBar: AppBar(
          toolbarHeight: isTablet ? 100 : 50,
          centerTitle: true,
          leading: IconButton(
            onPressed: _onWillPop,
            icon: Icon(
              Icons.arrow_back,
              size: isTablet ? 50 : 25,
            ),
          ),
          actions: [
            IconButton(
              padding: EdgeInsets.only(left: isTablet ? 50 : 30),
              icon: Icon(
                isIcon ? Icons.favorite_border : Icons.favorite_rounded,
                size: isTablet ? 40 : 25,
                color: isIcon ? Colors.black : Colors.red,
              ),
              onPressed: () async {
                setState(() {
                  isIcon = !isIcon;
                });
                await _saveFavoriteState(isIcon);

                if (!isIcon) {
                  Provider.of<FavoritesProvider>(context, listen: false)
                      .addFavorite(
                          'فيما يتعلق بالغداة ما بين الفجر وطلوع الشمس',
                          FimaYata3alakBel8odat.screenRoute);
                } else {
                  Provider.of<FavoritesProvider>(context, listen: false)
                      .removeFavorite(
                          'فيما يتعلق بالغداة ما بين الفجر وطلوع الشمس',
                          FimaYata3alakBel8odat.screenRoute,
                          FimaYata3alakBel8odat.screenRoute);
                }
              },
            ),
          ],
          title: Text(
            'فيما يتعلق بالغداة ما بين الفجر وطلوع الشمس',
            style: TextStyle(
              fontSize: isTablet
                  ? 40
                  : size > 1.0
                      ? 20
                      : 23,
              fontWeight: FontWeight.bold,
            ),
          ),
        ),
        body: ContainerScrollview(
          widget: Column(
            crossAxisAlignment: CrossAxisAlignment.start,
            children: [
              Container(
                child: Column(
                  children: [
                    Center(
                      child: Text(
                        'بسم الله الرحمن الرحيم',
                        style: TextStyle(
                          fontSize: isTablet ? _fontSizeTablet : _fontSize,
                          fontWeight: FontWeight.w900,
                        ),
                      ),
                    ),
                    Center(
                      child: Text(
                        'اللهم صلِّ على محمد وآل محمد',
                        style: TextStyle(
                          fontSize: isTablet ? _fontSizeTablet : _fontSize,
                          fontWeight: FontWeight.w900,
                        ),
                      ),
                    ),
                  ],
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: '',
                  subtitle:
                      'إعلم أن هذه الساعة من الساعات الشريفة ولنا في فضلها وفي الحثّ على الذكر والتسبيح والعباده فيها روايات كثيرة مأثورة عن أهل البيت (عليه السلام)، وقد عبّر عنها في بعض الروايات بساعة الغفلة، كما روي عن الباقر (عليه السلام) قال: إنّ ابليس عليه لعائن الله يبثُّ جنوده من حين تغيب الشمس وتطلع، فأكثروا ذكر الله عزَّ وجلَّ في هاتين الساعتين وتعوذوا بالله من شر إبليس وجنوده وعوّذوا صغاركم في هاتين السّاعتين فإنهما ساعتا غفلة، واعلم أنّه يكره النوم في هذه الساعة.\n\n'
                      'وعن الباقر (عليه السلام) أيضاً قال: نومة الغداة مشومة تطرد الرزق وتصفر اللّون وتغيّره وهو نومُ كلّ مشومٍ إن الله تعالى يقسم الأرزاق مابين طلوع الفجر إلى طلوع الشّمس، فإيّاكم وتلك النّومة وهذا الدعاء كما قال الطوسي في المصباح يدعى به عند طلوع الفجر الصادق:\n\n'
                      '[اللَّهُمَّ أَنْتَ صاحِبُنا فَصَلِّ عَلى مُحَمَّدٍ وَآلهِ، اللَّهُمَّ بِنِعْمَتِكَ تَتِمُّ الصّالِحاتُ فَصَلِّ عَلى مُحَمَّدٍ وَآلِهِ وَأَتْمِمْهَا عَلَيْنا، عائِذا بِالله مِنَ النّارِ، عائِذا بِالله مِنَ النّارِ، عائِذا بِالله مِنَ النّارِ ].\n\n'
                      'ثم تقول: [ يافالِقَهُ مِنْ حَيثُ لاأَرى، وَمُخْرِجَهُ مِنْ حَيْثُ أَرى، صَلِّ عَلى مُحَمَّدٍ وَآلِهِ وَاجْعَلْ أَوَّلَ يَوْمِنا هذا صَلاحا وَأَوْسَطَهُ فَلاحا وَاَّخِرَهُ نَجاحاً]. انتهى.\n\n'
                      'ثم تقول “عشر مرات”: [ اللَّهُمَّ إِنِّي أُشْهِدُكَ أَنَّهُ ما أَصْبَحَ بِي مِنْ نِعْمَةٍ أَوْ عافِيَةٍ فِي دِينٍ أَوْ دُنْيا فَمِنْكَ وَحْدَكَ لا شَرِيكَ لَكَ، لَكَ الحَمْدُ وَلَكَ الشُكْرُ بِها عَلَيَّ حَتّى تَرْضا وَبَعْدَ الرِّضا ].\n\n'
                      'والأذكار المأثورة في هذه الساعة سوى مامرّ كثير وأفضلها ذكر: [ سُبْحانَ الله وَالحَمْدُ لله وَلا إِلهَ إِلاّ الله وَاللهُ أَكْبَرُ]. الذي عبّر عنه في الحديث (الباقيات الصالحات).\n\n'
                      'وأيضاً أن يقول: [ لا إِلهَ إِلاّ الله وَحْدَهُ لا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الحَمْدُ، يُحْيي وَيُميتُ وَيُميتُ وَيُحْيي وَهُوَ حَيُّ لا يَمُوتُ، بِيَدِهِ الخَيْرُ وَهُوَ عَلى كُلِّ شَيٍ قَديرٌ ].\n\n'
                      'وقل إذا سمعت صوت الآذان عند الفجر: [ اللَّهُمَّ إِنِّي أَسْأَلُكَ بِإقْبالِ نَهارِكَ وَإِدْبارِ لَيْلِكَ وَحُضورِ صَلَواتِكَ وَأَصْواتِ دُعائِكَ وَتَسْبيحِ مَلائِكَتِكَ أَنْ تُصَلِّيَ عَلى مُحَمَّدٍ وَآلِ مُحَمَّدٍ، وَأَنَ تَتُوبَ عَليَّ إِنَّكَ أَنْتَ التَوّابُ الرَّحيمُ ].\n\n'
                      'وإذا شئت أن تصلّي واحتجت إلى التخلي لقضاء الحاجة فابدأ به، والمأثور من آداب التخلّي كثير نذكر منه ملخصاً: أن تقدّم رجلك اليسرى عند الدخول وتقول: [ بِسْمِ الله وَبالله ، أَعُوذُ بِالله مِنَ الرِّجْسِ النَّجِسِ الخَبيثِ المُخَبِّثِ الشَيطانِ الرَّجيمِ ]، وتنطق بالتسمية إذا كشفت ويجب عندئذ بل يجب وفي جميع الأحوال ستر العورة عن الناظر المحترم، ويحرم إذا قعد المرء للحاجة أن يستقبل القبلة أو يستدبرها، ويستحب أن يقول عند قضاء الحاجة: [ اللَّهُمَّ أَطْعِمْنِي طَيِّباً فِي عافِيَةٍ وَأَخْرِجْهُ مِنّي خَبيثاً فِي عافِيَةٍ ].\n\n'
                      'وقل إذا وقع نظرك على البراز: [ اللَّهُمَّ ارْزِقْنِي الحَلالَ وَجَنِّبْنِي الحَرامَ ].\n\n'
                      'وإذا أردت أن تستنجي، فاستبري أولاً ثم اقرأ دعاء رؤية الماء: [ الحَمْدُ لله الَّذِي جَعَلَ الماءَ طَهُوراً وَلَمْ يَجْعَلْهُ نَجِساً ].\n\n'
                      'وتقول عند الاستنجاء: [ اللَّهُمَّ حَصِّنْ فَرْجِي وَأَعْفِهِ وَاسْتُرْ عَوْرَتي وَحَرِّمنِي عَلى النّارِ ].\n\n'
                      'وتمسح بطنك إذا فرغت وقمت بيدك اليمنى وتقول: الحَمْدُ لله الَّذِي أَماطَ عَنِّي الأذى وَهَنّأَني طَعامي وَشَرابي وَعافاني مِنَ البَلوى.\n\n'
                      'ثم تخرح وتقدّم رجلك اليمنى وتقول: [ الحَمْدُ لله الَّذِي عَرَّفَني لَذَّتَه وَأَبْقى في جَسَدي قُوَّتَه وَأخْرَجَ عَنِّي أَذاهُ، يالَها نِعمَةً يالَها نِعمَةً يالَها نِعمَةً لا يَقْدِرُ الْقادِرُونَ قَدْرَها ].\n\n'
                      'وتبدأ بالإستياك إذا أردت الوضوء فإنّه يطهر الفم ويزيل البلغم ويقوي الذّاكرة ويزيد في الحسنات ويرضي الرب تعالى، والصلاة مع الإستياك ركعتين أفضل من سبعين ركعة بدونه، ويجزي الإصبع إذا لم يتيسّر المسواك، وينبغي أن يجلس عند الوضوء مستقبلاً القبلة ويضع الإناء على يمينه ويقول إذا نظر إلى الماء: [ الحَمْدُ لله الَّذِي جَعَلَ لماء طَهُوراً وَلَمْ يَجْعَلْهُ نَجِساً ].\n\n'
                      'ثم تغسل يدك قبلما تدخلها في الإناء وتقول إذا أدخلت يدك فيه: [ بِسْمِ الله وَبِالله اللَّهُمَّ اِجْعَلْني مِنَ التَوّابينَ وَاجْعَلني مِنَ المُتَطَهِّرينَ ].\n\n'
                      'ثم تمضمض “ثلاث مرات” بثلاث أكف من الماء وتقول: [ اللَّهُمَّ لَقّنِي حُجَّتِي يَوْمَ ألْقاكَ وَأطْلِقْ لِساني بِذِكْراكَ ].\n\n'
                      'ثم تستنشق “ثلاث مرات” وتقول: [ اللَّهُمَّ لاتُحَرِّمْ عَليَّ ريحَ الجَنَةَ وَاجْعَلْني مِمَّنْيَشَمُّ ريحَها وَرَوْحَها وَطَيبَها ].\n\n'
                      'ثم تبدأ بغسل الوجه وتقول: [ اللَّهُمَّ بَيِّضْ وَجْهي يَوْمَ تَسْوَدُّ الوُجُوهُ وَلاتُسوّدْ وَجْهي يَوْمَ تَبْيَضّ الوجُوهُ ].\n\n'
                      'ثم تأخذ كفا من الماء لغسل اليد اليمنى وتقول عند الغسل: [ اللَّهُمَّ أعطِني كِتابِي بِيَمِيني وَالخُلْدَ في الجِنانِ بيَسارِي وَحاسِبْني حِسابا يَسيراً ].\n\n'
                      'ثم تغسل اليسرى وتقول: [ اللَّهُمَّ لاتُعْطِني كِتابي بِشمالي وَلا مِنْ وَراءِ ظَهْري وَلاتَجْعَلْها مَغْلُولَةً إِلى عُنِقي وَأعُوُذ بِكَ مِنْ مُقَطِّعاتِ النِّيرانِ ].\n\n'
                      'ثم تمسح مقدّم رأسك ببلّة يمناك وتقول: اللَّهُمَّ غَشّنِي رَحْمَتَكَ وَبَرَكاتِكَ.\n\n'
                      'ثم امسح برجليك وقل وأنت تمسح: [ اللَّهُمَّ ثَبّتْنِي عَلى الصِّراطِ يَوْمَ تَزِلُّ فِيهِ الاقْدامُ وَاجْعَلْ سَعْيي فِيما يُرْضِيكَ عَنِّي ياذَا الجَلالِ وَالإكْرامِ ].\n\n'
                      'وقل إذا فرغت من الوضوء: [ اللَّهُمَّ إِنِّي أَسْأَلُكَ تَمامَ الوُضُؤِ وَتَمامَ الصَّلاةِ وَتَمامَ رِضْوانِكْ وَالجَنَّةَ ].\n\n'
                      'وتقول أيضاً: [ الحَمْدُ لله رَبِّ العالَمينَ ].\n\n'
                      'واقرأ سورة القدر “ثلاث مرات” واستعمل طيباً إذا فرغت من الوضوء، ثم سر إلى المسجد وعليك السّكينة والوقار وقل عند خروجك من الدار للذهاب إلى المسجد: [ بِسْمِ الله الَّذِي خَلَقَني فَهْوَ يَهْدِيني وَالَّذِي هُوَ يُطْعِمُني وَيَسْقِيني وَإذا مَرِضْتُ فَهُوَ يَشْفِينِ، وَالَّذِي يُمِيتَني ثُمَّ يُحْيينِ وَالَّذِي أطمَعُ أنْ يَغْفَرَ لِي خَطِيئَتي يَوْمَ الدِّينِ رَبِّ هَبْ لِي حُكْما وَالحِقْنِي بالصّالِحِينَ وَاجْعَلْ لِي لِسانَ صِدْقٍ فِي الاخَرِينَ وَاجْعَلْ لِي مِن وَرَثَةِ جَنَّةِ النَعِيمِ وَاغْفِرْ لأبِي ].\n\n'
                      'وإذا أردت أن تدخل المسجد فلاحظ كعب حذائك واحذر أن تكون نجاسة عالقة به، ثم قدّم رجلك اليمنى وقل: [ بِسْمِ الله وَبِالله وَمِنَ الله وإِلى الله وَخَيرُ الاسَّماء كُلِّها للّهِ، تَوَكَلْتُ عَلى الله وَلاحَوْلَ وَلاقُوَةَ إِلاّ بِالله ، اللَّهُمَّ صَلِّ عَلى مُحَمَّدٍ وَآل مُحَمَّدٍ وَافْتَحْ لِي أبوابَ رَحْمَتِكَ وَتَوْبَتِكَ وَاغْلِقْ عَنِي أبْوابَ مَعْصِيَتِكَ، وَاجْعَلْنِي مِنْ زُوارِكَ وَعُمّارِ مَساجِدِكَ وَمِمَّنْ يُناجِيكَ في اللَّيلِ وَالنَهارِ وَمِنَ الَّذينَ هُمْ فِي صَلَواتِهِمْ خاشِعُونَ، وَادْحَرْ عَنِّي الشَيْطانَ الرَّجيمَ وَجُنُودَ ابْليسَ أجْمَعينَ ].\n\n'
                      'وقل إذا أردت أن تُصلي: [ اللَّهُمَّ إِنِّي أُقَدِّمُ إِلَيكَ مُحَمَّداً صَلّى الله عَلَيْهِ وَآلِهِ بَيْنَ يَدَيْ حاجَتي، وَأتَوَجَهُ بِهِ إِلَيْكَ فَاجْعَلْني بِه وَجيها عِنْدَكَ في الدُّنيا وَالاخِرَةِ وَمِنَ المُقَرَبينَ، واجْعَلْ صَلاتي بِهِ مَقْبولَةً وَذَنْبي بِهِ مَغْفُوراً وَدُعائي بِهِ مُسْتَجابا، إِنَّكَ أنْتَ الغَفُورُ الرَّحيمَ ].\n\n'
                      'ثم تؤذن للصلاة وتقيم، وتفصل بينهما بسجدة أو جلسة وتقول: [ اللَّهُمَّ اجْعَلْ قَلْبي بارّاً وَعَيْشي قارّاً وَرِزْقي دارّاً، واجْعَلْ لي عِنْدَ قَبْرِ رَسولِكِ صَلّى الله عَلَيْهِ وَآله مُسْتَقَرّا وَقَراراً ].\n\n'
                      'وتدعو بما شئت وتسأل الله عزَّ وجلَّ ما تريد فإنه لا يرد بين الآذان والإقامة دعاء وتقول بعدما أقمت: [ اللَّهُمَّ إلَيْكَ تَوَجَهْتُ وَمَرْضاتَكَ طَلَبْتُ وَثَوابَكَ ابْتَغَيتُ وَبِكَ آمَنْتُ وَعَلَيْكَ تَوَكَلْتُ، اللَّهُمَّ صَلِّ عَلى مُحَمَّدٍ وَآل مُحَمَّدٍ وَافْتَحْ مَسامِعَ قَلْبي لِذِكْرِكَ وَثَبِّتْنِي عَلى دِينِكَ وَلاتُزِغْ قَلْبي بَعْدَ إذْ هَدَيْتَني وَهَبْ لِي مِنْ لَدُنْكَ رَحْمَةً إنَّكَ أنْتَ الوَهّابُ ].\n\n'
                      'ثم استعدّ للصلاة وأقبل عليها بقلبك واعطف انتباهك إلى ذلة مقامك وإلى عظمة مولاك الذي تناجيه وجلاله، وكن كأنك تراه واستحي من أن تكلّمه بلسانك وأنت تتجه بقلبك إلى غيره، ثم قف بوقار وخشوع واضعا يديك على فخذيك قبال ركبتيك وافصل بين قدميك قدر ثلاث أصابع منفرجات إلى شبر، وألق نظرك إلى موضع سجودك، ثم إنو فريضة الفجر قربة إلى الله تعالى وكبّر تكبيرة الإحرام.\n\n'
                      'ويستحبّ أن تضيف إليها ست تكبيرات أُخر ترفع يديك في كل تكبيرة إلى حيال شحمة أذنيك موجّها باطن كفّيك إلى القبلة ولتكن أصابعك متصلة غير منفرجة سوى الابهام وادع بأدعية التكبيرات وهي أن تقول بعد التكبيرة الثالثة:\n\n'
                      '[ اللَّهُمَّ أنْتَ المَلِكُ الحَقْ المُبينُ لا إلهَ إِلاّ أنْتَ سُبْحانَكَ إِنِّي ظَلَمْتُ نَفْسي فَاغْفِرْ لِي ذَنْبِي، إنَّهُ لايَغْفِرُ الذُّنوبَ إِلاّ أنْتَ، وتقول بعد الخامسة: لَبَّيْكَ وَسَعْدَيْكَ وَالخَيْرُ في يَدَيْكَ وَالشَّرُ لَيْسَ إلَيْكَ وَالمَهْدِيُّ مِنْ هَدَيْتَ عَبْدُكَ وَإبْنُ عَبْدَيْكَ ذَليلٌ بَيْنَ يَدَيْكَ مِنْكَ وَبِكَ وَلَكَ وَإليكَ لا مَلْجَأ وَلا مَنْجاً وَلا مَفَرَّ مِنْكَ إِلاّ إِلَيْكَ، سُبْحانَكَ وَحَنانَيْكَ تَبارَكْتَ وَتَعالَيْتَ سُبْحانَكَ رَبَّ البَيْتِ الحَرام، وتقول بعد السابعة: وَجَّهْتُ وَجْهيَ لِلَّذي فَطَرَ السَّماواتِ وَالأرضِ عالِمِ الغَيْبِ وَالشَّهادَةِ حَنيفا مُسْلِما وَما أنا مِنَ المُشْركين إِنَّ صَلاتي وَنُسُكي وَمَحْيايَ وَمَماتِي لله رَبِّ العالَمينَ لا شَريكَ لَه وَبِذلِكَ أُمِرْتُ وَأنا مِنَ المُسْلِمينَ ]. ثم خافت بالاستعاذة قبل القراءة ثم أقرأ سورة الحمد متأدباً بجميع الآداب مقبلاً بقلبك متدبراً في معانيه واصمت إذا فرغت منها مقدار النَّفَس ثم اقرأ سورة من القرآن الكريم وينبغي أن تكون من أمثال سورة عمّ وهل أتى ولا أقسم، ثم تسكت أيضاً قدر النفس، ثم ترفع يديك بالتكبير إلى شحمة أذنيك على ما مضي.\n\n'
                      'ثم تركع وتضع يدك اليمنى على ركبتك اليمنى ثم تضع اليسرى على اليسرى وتفرج أصابع يديك وتملاهما بركبتيك وتحني ظهرك وتمد عنقك في مستوى ظهرك وتلقي بنظرك إلى مابين قدميك وقل: [ سُبْحانَ رَبِّيَ العَظيمِ وَبِحَمْدِهِ ].\n\n'
                      'وينبغي أن تكرر هذا الذكر “سبعاً ” أو “خمساً ” أو “ثلاثاً ” وأن تقول قبل الذكر: [ اللَّهُمَّ لَكَ رَكَعْتُ وَلَكَ أسْلَمْتُ وَبِكَ آمَنْتُ وَعَلَيْكَ تَوَكَلْتُ وَأنْتَ رَبِّي خَشَعَ لَكَ سَمْعِي وَبَصَري وَشَعْري وَبَشَري وَلَحْمي وَدَمي وَمُخّي وَعَصَبي وَعِظامي وَما أقْلَمَتْهُ قَدَمايَ، غَيْرَ مُسْتَنْكِفٍ وَلا مُسْتَكْبِرٍ وَلا مُسْتَحْسِرٍ ]، ثم ارفع رأسك من الركوع وقف وقل: [ سَمِعَ الله لِمَنْ حَمِدَهُ ]. ثم كبّر وأهو إلى السجود وأنت خاضع خاشع غاية الخضوع والخشوع وابسط كفّيك وضعهما على الأرض قبل وضع ركبتيك واسجد على تربة الحسين (عليه السلام) واذكر ذكر السجود والأفضل أن تكرر “سبعاً ” أو “خمساً ” أو “ثلاثاً ” وقل قبل الذكر: [ اللَّهُمَّ لَكَ سَجَدْتُ وبِكَ آمَنْتُ وَلَكَ أسْلَمْتُ وَعَلَيْكَ تَوَكَلْتُ وَأنْتَ رَبّي، سَجَدَ وَجْهي لِلَّذي خَلَقَهُ وَشَقَّ سَمْعَهُ وَبَصَرَهُ الحَمْدُ لله رَبِّ العالَمينَ تَبارَكَ الله أحْسَنَ الخالِقينَ. ثم أئت بالذّكر وارفع رأسك من السجود واجلس ويستحب التكبير حينئذ والجلوس متوركا وقل: أسْتَغْفِرُ الله رَبّي وَأتُوبُ إلَيْهِ. وتقول أيضا: اللَّهُمَّ اغْفِرْ لي وارْحَمْني وَأجِرْني وَادْفَعْ عَنِّي وَعافِني، إِنِّي لِما أَنْزَلْتَ إِليَ مِنْ خْيرٍ فَقيرٌ تَبارَكَ الله رَبُّ العالَمينَ ].\n\n'
                      'ثم كبّر واهو إلى السجدة الثانية واعمل مثل ما عملت في الأولى، ثم ارفع رأسك واجلس جلسة الاستراحة، ثم قم وقل وأنت تقوم: [ بِحَوْلِ الله وَقوَتِهِ أَقُومُ وَأَقْعُدْ ].\n\n'
                      'فإذا استقررت قائماً فاقرأ الحمد وسورة غيرها والأفضل اختيار سورة التوحيد، ويستحب أن تقول بعد التوحيد: [ كَذلِكَ الله رَبّي ] “ثلاث مرات”.\n\n'
                      'ثم تكبّر وترفع يديك للقنوت إلى حيال وجهك وتوجّه باطن راحتيك نحو السماء وتضم أصابعك ولا تفرجها سوى الابهام، وينبغي أن تختار للقنوت كلمات الفرج، وتقول بعد ذلك: [ اللَّهُمَّ اغْفِرْ لَنا وَارْحَمْنا وَعافِنا وَأعْفُ عَنّا في الدُّنْيا وَالاخِرَةَ إِنَّكَ عَلى كُلِّ شَيٍ قَديرٌ ].\n\n'
                      'ثم تقول: [ اللَّهُمَّ مَنْ كانَ أصْبَحَ وَلَهُ ثِقَةٌ أو رَجاءٌ غَيْرُكَ فَأَنْتَ ثِقَتي وَرَجائي. ياأَجْوَدَ مَنْ سُئِلْ وَياأرْحَمَ مَنْ اسْتُرْحِمْ صَلِّ عَلى مُحَمَّدٍ وَآل مُحَمَّدٍ، وَارْحَمْ ضُعْفي وَمَسْكَنَتي وَقِلَّةَ حيلَتي وَامْنُنْ عَليَّ بالْجَنَّةِ طَوْلاً مِنْكَ وَفُكَّ رَقَبَتي مِنَ النّارِ وَعافِني في نَفْسي وَفي جَميعِ اموري بِرَحْمَتِكَ ياأرْحَمَ الرّاحِمينَ ].\n\n'
                      'وينبغي إطالة القنوت وأدعية القنوت كثيرة. ثم تكبّر وتركع وتسجد كما مضي، وإذا فرغت من السّجدتين فتجلس للتشهّد والتسليم، ويستحب أن تجلس متوركا وأن تقول قبل التشهد: بِسْمِ الله وَبالله وَالحَمْدُ لله وَخَيْرُ الاَسَّماء لله أشْهَدُ أنْ لا إلهَ ألا اللّهُ. وإذا فرغت من الصلاة فابدأ في التعقيب فالأمر به في الاحاديث كثير ومؤكد وقال الله تعالى: فَاذا فَرَغْتَ فانْصَبْ وإِلى رَبِّكَ فَارْغَبْ. وروي في تفسير الآية: إذا فرعت من الصلاة فأتعب نفسك بالدعاء وارغب إلى ربك وسله حاجتك واقطع رجاءك عمّن سواه.\n\n'
                      'وعن أمير المؤ منين (عليه السلام) قال: إذا فرغ أحدكم من الصلاة فليرفع يديه إلى السماء وليتعب نفسه بالدعاء، والمستفاد من الروايات أنّ التعقيب يوجب الزّيادة في الرزق وأنّ المؤمن يعدّ مصلِّيا وكتب له ثواب الصلاة ماكان مشتغلاً بذكر الله بعد الصلاة، والدعاء بعد الفريضة أفضل مما بعد النافلة وبعده : وَالحَمْدُ لله رَبِّ العالَمينَ.\n\n'
                      'قال العلامة المجلسي رض: إنّ التعقيب على مايظهر من لفظه هو القرآن والدّعاء والذكر المتّصلة بالصلاة عرفا والافضل أن يكون المعقّب على وضؤ مستقبلاً القبلة، والاحسن أن يجلس على هيئة المتشهد، وأن لايتكلم في أثناء التعقيب لاسيّما في تعقيب فريضة العشاء، وذهب البعض إلى لزوم مراعاة جميع شرائط الصلاة في التعقيب، ولكن الظاهر أن المر يثاب ثواب التعقيب في الجملة إذا اشتغل بعد الصلاة بالقرآن والذكر والدّعاء ولو ماشيا.\n\n'
                      'أقول: قد ورد عن الأئمة الاطهار (عليهم السلام) للتعقيب أدعية كثيرة للدنيا والاخرة. والصلاة هي أشرف العبادات الجوارحية ولتعقيباتها المأثورة أثر بالغ في تكميلها وتتميمها، كما أنها تورث رفع الدرجات والحطّ من السيّئات وحصول المطالب والحاجات، وهذا ماحملني على أن أورد نبذا منها هنا في هذه الرسالة اقتباسا في الاغلب من كتابي (البحار) و(المقباس) للعلامة المجلسي عطر الله مرقده الشريف.',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
            ],
          ),
        ),
        bottomNavigationBar: AddCustomBottomNavigationBar(
          pushNext: Alta3kibatAl3amaa.screenRoute,
          pushBack: FimaYod3aBihiFikolSa3aMenSa3atAlyawm.screenRoute,
          soud: '',
          onTap: (double fontSize) {
            // تحديث حجم الخط
            setState(() {
              isTablet ? _fontSizeTablet = fontSize : _fontSize = fontSize;
            });
            print('fontSize: $fontSize');
            // إغلاق Dialog
            Navigator.of(context).pop();
          },
          onLongPress: () {
            final snackBar = SnackBar(
              content: Center(
                child: Text(
                  '${isTablet ? _fontSizeTablet.toInt() : _fontSize.toInt()}',
                  style: TextStyle(
                    color: Colors.white,
                    fontSize: 16,
                  ),
                ),
              ),
              width: 60,
              behavior: SnackBarBehavior.floating,
              backgroundColor: Colors.blue,
              duration: Duration(seconds: 2),
              shape: ShapeBorder.lerp(
                RoundedRectangleBorder(
                  borderRadius: BorderRadius.circular(50),
                ),
                RoundedRectangleBorder(
                  borderRadius: BorderRadius.circular(50),
                ),
                1,
              ),
            );
            ScaffoldMessenger.of(context).showSnackBar(snackBar);
          },
        ),
      ),
    );
  }
}
