import 'package:flutter/material.dart';
import 'package:maktabat_almoslim/widgets/container_scrollview.dart';
import 'package:provider/provider.dart';
import 'package:shared_preferences/shared_preferences.dart';

import '../../../../widgets/add_custom_bottom_navigation_bar.dart';
import '../../../../widgets/list_of_nine_verses.dart';
import '../../../favorites_provider.dart';
import '../../../favorites_screen.dart';
import '../ziyarat_alnabi_walzahraa_wal2a2ima.dart';
import 'alwada3.dart';
import 'ziyarat_alnabi.dart';

class ZiyaratAlnabiWalzahraaWal2a2imaBelbaki3 extends StatefulWidget {
  static String screenRoute =
      'ziyarat_alnabi_walzahraa_wal2a2ima_belbaki3_screen';
  const ZiyaratAlnabiWalzahraaWal2a2imaBelbaki3({super.key});

  @override
  State<ZiyaratAlnabiWalzahraaWal2a2imaBelbaki3> createState() =>
      _ZiyaratAlnabiWalzahraaWal2a2imaBelbaki3State();
}

double _fontSize = 18;
double _fontSizeTablet = 30;

class _ZiyaratAlnabiWalzahraaWal2a2imaBelbaki3State
    extends State<ZiyaratAlnabiWalzahraaWal2a2imaBelbaki3> {
  bool isIcon = true;
  @override
  void initState() {
    super.initState();
    _loadFavoriteState();
  }

  Future<void> _loadFavoriteState() async {
    final prefs = await SharedPreferences.getInstance();
    bool? savedState = prefs.getBool(
        'isFavorite_ziyarat_alnabi_walzahraa_wal2a2ima_belbaki3_screen');
    setState(() {
      isIcon = savedState ?? true;
    });
  }

  Future<void> _saveFavoriteState(bool value) async {
    final prefs = await SharedPreferences.getInstance();
    await prefs.setBool(
        'isFavorite_ziyarat_alnabi_walzahraa_wal2a2ima_belbaki3_screen', value);
  }

    Future<bool> _onWillPop() async {
    final args =
        ModalRoute.of(context)!.settings.arguments as Map<String, dynamic>?;
    final previousPage = args?['previousPage'];
    if (previousPage == 'favorite_screen') {
      Navigator.of(context).pushReplacementNamed(FavoritesScreen.screenRoute);
      return false;
    } else {
      Navigator.of(context).pushReplacementNamed(ZiyaratAlnabiWalzahraaWal2a2ima.screenRoute);
      return false;
    }
  }

  @override
  Widget build(BuildContext context) {
    double size = MediaQuery.of(context).textScaleFactor;
    final screenWidth = MediaQuery.of(context).size.width;
    final isTablet = screenWidth >= 600;
    return WillPopScope(
      onWillPop: _onWillPop,
      child: Scaffold(
        appBar: AppBar(
          toolbarHeight: isTablet ? 100 : 50,
          centerTitle: true,
          leading: IconButton(
            onPressed: _onWillPop,
            icon: Icon(
              Icons.arrow_back,
              size: isTablet ? 50 : 25,
            ),
          ),
          actions: [
            IconButton(
              padding: EdgeInsets.only(left: isTablet ? 50 : 30),
              icon: Icon(
                isIcon ? Icons.favorite_border : Icons.favorite_rounded,
                size: isTablet ? 40 : 25,
                color: isIcon ? Colors.black : Colors.red,
              ),
              onPressed: () async {
                setState(() {
                  isIcon = !isIcon;
                });
                await _saveFavoriteState(isIcon);
      
                if (!isIcon) {
                  Provider.of<FavoritesProvider>(context, listen: false).addFavorite(
                      'زيارة النبي والزهراء والائمة بالبقيع صلوات الله عليهم أجمعين في المدينة الطيبة',
                      ZiyaratAlnabiWalzahraaWal2a2imaBelbaki3.screenRoute);
                } else {
                  Provider.of<FavoritesProvider>(context, listen: false)
                      .removeFavorite(
                          'زيارة النبي والزهراء والائمة بالبقيع صلوات الله عليهم أجمعين في المدينة الطيبة',
                          ZiyaratAlnabiWalzahraaWal2a2imaBelbaki3.screenRoute,
                          ZiyaratAlnabiWalzahraaWal2a2imaBelbaki3.screenRoute);
                }
              },
            ),
          ],
          title: Text(
            'زيارة النبي والزهراء والائمة بالبقيع صلوات الله عليهم أجمعين في المدينة الطيبة',
            style: TextStyle(
              fontSize: isTablet
                  ? 40
                  : size > 1.0
                      ? 20
                      : 23,
              fontWeight: FontWeight.bold,
            ),
          ),
        ),
        body: ContainerScrollview(
          widget: Column(
            crossAxisAlignment: CrossAxisAlignment.start,
            children: [
              Container(
                child: Column(
                  children: [
                    Center(
                      child: Text(
                        'بسم الله الرحمن الرحيم',
                        style: TextStyle(
                          fontSize: isTablet ? _fontSizeTablet : _fontSize,
                          fontWeight: FontWeight.w900,
                        ),
                      ),
                    ),
                    Center(
                      child: Text(
                        'اللهم صلِّ على محمد وآل محمد',
                        style: TextStyle(
                          fontSize: isTablet ? _fontSizeTablet : _fontSize,
                          fontWeight: FontWeight.w900,
                        ),
                      ),
                    ),
                  ],
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: '',
                  subtitle:
                      'اعلم انّه يستحبّ أكيداً لكافة النّاس ولا سيّما للحجّاج أن يتشرّفوا بزيارة الرّوضة الطّاهرة والعتبة المنوّرة لمفخرة الدّهر مولانا سيّد المرسلين محمّد بن عبد الله صلوات الله وسلامُه عليه، وترك زيارته جفاء في حقّه يوم القيامة.\n\n'
                      'وقال الشّهيد (رحمه الله) : فإن ترك النّاس زيارته فعلى الامام أن يجبرهم عليها، فان ترك زيارته جفاء محرّم، روى الصّدوق عن الصّادق (عليه السلام) : اذا حجّ أحدكم فليختم حجّه بزيارتنا لانّ ذلك من تمام الحجّ، وروي ايضاً عن امير المؤمنين (عليه السلام)قال : اتمّوا بزيارة رسول الله (صلى الله عليه وآله وسلم) حجّكم فانّ تركه بعد الحجّ جفاء وبذلك أمرتم واتمّوه بالقبُور التي ألزمكم الله عزوجل حقّها وزيارتها واطلبوا الرّزق عندها.\n\n'
                      'وروي أيضاً عن أبي الصّلت الهروي قال : قلت للرّضا (عليه السلام) : ياابن رسول الله ما تقول في الحديث الّذي يرويه أهل الحديث انّ المؤمنين يزورون ربّهم من منازلهم في الجنّة ـ ويعني الرّاوي بسؤاله انّ الرّواية إن صحّت ما معناها وهي بظاهرها تحتوي على ما لا يستقيم مع الاعتقاد الحقّ ـ فأجابه (عليه السلام) فقال : يا أبا الصّلت انّ الله تبارك وتعالى فضّل نبيّه محمّد (صلى الله عليه وآله وسلم) على جميع خلقه من النّبيّين والملائكة، وجعل طاعته طاعته ومبايعته مُبايعته وزيارته زيارته ، فقال الله عزوجل : « مِنْ يُطِعِ الرَّسُولَ فَقَدْ اَطاعَ اللهَ » وَقالَ : « اِنَّ الَّذينَ يُبايِعُونَكَ اِنَّما يُبايِعُونَ اللهَ يَدُ اللهِ فَوْقَ اَيْديهِمْ » ، وقال النّبي (صلى الله عليه وآله وسلم) : مَن زارني في حياتي أو بعد مماتي فقد زار الله تعالى الخ.\n\n'
                      'وروى الحميري في قُرب الاسناد عن الصّادق (عليه السلام) عن النّبي (صلى الله عليه وآله وسلم) قال : من زارني حيّاً أو ميّتاً كنت له شفيعاً يوم القيامة.\n\n'
                      'وفي الحديث انّه شهد الصّادق (عليه السلام) عيداً بالمدينة فانصرف فدخل على النّبي (صلى الله عليه وآله وسلم) فسلّم عليه ثمّ قال لِمن حضره امّا لقد فضّلنا على أهل البلدان كلّهم مكّة فمن دُونها لسلامنا على رسول الله (صلى الله عليه وآله وسلم).\n\n'
                      'وروى الطّوسي (رحمه الله) في التّهذيب عن يزيد بن عبد الملك عن أبيه عَن جدّه انّه قال : دخلت على فاطمة (عليها السلام) فبدأتني بالسّلام ثمّ قالت : ما غدا بِكَ ، قلت : طلب البركة ، قالت : اخبرني أبي وهُو ذا هُو انّه من سلّم عليه وعليّ ثلاثة أيّام أوجب الله له الجنّة ، قلت لها : في حياته وحياتك ؟ قالت : نعم وبعد موتنا.\n\n'
                      'قال العلامة المجلسي (رحمه الله) : روي في حديث مُعتبر عن عبد الله بن عبّاس عن رسول الله (صلى الله عليه وآله وسلم) قال : مَنْ زار الحسن (عليه السلام) بالبقيع ثبت قدمه على الصّراط يوم تزُول فيه الاقدام ، وفي المقنعة عن الصّادق (عليه السلام) : من زارني غفرت ذنُوبه ولم يصب بالفقر والفاقة . وروى الطّوسي في التّهذيب عن الامام الحسن العسكري (عليه السلام) قال : من زار جعفر الصّادق وأباه لم يشكُ عينه ولم يصبه سقم ولم يمت مبتلى . وروى ابن قولويه في الكامل في حديث طويل عن هشام بن سالم عن الصّادق (عليه السلام) انّه أتاه رجل فقال : هل يزار والدك ؟ فقال : نعم ، قال : فما لمن زاره ؟ قال : الجنّة إن كان يأتمّ به ، قال : فما لمن تركه رغبة عنه ، قال : الحسرة يوم الحسرة الخ، والاحاديث في ذلك كثيرة حَسبنا منها ما ذكرناه.\n\n'
                      'وأمّا كيفيّة زيارة النّبي (صلى الله عليه وآله وسلم) فهي كما يلي :\n\n'
                      'اذا وردت ان شاء الله تعالى مدينة النّبي (صلى الله عليه وآله وسلم) فاغتسل للزّيارة فاذا أردت دخول مسجده (صلى الله عليه وآله وسلم) فقف على الباب واستأذن بالاستئذان الاوّل ممّا ذكرناه وادخل من باب جبرئيل وقدّم رجلك اليُمنى عند الدّخول ثمّ قل : اَللهُ اَكْبَرُ مائة مرّة، ثمّ صلّ ركعتين تحيّة المسجد، ثمّ امض الى الحجرة الشّريفة فاذا بلغتها فاستلمها بيدك وقبّلها وقُل :\n\n'
                      'اَلسَّلامُ عَلَيْكَ يا رَسُولَ اللهِ، اَلسَّلامُ عَلَيْكَ يا نَبِيَّ اللهِ، اَلسَّلامُ عَلَيْكَ يا مُحَمَّدَ بْنَ عَبْدِ اللهِ، اَلسَّلامُ عَلَيْكَ يا خاتَمَ النَّبِيّينَ، اَشْهَدُ اَنَّكَ قَدْ بَلَّغْتَ الرِّسالَةَ، وَاَقَمْتَ الصَّلاةَ، وَآتَيْتَ الزَّكاةَ، وَاَمَرْتَ بِالْمَعْرُوفِ، وَنَهَيْتَ عَنِ الْمُنَكَرِ، وَعَبَدْتَ اللهَ مُخْلِصاً حَتّى اَتاكَ الْيَقينُ، فَصَلَواتُ اللهِ عَلَيْكَ وَرَحْمَتُهُ وَعَلى اَهْلِ بَيْتِكَ الطّاهِرينَ، ثمّ قف عند الاُسطوانة المقدّمة من جانب القبر الايمن مُستقبل القبلة ومنكبك الايسر الى جانب القبر ومنكبك الايمن ممّا يلي المنبر فانّه موضِعُ رأس النّبي (صلى الله عليه وآله وسلم) وقل :\n\n'
                      'اَشْهَدُ اَنْ لا اِلـهَ اِلاَّ اللهُ وَحْدَهُ لا شَريكَ لَهُ، وَاَشْهَدُ اَنَّ مُحَمَّداً عَبْدُهُ وَرَسُولُهُ، وَاَشْهَدُ اَنَّكَ رَسُولُ اللهِ، وَاَنَّكَ مُحَمَّدُ بْنُ عَبْدِ اللهِ، وَاَشْهَدُ اَنَّكَ قَدْ بَلَّغْتَ رِسالاتِ رَبِّكَ، وَنَصَحْتَ لاُِمَّتِكَ، وَجاهَدْتَ في سَبيلِ اللهِ، وَعَبَدْتَ اللهَ حَتّى اَتاكَ الْيَقينُ بِالْحِكْمَةِ وَالْمَوْعِظَةِ الْحَسَنَةِ، وَاَدَّيْتَ الَّذي عَلَيْكَ مِنَ الْحَقِّ، وَاَنَّكَ قَدْ رَؤُفْتَ بِالْمُؤْمِنينَ، وَغَلُظْتَ عَلَى الْكافِرينَ، فَبَلَّغَ اللهُ بِكَ اَفْضَلَ شَرَفِ مَحَلِّ الْمُكَرَّمينَ، اَلْحَمْدُ للهِ الَّذي اِسْتَنْقَذَنا بِكَ مِنَ الشِّرْكِ وَالضَّلالَةِ، اَللّـهُمَّ فَاجْعَلْ صَلَواتِكَ، وَصَلَواتِ مَلائِكَتِكَ الْمُقَرَّبينَ، وَاَنْبِيائِكَ الْمُرْسَلينَ، وَعِبادِكَ الصّالِحينَ، وَاَهْلِ السَّماواتِ وَالاَْرَضينَ، وَمَنْ سَبَّحَ لَكَ يا رَبَّ الْعالَمينَ مِنَ الاَْوَّلينَ وَالاْخِرينَ عَلى مُحَمَّد عَبْدِكَ وَرَسُوِلِكَ وَنَبِيِّكَ وَاَمينِكَ وَنَجِيِّكَ وَحَبيبِكَ وَصَفِيِّكَ وَخاصَّتِكَ وَ صَفْوَتِكَ وَخِيَرَتِكَ مِنْ خَلْقِكَ، اَللّـهُمَّ اَعْطِهِ الدَّرَجَةَ الرَّفيعَةَ، وَآتِهِ الْوَسيلَةَ مِنَ الْجَّنَةِ، وَابْعَثْهُ مَقاماً مَحْمُوداً يَغْبِطُهُ بِهِ الاَْوَّلُونَ وَالاْخِرُونَ، اَللّـهُمَّ اِنَّكَ قُلْتَ: (وَلَوْ اَنَّهُمْ اِذْ ظَلَمُوا اَنْفُسَهُمْ جاؤُكَ فَاسْتَغْفَرُوا اللهَ وَاسْتَغْفَرَ لَهُمُ الرَّسُولُ لَوَجَدُوا اللهَ تَوّاباً رَحيماً) وَاِنّي اَتَيْتُكَ مُسْتَغْفِرًا تائِباً مِنْ ذُنُوبي، وَاِنّي اَتَوَجَّهُ بِكَ اِلَى اللهِ رَبّي وَرَبِّكَ لِيَغْفِرَ لي ذُنُوبي.\n\n'
                      'فإن كانت لك حاجة فانّه احرى أن تقضى ان شاء الله تعالى.\n\n'
                      'وروى ابن قولويه بسند معتبر عن محمّد بن مسعود قال : رأيت الصّادق (عليه السلام) انتهى الى قبر النّبي (صلى الله عليه وآله وسلم)فوضع يده عليه وقال : اَسْاَلُ اللهَ الَّذي اجْتَباكَ وَاخْتارَكَ وَهَداكَ وَهَدى بِكَ اَنْ يُصَلِّيَ عَلَيْكَ ثمّ قال : اِنَّ اللهَ وَمَلائِكَتَهُ يُصَلُّونَ عَلَى النَّبِىِّ يا اَيُّها الَّذينَ آمَنُوا صَلُّوا عَلَيْهِ وَسَلِّمُوا تَسْليماً، وقال الشّيخ في المصباح : فاذا فرغت من الدّعاء عند القبر فأت المنبر وامسحه بيدك وخُذ برمانتيه وهُما السُفلاوان وامسح وجهك وعَينيك به فانّ فيه شفاءاً للعين وقُم عنده واحمد الله واثنُ عليه وسل حاجتك فانّ رسول الله (صلى الله عليه وآله وسلم) قال : ما بين قبري ومنبري روضة من رياض الجنّة ومنبري على باب من أبواب الجنّة . ثمّ تأتي مقام النّبي (صلى الله عليه وآله وسلم)فتصلّي فيه ما بدا لك واكثر من الصّلاة في مسجد النّبي (صلى الله عليه وآله وسلم) فانّ الصّلاة فيه بألف صلاة، واذا دخلت المسجد أو خرجت منه فَصَلّ على النّبي (صلى الله عليه وآله وسلم) وصلّ في بيت فاطمة (عليها السلام) وأت مقام جبرئيل (عليه السلام) وهو تحت الميزاب فانّه كان مقامه اذا استأذن على رسول الله (صلى الله عليه وآله وسلم) وقل : اَسْاَلُكَ اَىْ جَواد اَىْ كَريمُ اَىْ قَريبُ اَىْ بَعيدُ اَنْ تَرُدَّ عَلَيَّ نِعْمَتَكَ، ثمّ زر فاطمة (عليها السلام) مِن عند الرّوضة، واختلف في موضع قبرها ، فقال قوم : هي مدفونة في الرّوضة أي ما بين القبر والمنبر ، وقال آخرون : في بيتها ، وقالت فرقة ثالثة : انّها مدفونة بالبقيع والذي عليه اكثر أصحابنا انّها تزار مِن عِند الرّوضة ومَن زارَها في هذه الثّلاثة مواضِع كان أفضل واذا وقفت عليها للزّيارة فقل :\n\n'
                      'يا مُمْتَحَنَةُ امْتَحَنَكِ اللهُ الَّذي خَلَقَكِ قَبْلَ اَنْ يَخْلُقَكِ، فَوَجَدَكِ لِمَا امْتَحَنَكِ صابِرَةً، وَزَعَمْنا اَنّا لَكِ اَوْلِياءُ وَمُصَدِّقُونَ وَصابِرُونَ لِكُلِّ ما اَتانا بِهِ اَبُوكِ صَلَّى اللهُ عَلَيْهِ وَآلِهِ وَاَتى بِهِ وَصِيُّهُ، فَاِنّا نَسْأَلُكِ اِنْ كُنّا صَدَّقْناكِ إلاّ اَلْحَقْتِنا بِتَصْديقِنا لَهُما لِنُبَشِّرَ اَنْفُسَنا بِاَنّا قَدْ طَهُرْنا بِوَلايَتِكِ.\n\n'
                      'ويستحبّ أيضاً أن تقول : اَلسَّلامُ عَلَيْكِ يا بِنْتَ رَسُولِ اللهِ، اَلسَّلامُ عَلَيْكِ يا بِنْتَ نَبِىِّ اللهِ، اَلسَّلامُ عَلَيْكِ يا بِنْتَ حَبيبِ اللهِ، اَلسَّلامُ عَلَيْكِ يا بِنْتَ خَليلِ اللهِ، اَلسَّلامُ عَلَيْكِ يا بِنْتَ صَفىِّ اللهِ، اَلسَّلامُ عَلَيْكِ يا بِنْتَ اَمينِ اللهِ، اَلسَّلامُ عَلَيْكِ يا بِنْتَ خَيْرِ خَلْقِ اللهِ، اَلسَّلامُ عَلَيْكِ يا بِنْتَ اَفْضَلِ اَنْبِياءِ اللهِ وَرُسُلِهِ وَمَلائِكَتِهِ، اَلسَّلامُ عَلَيْكِ يا بِنْتَ خَيْرِ الْبَرِّيَةِ، اَلسَّلامُ عَلَيْكِ يا سِيِّدَةَ نِساءِ الْعالَمينَ مِنَ الاَْوَّلينَ وَالاْخِرينَ، اَلسَّلامُ عَلَيْكِ يا زَوْجَةَ وَلِيِّ اللهِ وَخَيْرِ الْخَلْقِ بَعْدَ رَسُولِ اللهِ، اَلسَّلامُ عَلَيْكِ يا اُمَّ الْحَسَنِ وَالْحُسَيْنِ سَيِّدَىْ شَبابِ اَهْلِ الْجَنَّةِ، اَلسَّلامُ عَلَيْكِ '
                      'اَيَّتُهَا الصِّدّيقَةُ الشَّهيدَةُ، اَلسَّلامُ عَلَيْكِ اَيَّتُهَا الرَّضِيَّةُ الْمَرْضِيَّةُ، اَلسـَّلامُ عـَلَيْكِ اَيَّتـُهَا الْفاضِلـَةُ الزَّكِيـَّةُ، اَلسـَّلامُ عـَلَيْكِ اَيَّتـُهَا الْحَوْراءُ الاِْنْسِيَّةُ، اَلسـَّلامُ عَلَيْكِ اَيَّتُهَا التَّقِيَّةُ النَّقِيَّةُ، اَلسَّلامُ عَلَيْكِ اَيَّتُهَا الُْمحَدَّثَةُ الْعَليمَةُ، اَلسَّلامُ عَلَيْكِ اَيَّتُهَا الْمَظْلُومَةُ الْمَغْصُوبَةُ، اَلسَّلامُ عَلَيْكِ اَيَّتُهَا الْمُضْطَهَدَةُ الْمَقْهُورَةُ، اَلسَّلامُ عَلَيْكِ يا فاطِمَةُ بِنْتَ رَسُولِ اللهِ وَرَحْمَةُ اللهِ وَبَرَكاتُهُ، صَلَّى اللهُ عَلَيْكِ وَعَلى رُوحِكِ وَبَدَنِكِ، اَشْهَدُ اَنَّكِ مَضَيْتِ عَلى بَيِّنَة مِنْ رَبِّكِ، وَاَنَّ مَنْ سَرَّكِ فَقَدْ سَرَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَآلِهِ، وَمَنْ جَفاكِ فَقَدْ جَفا رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَآلِهِ، وَمَنْ آذاكِ فَقَدْ آذى رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَآلِهِ، وَمَنْ وَصَلَكِ فَقَدْ وَصَلَ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَآلِهِ، وَمَنْ قَطَعَكِ فَقَدْ قَطَعَ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَآلِهِ، لاَِنَّكِ بِضْعَةٌ مِنْهُ وَرُوحُهُ الَّذي بَيْنَ جَنْبَيْهِ، اُشْهِدُ اللهَ وَرُسُلَهُ وَمَلائِكَتَهُ اَنّي راض عَمَّنْ رَضَيتِ عَنْهُ، ساخِطٌ عَلى مَنْ سَخِطْتِ عَلَيْهِ مُتَبَرِّىءٌ مِمَّنْ تَبَرَّأْتِ مِنْهُ، مُوال لِمَنْ والَيْتِ، مُعاد لِمَنْ عادِيْتِ، مُبْغِضٌ لِمَنْ اَبْغَضْتِ، مُحِبٌّ لِمَنْ اَحْبَبْتِ، وَكَفى بِاللهِ شَهيداً وَحَسيباً وَجازِياً وَمُثيباً.\n\n'
                      'ثمّ تصلّي على النّبي والائمة الاطهار (عليهم السلام).\n\n'
                      'أقول : قد ذكرنا في اليوم الثّالث من شهر جمادى الاخرة زيارة اخرى لها صلوات الله عليها، وقد أورد العلماء لها صلوات الله عليها زيارة مبسوطة تتّفق في ألفاظها مع هذه الزّيارة التي نقلناها عن الشّيخ من أوّلها وهي : اَلسَّلامُ عَلَيْكِ يا بِنْتَ رَسُولِ اللهِ الى اُشْهِدُ اللهَ وَرُسُلَهُ وَمَلائِكَتَهُ، وتختلف عنها هُنا فتكُون : اُشْهِدُ اللهَ وَمَلائِكَتَهُ اَنّي وَلِيُّ لِمَنْ والاكِ، وَعَدُوٌّ لِمَنْ عاداكِ، وَحَرْبٌ لِمَنْ حارَبَكِ، اَنَا يا مَوْلاتي بِكِ وَبِاَبيكِ وَبَعْلِكِ وَالاَْئِمَّةِ مِنْ وُلْدِكِ مُوقِنٌ، وَبِوِلايَتِهِمْ مُؤْمِنٌ، وَلِطاعَتِهِمْ مُلْتَزِمٌ، اَشْهَدُ اَنَّ الدّينَ دينُهُمْ، وَالْحُكْمَ حُكْمُهُمْ، وَهُمْ قَد بَلَّغُوا عَنِ اللهِ عَزَّوَجَلَّ، وَدَعَوْا اِلى سَبيلِ اللهِ بِالْحِكْمَةِ وَالْمَوْعِظَةِ الْحَسَنَةِ لا تَأخُذُهُمْ فِي اللهِ لَوْمَةُ لائِم، وَصَلَواتُ اللهِ عَلَيْكِ وَعَلى اَبيكِ وَبَعْلِكِ وَذُرِّيَّتِكِ الاَْئِمَّةِ الطّاهِرينَ، اَللّـهُمَّ صَلِّ عَلى مُحَمَّد وَاَهْلِ بَيْتِهِ، وَصَلِّ عَلَى الْبَتُولِ الطّاهِرَةِ الصِّديقَةِ الْمَعْصُومَةِ التَّقِيَّةِ النَّقِيَّةِ الرَّضِيَّةِ الْمَرْضِيَّةِ الزَّكِيَّةِ الرَّشيدَةِ الْمَظْلُومَةِ الْمَقْهُورَةِ الْمَغْصُوبَةِ حَقَّهَا، الْمَمْنُوعَةِ اِرْثَهَا، الْمَكْسُورَةِ ضِلْعَهَا، الْمَظْلُومِ بَعْلُهَا، الْمَقْتُولِ وَلَدُها فاطِمَةَ بِنْتِ رَسُولِكَ، وَبِضْعَةِ لَحْمِهِ، وَصَميمِ قَلْبِهِ، وَفِلْذَةِ كَبِدِهِ، وَالنُّخْبَةِ مِنْكَ لَهُ وَالتُّحْفَةِ، خَصَصْتَ بِها وَصِيَّهُ، وَحَبيبَةِ الْمُصْطَفى، وَقَرينَةِ الْمُرْتَضى، وَسَيِّدَةِ النِّساءِ، وَمُبَشِّرَةِ الاَْوْلِياءِ، حَليفَةِ الْوَرَعِ وَالزُّهْدِ، وَتُفّاحَةِ الفِرْدَوْسِ وَالْخُلْدِ، الَّتي شَرَّفْتَ مَوْلِدَها بِنِساءِ الْجَنَّةِ، وَسَلَلْتَ مِنْها اَنْوارَ الاَْئِمَّةِ، وَاَرْخَيْتَ دُونَها حِجابَ النُّبُوَّةِ، اَللّـهُمَّ صَلِّ عَلَيْها صَلاةً تَزيدُ في مَحَلِّها عِنْدَك وَشَرَفِها لَدَيْكَ، وَمَنْزِلَتِها مِنْ رِضاكَ، وَبَلِّغْها مِنّا تَحِيَّةً وَسَلاماً، وَآتِنا مِنْ لَدُنْكَ في حُبِّها فَضْلاً وَاِحْساناً وَرَحْمَةً وَغُفْراناً، اِنَّكَ ذُو الْعَفْوِ الْكَريمِ.\n\n'
                      'أقول : قال الشّيخ في التّهذيب: انّ ما روي في فضل زيارَتها صلوات الله عليها أكثر من أن يحصى، وروى العلامة المجلسي عن كتاب مصباح الانوار عن الزّهراء صلوات الله عليها قالت : قال لي أبي : من صلّى عليك غفر الله عزّوجل له وألحقه بي حيثما كنت من الجنّة.',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
            ],
          ),
        ),
        bottomNavigationBar: AddCustomBottomNavigationBar(
        pushNext: ZiyaratAlnabi.screenRoute,
        pushBack: Alwada3.screenRoute,
        soud: '',
        onTap: (double fontSize) {
          // تحديث حجم الخط
          setState(() {
            isTablet ? _fontSizeTablet = fontSize : _fontSize = fontSize;
          });
          print('fontSize: $fontSize');
          // إغلاق Dialog
          Navigator.of(context).pop();
        },
        onLongPress: () {
          final snackBar = SnackBar(
            content: Center(
              child: Text(
                '${isTablet ? _fontSizeTablet.toInt() : _fontSize.toInt()}',
                style: TextStyle(
                  color: Colors.white,
                  fontSize: 16,
                ),
              ),
            ),
            width: 60,
            behavior: SnackBarBehavior.floating,
            backgroundColor: Colors.blue,
            duration: Duration(seconds: 2),
            shape: ShapeBorder.lerp(
              RoundedRectangleBorder(
                borderRadius: BorderRadius.circular(50),
              ),
              RoundedRectangleBorder(
                borderRadius: BorderRadius.circular(50),
              ),
              1,
            ),
          );
          ScaffoldMessenger.of(context).showSnackBar(snackBar);
        },
      ),
      ),
    );
  }
}
