import 'package:flutter/material.dart';
import 'package:maktabat_almoslim/widgets/container_scrollview.dart';
import 'package:maktabat_almoslim/widgets/she3er.dart';
import 'package:provider/provider.dart';
import 'package:shared_preferences/shared_preferences.dart';

import '../../../../widgets/add_custom_bottom_navigation_bar.dart';
import '../../../../widgets/list_of_nine_verses.dart';
import '../../../favorites_provider.dart';
import '../../../favorites_screen.dart';
import '../kaifyat_wziyarat_amir_almo2minin.dart';
import 'alsalisa_men_alziyarat.dart';
import 'wada3_al2amir.dart';

class AlsaniyaMenAlziyarat extends StatefulWidget {
  static String screenRoute = 'alsaniya_men_alziyarat_screen';
  const AlsaniyaMenAlziyarat({super.key});

  @override
  State<AlsaniyaMenAlziyarat> createState() => _AlsaniyaMenAlziyaratState();
}

double _fontSize = 18;
double _fontSizeTablet = 30;

class _AlsaniyaMenAlziyaratState extends State<AlsaniyaMenAlziyarat> {
  bool isIcon = true;
  @override
  void initState() {
    super.initState();
    _loadFavoriteState();
  }

  Future<void> _loadFavoriteState() async {
    final prefs = await SharedPreferences.getInstance();
    bool? savedState =
        prefs.getBool('isFavorite_alsaniya_men_alziyarat_screen');
    setState(() {
      isIcon = savedState ?? true;
    });
  }

  Future<void> _saveFavoriteState(bool value) async {
    final prefs = await SharedPreferences.getInstance();
    await prefs.setBool('isFavorite_alsaniya_men_alziyarat_screen', value);
  }

  Future<bool> _onWillPop() async {
    final args =
        ModalRoute.of(context)!.settings.arguments as Map<String, dynamic>?;
    final previousPage = args?['previousPage'];
    if (previousPage == 'favorite_screen') {
      Navigator.of(context).pushReplacementNamed(FavoritesScreen.screenRoute);
      return false;
    } else {
      Navigator.of(context)
          .pushReplacementNamed(KaifyatWziyaratAmirAlmo2minin.screenRoute);
      return false;
    }
  }

  @override
  Widget build(BuildContext context) {
    double size = MediaQuery.of(context).textScaleFactor;
    final screenWidth = MediaQuery.of(context).size.width;
    final isTablet = screenWidth >= 600;
    return WillPopScope(
      onWillPop: _onWillPop,
      child: Scaffold(
        appBar: AppBar(
          toolbarHeight: isTablet ? 100 : 50,
          centerTitle: true,
          leading: IconButton(
            onPressed: _onWillPop,
            icon: Icon(
              Icons.arrow_back,
              size: isTablet ? 50 : 25,
            ),
          ),
          actions: [
            IconButton(
              padding: EdgeInsets.only(left: isTablet ? 50 : 30),
              icon: Icon(
                isIcon ? Icons.favorite_border : Icons.favorite_rounded,
                size: isTablet ? 40 : 25,
                color: isIcon ? Colors.black : Colors.red,
              ),
              onPressed: () async {
                setState(() {
                  isIcon = !isIcon;
                });
                await _saveFavoriteState(isIcon);

                if (!isIcon) {
                  Provider.of<FavoritesProvider>(context, listen: false)
                      .addFavorite('الثانية من الزيارات المخصوصة',
                          AlsaniyaMenAlziyarat.screenRoute);
                } else {
                  Provider.of<FavoritesProvider>(context, listen: false)
                      .removeFavorite(
                          'الثانية من الزيارات المخصوصة',
                          AlsaniyaMenAlziyarat.screenRoute,
                          AlsaniyaMenAlziyarat.screenRoute);
                }
              },
            ),
          ],
          title: Text(
            'الثانية من الزيارات المخصوصة',
            style: TextStyle(
              fontSize: isTablet
                  ? 40
                  : size > 1.0
                      ? 20
                      : 23,
              fontWeight: FontWeight.bold,
            ),
          ),
        ),
        body: ContainerScrollview(
          widget: Column(
            crossAxisAlignment: CrossAxisAlignment.start,
            children: [
              Container(
                child: Column(
                  children: [
                    Center(
                      child: Text(
                        'بسم الله الرحمن الرحيم',
                        style: TextStyle(
                          fontSize: isTablet ? _fontSizeTablet : _fontSize,
                          fontWeight: FontWeight.w900,
                        ),
                      ),
                    ),
                    Center(
                      child: Text(
                        'اللهم صلِّ على محمد وآل محمد',
                        style: TextStyle(
                          fontSize: isTablet ? _fontSizeTablet : _fontSize,
                          fontWeight: FontWeight.w900,
                        ),
                      ),
                    ),
                  ],
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: '',
                  subtitle:
                      'زيارة يوم ميلاد النّبي (صلى الله عليه وآله وسلم) روى الشّهيد والمفيد والسّيد ابن طاووس انّ الصّادق (عليه السلام) زار امير المؤمنين صلوات الله عليه في اليوم السّابع عشر من ربيع الاوّل بهذه الزّيارة وعلّمها الثّقة الجليل محمّد بن مسلم الثّقفي (رضي الله عنه) ، فقال : اذا أتيت مشهد امير المؤمنين (عليه السلام) فاغتسل للزّيارة والبس أنظف ثيابك واستعمل شيئاً مِن الطّيب وسر وعليك السّكينة والوقار ، فاذا وصلت الى باب السّلام أي باب الحرم الطّاهر فاستقبل القبلة وقُل الله اكبر ثلاث مرّات ثمّ قل :\n\n'
                      'اَلسَّلامُ عَلى رَسُولِ اللهِ، اَلسَّلامُ عَلى خِيَرَةِ اللهِ، اَلسَّلامُ عَلَى الْبَشيرِ النَّذيرِ السِّراجِ الْمُنيرِ وَرَحْمَةُ اللهِ وَبَرَكاتُهُ، اَلسَّلامُ عَلَى الطُّهْرِ الطّاهِرِ، اَلسَّلامُ عَلَى الْعَلَمِ الزّاهِرِ، اَلسَّلامُ عَلَى الْمَنْصُورِ الْمُؤَيَّدِ، اَلسَّلامُ عَلى اَبِى الْقاسِمِ مُحَمَّد وَرَحْمَةُ اللهِ وَبَرَكاتُهُ، اَلسَّلامُ عَلى اَنْبِياءِ اللهِ الْمُرْسَلينَ، وَعِبادِ اللهِ الصّالِحينَ، اَلسَّلامُ عَلى مَلائِكَةِ اللهِ الْحافّينَ بِهذَا الْحَرَمِ وَبِهذَا الضَّريحِ الّلائِذينَ بِهِ.',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: 'ثمّ ادنُ من القبر وقُل :',
                  subtitle:
                      'اَلسَّلامُ عَلَيْكَ يا وَصِيَّ الاَْوْصِياءِ، اَلسَّلامُ عَلَيْكَ يا عِمادَ الاَْتْقِياءِ، اَلسَّلامُ عَلَيْكَ يا وَلِيَّ الاَْوْلِياءِ، اَلسَّلامُ عَلَيْكَ يا سَيِّدَ الشُّهَداءِ، اَلسَّلامُ عَلَيْكَ يا آيَةَ اللهِ الْعُظْمى، اَلسَّلامُ عَلَيْكَ يا خامِسَ اَهْلِ الْعَباءِ، اَلسَّلامُ عَلَيْكَ يا قائِدَ الْغُرِّ الُْمحَجَّلينَ الاَْتْقِياءِ، اَلسَّلامُ عَلَيْكَ يا عِصْمَةَ الاَْوْلِياءِ، اَلسَّلامُ عَلَيْكَ يا زَيْنَ الْمُوَحِّدينَ النُّجَباءِ، اَلسَّلامُ عَلَيْكَ يا خالِصَ الاَْخِلاّءِ اَلسَّلامُ عَلَيْكَ يا والِدَ الاَْئِمَّةِ الاُْمَناءِ، اَلسَّلامُ عَلَيْكَ يا صاحِبَ الْحَوْضِ وَحامِلَ اللِّواءِ، اَلسَّلامُ عَلَيْكَ يا قَسيمَ الْجَنَّةِ وَلَظى، اَلسَّلامُ عَلَيْكَ يا مَنْ شُرِّفَتْ بِهِ مَكَّةُ وَمِنى، اَلسَّلامُ عَلَيْكَ يا بَحْرَ الْعُلُومِ وَكَنَفَ الْفُقَراءِ، اَلسَّلامُ عَلَيْكَ يا مَنْ وُلِدَ فِي الْكَعْبَةِ، وَزُوِّجَ فِي السَّماءِ بِسَيِّدَةِ النِّساءِ، وَكانَ شُهُودَهَا الْمَلائِكَةُ الاَْصْفِياُءَ، اَلسَّلامُ عَلَيْكَ يا مِصْباحَ الضِّياءِ، اَلسَّلامُ عَلَيْكَ يا مَنْ خَصَّهُ النَّبِيُّ بِجَزيلِ الْحِباءِ، اَلسَّلامُ عَلَيْكَ يا مَنْ باتَ عَلى فِراشِ خاتَمِ الاَْنْبِياءِ، وَوَقاهُ بِنَفْسِهِ شَرَّ الاَْعْداءِ، اَلسَّلامُ عَلَيْكَ يا مَنْ رُدَّتْ لَهُ الشَّمْسُ فَسامى شَمْعُونَ الصَّفا، اَلسَّلامُ عَلَيْكَ يا مَنْ اَنْجَى اللهُ سَفينَةَ نُوح بِاسْمِهِ وَاسْمِ اَخيهِ حَيْثُ الْتَطَمَ الْماءُ حَوْلَها وَطَمى، '
                      'اَلسَّلامُ عَلَيْكَ يا مَنْ تابَ اللهُ بِهِ وَبِاَخيهِ عَلى آدَمَ اِذْ غَوى، اَلسَّلامُ عَلَيْكَ يا فُلْكَ النَّجاةِ الَّذي مَنْ رَكِبَهُ نَجا وَمَنْ تَاَخَّرَ عَنْهُ هَوى اَلسَّلامُ عَلَيْكَ يا مَنْ خاطَبَ الثُّعْبانَ وَذِئْبَ الْفَلا اَلسَّلامُ عَلَيْكَ يا اَميرَالْمُؤْمِنينَ وَرَحْمَةُ اللهِ وَبَرَكاتُهُ، اَلسَّلامُ عَلَيْكَ يا حُجَّةَ اللهِ عَلى مَنْ كَفَرَ وَاَنابَ، اَلسَّلامُ عَلَيْكَ يا اِمامَ ذَوِي الاَْلْبابِ، اَلسَّلامُ عَلَيْكَ يا مَعْدِنَ الْحِكْمَةِ وَفَصْلَ الْخِطابِ، اَلسَّلامُ عَلَيْكَ يا مَنْ عِنْدَهُ عِلْمُ الْكِتابِ، اَلسَّلامُ عَلَيْكَ يا ميزانَ يَوْمِ الْحِسابِ، اَلسَّلامُ عَلَيْكَ يا فاصِلَ الْحُكْمِ النّاطِقَ بِالصَّوابِ، اَلسَّلامُ عَلَيْكَ اَيُّهَا الْمُتَصَدِّقُ بِالْخاتَمِ فِي الِْمحْرابِ، اَلسَّلامُ عَلَيْكَ يا مَنْ كَفَى اللهُ الْمُؤْمِنينَ الْقِتالَ بِهِ يَوْمَ الاَْحْزابِ، اَلسَّلامُ عَلَيْكَ يا مَنْ اَخْلَصَ للهِ الْوَحْدانِيَّةَ وَاَنابَ، اَلسَّلامُ عَلَيْكَ يا قاتِلَ خَيْبَرَ وَقالِعَ الْبابِ، اَلسَّلامُ عَلَيْكَ يا مَنْ دَعاهُ خَيْرُ الاَْنامِ لِلْمَبيتِ عَلى فِراشِهِ فَاَسْلَمَ نَفْسَهُ لِلْمَنِيَّةِ وَاَجابَ، اَلسَّلامُ عَلَيْكَ يا مَنْ لَهُ طُوبى وَحُسْنُ مآب وَرَحْمَةُ اللهِ وَبَرَكاتُهُ، اَلسَّلامُ عَلَيْكَ يا وَلِيَّ عِصْمَةِ الدّينِ، وَيا سَيِّدَ السّاداتِ، اَلسَّلامُ عَلَيْكَ يا صاحِبَ الْمُعْجِزاتِ، اَلسَّلامُ عَلَيْكَ يا مَنْ نَزَلَتْ في فَضْلِهِ سُورَةُ الْعادِياتِ، اَلسَّلامُ عَلَيْكَ يا مَنْ كُتِبَ اسْمُهُ فِي السَّماءِ عَلَى السُّرادِقاتِ، اَلسَّلامُ عَلَيْكَ يا مُظْهِرَ الْعَجائِبِ وَالاْياتِ اَلسَّلامُ عَلَيْكَ يا اَميرَ الْغَزَواتِ، اَلسَّلامُ عَلَيْكَ يا مُخْبِراً بِما غَبَرَ و بِما هُوَ آت، اَلسَّلامُ عَلَيْكَ يا مُخاطِبَ ذِئْبِ الْفَلَواتِ، اَلسَّلامُ عَليْكَ يا خاتِمَ الْحَصى وَمُبَيِّنَ الْمُشْكِلاتِ، '
                      'اَلسَّلامُ عَلَيْكَ يا مَنْ عَجِبَتْ مِنْ حَمَلاتِهِ فِي الْوَغا مَلائِكَةُ السَّماواتِ، اَلسَّلامُ عَلَيْكَ يا مَنْ ناجَى الرَّسُولَ فَقَدَّمَ بَيْنَ يَدَيْ نَجْوهُ الصَّدَقاتِ، اَلسَّلامُ عَلَيْكَ يا والِدَ الاَْئِمَّةِ الْبَرَرَةِ السّاداتِ وَرَحْمَةُ اللهِ وَبَرَكاتُهُ، السَّلامُ عَلَيْكَ يا تالِيَ الْمَبْعُوثِ، اَلسَّلامُ عَلَيْكَ يا وارِثَ عِلْمِ خَيْرِ مَوْرُوث وَرَحْمَةُ اللهِ وَبَرَكاتُهُ، اَلسَّلامُ عَلَيْكَ يا سَيِّدَ الْوَصِيّينَ، اَلسَّلامُ عَلَيْكَ يا اِمامَ الْمُتَّقينَ، اَلسَّلامُ عَلَيْكَ يا غِياثَ الْمَكْرُوبينَ، اَلسَّلامُ عَلَيْكَ يا عِصْمَةَ الْمُؤْمِنينَ، اَلسَّلامُ عَلَيْكَ يا مُظْهِرَ الْبَراهينِ، اَلسَّلامُ عَلَيْكَ يا طه وَيس، اَلسَّلامُ عَلَيْكَ يا حَبْلَ اللهِ الْمَتينَ، اَلسَّلامُ عَلَيْكَ يا مَنْ تَصَدَّقَ في صَلاتِهِ بِخاتَمِهِ عَلَى الْمِسْكينِ، اَلسَّلامُ عَلَيْكَ يا قالِعَ الصَّخْرَةِ عَنْ فَمِ الْقَليبِ وَمُظْهِرَ الْماءِ الْمَعينِ، اَلسَّلامُ عَلَيْكَ يا عَيْنَ اللهِ النّاظِرَةَ وَيَدَهُ الْباسِطَةَ وَلِسانَهُ الْمُعَبِّرَ عَنْهُ في بَرِيَّتِهِ اَجْمَعينَ، اَلسَّلامُ عَلَيْكَ يا وارِثَ عِلْمِ النَّبِيّينَ، وَمَسْتَوْدَعَ عِلْمِ الاَْوَّلينَ وَالاْخِرينَ، وَصاحِبَ لِواءِ الْحَمْدِ، وَساقِيَ اَوْلِيائِهِ مِنْ حَوْضِ خاتَمِ النَّبِيّينَ، اَلسَّلامُ عَلَيْكَ يا يَعْسُوبَ الدّينِ، وَقائِدَ الْغُرِّ الُْمحَجَّلينَ، '
                      'وَوالِدَ الاَْئِمَّةِ الْمَرْضِيّينَ وَرَحْمَةُ اللهِ وَبَرَكاتُهُ، اَلسَّلامُ عَلَى اسْمِ اللهِ الرَّضِيِّ وَوَجْهِهِ الُمضيءِ، وَجَنْبِهِ الْقَوِيِّ، وَصِراطِهِ السَّوِيِّ، اَلسَّلامُ عَلَى الاِْمامِ التَّقِيِّ الُْمخْلِصِ الصَّفِيِّ، اَلسَّلامُ عَلَى الْكَوْكَبِ الدُّرِّيِّ اَلسَّلامُ عَلَى الاِْمامِ اَبِي الْحَسَنِ عَلِيٍّ وَرَحْمَةُ اللهِ وَبَرَكاتُهُ، اَلسَّلامُ عَلى اَئِمَّةِ الْهُدى، وَمَصابيحِ الدُّجى، وَاَعْلامِ التُّقى، وَمَنارِ الْهُدى، وَذَوِي النُّهى، وَكَهْفِ الْوَرى، وَالْعُرْوَةِ الْوُثْقى، وَالْحُجَّةِ عَلى اَهْلِ الدُّنْيا وَرَحْمَةُ اللهِ وَبَرَكاتُهُ، اَلسَّلامُ عَلى نُورِ الاَْنْوارِ، وَحُجَّةِ الْجَبّارِ، وَوالِدِ الاَْئِمَّةِ الاَْطْهارِ، وَقَسيمِ الْجَنَّةِ وَالنّارِ، الُْمخْبِرِ عَنِ الاْثارِ، الْمُدَمِّرِ عَلَى الْكُفّارِ، مُسْتَنْقِذِ الشّيعَةِ الُْمخْلِصينَ مِنْ عَظيمِ الاَْوْزارِ، اَلسَّلامُ عَلَى الَْمخْصُوصِ بِالطّاهِرَةِ التَّقِيَّةِ ابْنَةِ الُْمخْتارِ، الْمَوْلُودِ فِي الْبَيْتِ ذِي الاَْسْتارِ،الْمُزَوَّجِ فِي السَّماءِ بِالْبَرَّةِ الطّاهِرَةِ الرَّضِيَّةِ الْمَرْضِيَّةِ والِدَةِ الاَْئِمَّةِ الاَْطْهارِ وَرَحْمَةُ اللهِ وَبَرَكاتُهُ، اَلسَّلامُ عَلَى النَّبَأِ الْعَظيمِ الَّذي هُمْ فيهِ مُخْتَلِفُونَ وَعَلَيْهِ يُعْرَضُونَ وَعَنْهُ يُسْأَلُونَ، اَلسَّلامُ عَلى نُورِ اللهِ الاَْنْوَرِ، وَضِيائِهِ الاَْزْهَرِ وَرَحْمَةُ اللهِ وَبَرَكاتُهُ، اَلسَّلامُ عَلَيْكَ يا وَلِيَّ اللهِ وَحُجَّتَهُ وَخالِصَةَ اللهِ وَخاصَّتَهُ، اَشْهَدُ اَنَّكَ يا وَلِيَّ اللهِ لَقَدْ جاهَدْتَ في سَبيلِ اللهِ حَقَّ جِهادِهِ، وَاتَّبَعْتَ مِنْهاجَ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَآلِهِ، وَحَلَّلْتَ حَلالَ اللهِ، وَحَرَّمْتَ حَرامَ اللهِ، '
                      'وَشَرَعْتَ اَحْكامَهُ، وَاَقَمْتَ الصَّلاةَ، وَآتَيْتَ الزَّكاةَ وَاَمَرْتَ بِالْمَعْرُوفِ وَنَهَيْتَ عَنِ الْمُنْكَرِ، وَجاهَدْتَ في سَبيلِ اللهِ صابِراً ناصِحاً مُجْتَهِداً مُحْتَسِباً عِنْدَ اللهِ عَظيمَ الاَْجْرِ حَتّى أتاكَ الْيَقينُ، فَلَعَنَ اللهُ مَنْ دَفَعَكَ عَنْ حَقِّكَ، وَاَزالَكَ عَنْ مَقامِكَ، وَلَعَنَ اللهُ مَنْ بَلَغَهُ ذلِكَ فَرَضِيَ بِهِ، اُشْهِدُ اللهَ وَمَلائِكَتَهُ وَاَنْبِياءَهُ وَرُسُلَهُ اَنّي وَلِيٌّ لِمَنْ والاكَ وَعَدُوٌّ لِمَنْ عاداكَ، اَلسَّلامُ عَلَيْكَ وَرَحْمَةُ اللهِ وَبَرَكاتُهُ.',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: 'ثمّ انكبّ على القبر وقبّله وقُل :',
                  subtitle:
                      'اَشْهَدُ اَنَّكَ تَسْمَعُ كَلامي، وَتَشْهَدُ مَقامي وَاَشْهَدُ لَكَ يا وَلِيَّ اللهِ بِالْبَلاغِ وَالاَْداءِ، يا مَوْلايَ يا حُجَّةَ اللهِ يا اَمينَ اللهِ يا وَلِيَّ اللهِ، اِنَّ بَيْني وَبَيْنَ اللهِ عَزَّوَجَلَّ ذُنُوباً قَدْ اَثْقَلَتْ ظَهْري، وَمَنَعَتْني مِنَ الرُّقادِ، وَذِكْرُها يُقَلْقِلُ اَحْشائي وَقَدْ هَرَبْتُ اِلَى اللهِ عَزَّوَجَلَّ وَاِلَيْكَ، فَبِحَقِّ مِنَ ائْتَمَنَكَ عَلى سِرِّهِ، وَاسْتَرْعاكَ اَمْرَ خَلْقِهِ، وَقَرَنَ طاعَتَكَ بِطاعَتِهِ، وَمُوالاتَكَ بِمُوالاتِهِ، كُنْ لي اِلَى اللهِ شَفيعاً وَمِنَ النّارِ مُجيراً وَعَلَى الدَّهْرِ ظَهيراً.',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: 'ثمّ انكبّ أيضاً على القبر وقبّله وقُل :',
                  subtitle:
                      'يا وَلِيَّ اللهِ يا حُجَّةَ اللهِ يا بابَ حِطَّةِ اللهِ، وَلِيُّكَ وَزائِرُكَ وَاللاّئِذُ بِقَبْرِكَ، وَالنّازِلُ بِفِنائِكَ، وَالْمُنيخُ رَحْلَهُ في جِوارِكَ يَسْأَلُكَ اَنْ تَشْفَعَ لَهُ اِلَى اللهِ في قَضاءِ حاجَتِهِ، وَنُجْحِ طَلِبَتِهِ فِي الدُّنْيا وَالاخِرَةِ، فَاِنَّ لَكَ عِنْدَ اللهِ الْجاهَ الْعَظيمَ وَالشَّفاعَةَ الْمَقْبُولَةَ، فَاجْعَلْني يا مَوْلايَ مِنْ هَمِّكَ وَاَدْخِلْني في حِزْبِكَ، وَالسَّلامُ عَلَيْكَ وَعَلى ضَجيعَيْكَ آدَمَ وَنُوح، وَالسَّلامُ عَلَيْكَ وَعَلى وَلَدَيْكَ الْحَسَنِ وَالْحُسَيْنِ وَعَلَى الاَْئِمَّةِ الطّاهِرينَ مِنْ ذُرِّيَّتِكَ وَرَحْمَةُ اللهِ وَبَرَكاتُهُ.\n\n'
                      'ثمّ صلّ ستّ ركعات للزّيارة ركعتين للامير (عليه السلام) وركعتين لادم (عليه السلام) وركعتين لِنُوح (عليه السلام) وادعُ الله كثيراً تجب لك ان شاء الله تعالى.',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: 'أقول :',
                  subtitle:
                      'قال مؤلّف المزار الكبير انّه يُزار بهذه الزّيارة في اليوم السّابع عشر عِند طُلوع الشّمس، وقال المجلسي (رحمه الله) :انّ هذه الزّيارة هي أحسن الزّيارات وهي مرويّة بالاسانيد المعتبرة في الكتب المعتبرة، وظاهِر بعض رواياتها انّها لا تخصّ هذا اليوم فمن المُستحسن زيارته (عليه السلام) بهذه الزّيارة في جميع الاوقات.',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: 'أقول :',
                  subtitle:
                      'لو سأل سائل فقال : قد رويت زيارات مخصُوصة في يوم الميلاد ويوم المبعث لامير المؤمنين صلوات الله عليه دُون النّبي (صلى الله عليه وآله وسلم) وكان ينبغي أن تردّ فيها زيارة مخصُوصة لرسُول الله (صلى الله عليه وآله وسلم) فكيف ذلك، أجبناه انّما ذلك لما بين هذين القدوتين العظيمين من شدّة الاتّصال، ولما بين هذين النّورين الطّاهرين من كمال الاتّحاد بحيث كان مَن زار أمير المؤمنين (عليه السلام) كمن زار رسُول الله (صلى الله عليه وآله وسلم)، ويشهد على ذلك من الكتاب المجيد آية اَنْفُسَنا وهو في آية التّباهل نفس المصطفى ليس غيره ايّاها كما يشهد عليه من الاخبار روايات عديدة، منها ما رواه الشّيخ محمّد بن المشهدي عن الصّادق (عليه السلام) قال : انّ رجلاً من الاعراب أتى رسول الله '
                      '(صلى الله عليه وآله وسلم) فقال : يا رسول الله (صلى الله عليه وآله وسلم) انّ داري بعيد من دارك وانّني اشتاق الى زيارتك ورؤيتك فاقدم اليك زائراً فلا يتيسّر رؤيتك فازور عليّ بن أبي طالب (عليه السلام) فيؤنسني بحديثه ومواعظه، ثمّ اعود مغتمّاً محزوناً لما أيست من زيارتك ، فقال : من زار عليّاً (عليه السلام) فقد زارني ومن أحبّه فقد أحبّني ومن عاداهُ فقد عاداني بلّغه عنّي الى قومك ومن أتاهُ زائراً فقد أتاني، وانّي مجزيه يوم القِيامة وجبريل وصالِح المؤمنين.\n\n'
                      'وفي الحديث المعتبر عن الصّادق (عليه السلام) قال : اذا زرت جانب النّجف فزر عظام آدم (عليه السلام) وبدن نوح (عليه السلام)وجسد عليّ بن أبي طالب (عليه السلام) تزور بذلك الاباء الماضين ومحمّداً (صلى الله عليه وآله وسلم) خاتم النّبيين وعليّاً أفضل الاوصياء، وقد مرّ في الزّيارة السّادسة ما يدلّ على ما قلناه وهو قولهم استقبل قبر امير المؤمنين (عليه السلام) وقُل : اَلسَّلامُ عَلَيْكَ يا صَفْوَةَ اللهِ الى غير ذلك ولقد أجاد الشّيخ جابر في تسميطِهِ للقصيدة الازريّة بقوله مشيراً الى القُبّة العلويّة :',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
              Container(
                child: She3er(
                  subtitle:
                      'فَاعْتَمِدْ لِلنَّبِيِّ اَعْظَمَ رَمْس   فيهِ لِلطُّهْرِ اَحْمَد اَيُّ نَفْس\n\n'
                      'اَوْ تَرَى الْعَرْشَ فيهِ اَنْوَرَ شَمْس   فَتَواضَعْ فَثَمَّ دارَةُ قُدْس\n\n'
                      'تَتَمَنَّى الاَْفْلاكُ لَثْمَ ثَراها',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: '',
                  subtitle: 'وقال الحكيم السّنائي بالفارسيّة :',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
              Container(
                child: She3er(
                  subtitle: 'مرتضائى كه كرد يزدانش   همره جان مصطفى جانش\n\n'
                      'هر دو يكقبله و خردشان   وهر دو يكروح و كالبدشان دو\n\n'
                      'دو رونده چو اختر گردون   دو برادر چو موسى و هارون\n\n'
                      'هر دو يكدّرزيكصدف بودند   هر دو پيرايه شرف بودند\n\n'
                      'تا نه بگشاد علم حيدر در   ندهد سُنّت پيمبر بر',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
            ],
          ),
        ),
        bottomNavigationBar: AddCustomBottomNavigationBar(
          pushNext: AlsalisaMenAlziyarat.screenRoute,
          pushBack: Wada3Al2amir.screenRoute,
          soud: 'https://cdn.jsdelivr.net/gh/SounaDiab/image_audio@master/audio/الثانية من الزيارات المخصصة.mp3',
          onTap: (double fontSize) {
            // تحديث حجم الخط
            setState(() {
              isTablet ? _fontSizeTablet = fontSize : _fontSize = fontSize;
            });
            print('fontSize: $fontSize');
            // إغلاق Dialog
            Navigator.of(context).pop();
          },
          onLongPress: () {
            final snackBar = SnackBar(
              content: Center(
                child: Text(
                  '${isTablet ? _fontSizeTablet.toInt() : _fontSize.toInt()}',
                  style: TextStyle(
                    color: Colors.white,
                    fontSize: 16,
                  ),
                ),
              ),
              width: 60,
              behavior: SnackBarBehavior.floating,
              backgroundColor: Colors.blue,
              duration: Duration(seconds: 2),
              shape: ShapeBorder.lerp(
                RoundedRectangleBorder(
                  borderRadius: BorderRadius.circular(50),
                ),
                RoundedRectangleBorder(
                  borderRadius: BorderRadius.circular(50),
                ),
                1,
              ),
            );
            ScaffoldMessenger.of(context).showSnackBar(snackBar);
          },
        ),
      ),
    );
  }
}
