import 'package:flutter/material.dart';
import 'package:maktabat_almoslim/widgets/container_scrollview.dart';
import 'package:provider/provider.dart';
import 'package:shared_preferences/shared_preferences.dart';

import '../../../../widgets/add_custom_bottom_navigation_bar.dart';
import '../../../../widgets/list_of_nine_verses.dart';
import '../../../favorites_provider.dart';
import '../../../favorites_screen.dart';
import '../kaifyat_wziyarat_amir_almo2minin.dart';
import 'alsaniya_men_alziyarat.dart';
import 'fi_fadl_ziyaratihi.dart';

class AlsalisaMenAlziyarat extends StatefulWidget {
  static String screenRoute = 'alsalisa_men_alziyarat_screen';
  const AlsalisaMenAlziyarat({super.key});

  @override
  State<AlsalisaMenAlziyarat> createState() => _AlsalisaMenAlziyaratState();
}

double _fontSize = 18;
double _fontSizeTablet = 30;

class _AlsalisaMenAlziyaratState extends State<AlsalisaMenAlziyarat> {
  bool isIcon = true;
  @override
  void initState() {
    super.initState();
    _loadFavoriteState();
  }

  Future<void> _loadFavoriteState() async {
    final prefs = await SharedPreferences.getInstance();
    bool? savedState =
        prefs.getBool('isFavorite_alsalisa_men_alziyarat_screen');
    setState(() {
      isIcon = savedState ?? true;
    });
  }

  Future<void> _saveFavoriteState(bool value) async {
    final prefs = await SharedPreferences.getInstance();
    await prefs.setBool('isFavorite_alsalisa_men_alziyarat_screen', value);
  }

  Future<bool> _onWillPop() async {
    final args =
        ModalRoute.of(context)!.settings.arguments as Map<String, dynamic>?;
    final previousPage = args?['previousPage'];
    if (previousPage == 'favorite_screen') {
      Navigator.of(context).pushReplacementNamed(FavoritesScreen.screenRoute);
      return false;
    } else {
      Navigator.of(context)
          .pushReplacementNamed(KaifyatWziyaratAmirAlmo2minin.screenRoute);
      return false;
    }
  }

  @override
  Widget build(BuildContext context) {
    double size = MediaQuery.of(context).textScaleFactor;
    final screenWidth = MediaQuery.of(context).size.width;
    final isTablet = screenWidth >= 600;
    return WillPopScope(
      onWillPop: _onWillPop,
      child: Scaffold(
        appBar: AppBar(
          toolbarHeight: isTablet ? 100 : 50,
          centerTitle: true,
          leading: IconButton(
            onPressed: _onWillPop,
            icon: Icon(
              Icons.arrow_back,
              size: isTablet ? 50 : 25,
            ),
          ),
          actions: [
            IconButton(
              padding: EdgeInsets.only(left: isTablet ? 50 : 30),
              icon: Icon(
                isIcon ? Icons.favorite_border : Icons.favorite_rounded,
                size: isTablet ? 40 : 25,
                color: isIcon ? Colors.black : Colors.red,
              ),
              onPressed: () async {
                setState(() {
                  isIcon = !isIcon;
                });
                await _saveFavoriteState(isIcon);
      
                if (!isIcon) {
                  Provider.of<FavoritesProvider>(context, listen: false)
                      .addFavorite('الثالثة من الزيارات المخصوصة',
                          AlsalisaMenAlziyarat.screenRoute);
                } else {
                  Provider.of<FavoritesProvider>(context, listen: false)
                      .removeFavorite(
                          'الثالثة من الزيارات المخصوصة',
                          AlsalisaMenAlziyarat.screenRoute,
                          AlsalisaMenAlziyarat.screenRoute);
                }
              },
            ),
          ],
          title: Text(
            'الثالثة من الزيارات المخصوصة',
            style: TextStyle(
              fontSize: isTablet
                  ? 40
                  : size > 1.0
                      ? 20
                      : 23,
              fontWeight: FontWeight.bold,
            ),
          ),
        ),
        body: ContainerScrollview(
          widget: Column(
            crossAxisAlignment: CrossAxisAlignment.start,
            children: [
              Container(
                child: Column(
                  children: [
                    Center(
                      child: Text(
                        'بسم الله الرحمن الرحيم',
                        style: TextStyle(
                          fontSize: isTablet ? _fontSizeTablet : _fontSize,
                          fontWeight: FontWeight.w900,
                        ),
                      ),
                    ),
                    Center(
                      child: Text(
                        'اللهم صلِّ على محمد وآل محمد',
                        style: TextStyle(
                          fontSize: isTablet ? _fontSizeTablet : _fontSize,
                          fontWeight: FontWeight.w900,
                        ),
                      ),
                    ),
                  ],
                ),
              ),
              Container(
                padding: EdgeInsets.all(20),
                child: Text(
                  'زيارة ليلة المبعث وهو اليوم السّابع والعشرون من رجب وقد وردت فيه ثلاث زيارات :',
                  style: TextStyle(
                    fontWeight: FontWeight.w900,
                    fontSize: isTablet ? _fontSizeTablet + 4 : _fontSize - 1,
                    color: const Color.fromARGB(255, 17, 126, 20),
                  ),
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: 'الاُولى :',
                  subtitle:
                      'الزّيارة الرّجبيّة اَلْحَمْدُ للهِ الَّذي أشَهَدَنا مَشْهَدَ اَوْلِيائِهِ، وقد سلفت في أعمال رجب  وهي زيارة يزار بها كلّ من المشاهد المشرّفة في شهر رجب، وقد عدّها صاحب كتاب المزار القديم والشّيخ محمّد ابن المشهدي من زيارات ليلة المبعث المخصوصة وقالا : صلّ بعدها للزّيارة ركعتين ثمّ ادعُ بما شِئت.',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: 'الثّانية :',
                  subtitle:
                      'زيارة اَلسَّلامُ عَلى اَبِي الاَْئِمَّةِ وَمَعْدِنِ النُّبُوَّة، التي قد جعلها العلامة المجلسي الزّيارة السّابعة من الزّيارات المطلقة في كتاب التحفة.\n\n'
                      'قال صاحب المزار القديم : انّها تخصّ اللّيلة السّابعة والعشرين من رجب، ونحن أيضاً قد جرينا على ذلك في كتاب هديّة الزّائر.',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: 'الثّالثة :',
                  subtitle:
                      'زيارة أوردها الشّيخ المفيد والسّيد والشّهيد بهذه الكيفيّة، اذا أردت زيارة الامير (عليه السلام) في ليلة المبعث أو يَومه فقف على باب القُبّة الشّريفة مُقابل قبره (عليه السلام) وقل :\n\n'
                      'اَشْهَدُ اَنْ لا اِلـهَ اِلاَّ اللهُ وَحْدَهُ لا شَريكَ لَهُ،وَاَشْهَدُ اَنَّ مُحَمَّداً عَبْدُهُ وَرَسُولُهُ، وَاَنَّ عَلِيَّ بْنَ اَبي طالِب اَميرَ الْمُؤمِنينَ عَبْدُ اللهِ، وَاَخُو رَسُولِهِ، وَاَنَّ الاَْئِمَّةَ الطّاهِرينَ مِنْ وُلْدِهِ حُجَجُ اللهِ عَلى خَلْقِهِ، ثمّ ادخل وقِف عند القبر مستقبلاً القبر والقبلة بين كتفيك وكبّر الله مائة مرّة وقُل :\n\n'
                      'اَلسَّلامُ عَلَيْكَ يا وارِثَ آدَمَ خَليفَةِ اللهِ، اَلسَّلامُ عَلَيْكَ يا وارِثَ نُوح صَفْوَةِ اللهِ، اَلسَّلامُ عَلَيْكَ يا وارِثَ اِبْراهيمَ خَليلِ اللهِ، اَلسَّلامُ عَلَيْكَ يا وارِثَ مُوسى كَليمِ اللهِ، اَلسَّلامُ عَلَيْكَ يا وارِثَ عيسى رُوحِ اللهِ، اَلسَّلامُ عَلَيْكَ يا وارِثَ مُحَمَّد سَيِّدِ رُسُلِ اللهِ، اَلسَّلامُ عَلَيْكَ يا اَميرَ الْمُؤْمِنينَ، اَلسَّلامُ عَلَيْكَ يا اِمامَ المُتَّقينَ، اَلسَّلامُ عَلَيْكَ يا سَيِّدَ الْوَصِيّينَ، اَلسَّلامُ عَلَيْكَ يا وَصِيَّ رَسُولِ رَبِّ الْعالَمينَ، اَلسَّلامُ عَلَيْكَ يا وارِثَ عِلْمِ الاَْوَّلينَ وَالاْخِرينَ، اَلسَّلامُ عَلَيْكَ اَيُّهَا النَّبَأُ الْعَظيمُ، اَلسَّلامُ عَلَيْكَ اَيُّهَا الصِّراطُ الْمُسْتَقيمُ، اَلسَّلامُ عَلَيْكَ اَيُّهَا الْمُهَذَّبُ الْكَريمُ، اَلسَّلامُ عَلَيْكَ اَيُّهَا الْوَصِيُّ التَّقِيُّ، اَلسَّلامُ عَلَيْكَ اَيُّهَا الرَّضِيُّ الزَّكِيُّ، اَلسَّلامُ عَلَيْكَ اَيُّهَا الْبَدْرُ الْمُضيءُ، اَلسَّلامُ عَلَيْكَ اَيُّهَا الصِّديقُ الاَْكْبَرُ، اَلسَّلامُ عَلَيْكَ اَيُّهَا الْفارُوقُ الاَْعْظَمُ، اَلسَّلامُ عَلَيْكَ اَيُّهَا السِّراجُ الْمُنيرُ، اَلسَّلامُ عَلَيْكَ يا اِمامَ الْهُدى، اَلسَّلامُ عَلَيْكَ يا عَلَمَ التُّقى، اَلسَّلامُ عَلَيْكَ يا حُجَّةَ اللهِ الْكُبْرى، اَلسَّلامُ عَلَيْكَ يا خاصَّةَ اللهِ وَخالِصَتَهُ، '
                      'وَاَمينَ اللهِ وَصَفْوَتَهُ، وَبابَ اللهِ وَحُجَّتَهُ، وَمَعْدِنَ حُكْمِ اللهِ وَسِرِّهِ، وَعَيْبَةَ عِلْمِ اللهِ وَخازِنَهُ، وَسَفيرَ اللهِ في خَلْقِهِ، اَشْهَدُ اَنَّكَ اَقَمْتَ الصَّلاةَ، وَآتَيْتَ الزَّكاةَ، وَاَمَرْتَ بِالْمَعْرُوفِ، وَنَهَيْتَ عَنِ الْمُنْكَرِ، وَاتَّبَعْتَ الرَّسُولَ، وَتَلَوْتَ الْكِتابَ حَقَّ تِلاوَتِهِ، وَبَلَّغْتَ عَنِ اللهِ، وَوَفَيْتَ بِعَهْدِ اللهِ، وَتَمَّتْ بِكَ كَلِماتُ اللهِ، وَجاهَدْتَ فِي اللهِ حَقَّ جِهادِهِ، وَنَصَحْتَ للهِ وَلِرَسُولِهِ صَلَّى اللهُ عَلَيْهِ وَآلِهِ، وَجُدْتَ بِنَفْسِكَ صابِراً مُحْتَسِباً مُجاهِداً عَنْ دينِ اللهِ، مُوَقِّياً لِرَسُولِ اللهِ صلَّى اللهُ عَلَيْهِ وَآلِهِ، طالِباً ما عِنْدَ اللهِ، راغِباً فيـما وَعَدَ اللهُ، وَمَضَيْتَ لِلَّذي كُنْتَ عَلَيْهِ شَهيداً وَشاهِداً وَمَشْهُوداً، فَجَزاكَ اللهُ عَنْ رَسُولِهِ وَعَنِ الاِْسْلامِ وَاَهْلِهِ مِنْ صِدّيق اَفْضَلَ الْجَزاءِ، اَشْهَدُ اَنَّكَ كُنْتَ اَوَّلَ الْقَوْمِ اِسْلاماً، وَاَخْلَصَهُمْ ايماناً، وَاَشَدَّهُمْ يَقيناً، '
                      'وَاَخْوَفَهُمْ للهِ وَاَعْظَمَهُمْ عَناءً، وَاَحْوَطَهُمْ عَلى رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَآلِهِ، وَاَفْضَلَهُمْ مَناقِبَ، وَاَكْثَرَهُمْ سَوابِقَ، وَاَرْفَعَهُمْ دَرَجَةً، وَاَشْرَفَهُمْ مَنِزْلَةً، وَاَكْرَمَهُمْ عَلَيْهِ، فَقَوِيْتَ حينَ وَهَنوُا، وَلَزِمْتَ مِنْهاجَ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَآلِهِ، وَاَشْهَدُ اَنَّكَ كُنْتَ خَليفَتَهُ حَقّاً لَمْ تُنازَعْ بِرَغْمِ الْمُنافِقينَ، وَغَيْظِ الْكافِرينَ، وَضِغْنِ الْفاسِقينَ، وَقُمْتَ بِالاَْمْرِ حينَ فَشِلُوا، وَنَطَقْتَ حينَ تَتَعْتَعُوا، وَمَضَيْتَ بِنُورِ اللهِ اِذْ وَقَفُوا، فَمَنِ اتَّبَعَكَ فَقَدِ اهْتَدى، كُنْتَ اَوَّلَهُمْ كَلاماً، وَاَشَدَّهُمْ خِصاماً، '
                      'وَاَصْوَبَهُمْ مَنْطِقاً، وَاَسَدَّهُمْ رَأياً، وَاَشْجَعَهُمْ قَلْباً، وَاَكْثَرَهُمْ يَقيناً، وَاَحْسَنَهُمْ عَمَلاً، وَاَعْرَفَهُمْ بِالاُْمُورِ، كُنْتَ لِلْمُؤْمِنينَ اَباً رَحيماً اِذْ صارُوا عَلَيْكَ عِيالاً، فَحَمَلْتَ اَثْقالَ ما عَنْهُ ضَعُفُوا، وَحَفِظْتَ ما اَضاعُوا، وَرَعَيْتَ ما اَهْمَلُوا، وَشَمَّرْتَ اِذْ جَبَنُوا، وَعَلَوْتَ اِذْ هَلِعُوا، وَصَبَرْتَ اِذْ جَزِعُوا، كُنْتَ عَلَى الْكافِرينَ عَذاباً صَبّاً وَغِلْظَةً وَغَيْظاً، وَلِلْمُؤْمِنينَ غَيْثاً وَخِصْباً وَعِلْماً، لَمْ تُفْلَلْ حُجَّتُكَ، وَلَمْ يَزِغْ قَلْبُكَ، وَلَمْ تَضْعُفْ بَصيرَتُكَ، وَلَمْ تَجْبُنْ نَفْسُكَ، كُنْتَ كَالْجَبَلِ لا تُحَرِّكُهُ الْعَواصِفُ، وَلا تَزيلُهُ الْقَواصِفُ، كُنْتَ كَما قالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَآلِهِ : قَوِيّاً في بَدَنِكَ، مُتَواضِعاً في نَفْسِكَ، عَظيماً عِنْدَ اللهِ، كَبيراً فِي الاَْرْضِ، جَليلاً فِي السَّماءِ، لَمْ يَكُنْ لاَِحَد فيكَ مَهْمَزٌ، وَلا لِقائِل فيكَ مَغْمَزٌ، وَلا لِخَلْق فيكَ مَطْمَعٌ، وَلا لاَِحَد عِنْدَكَ هَوادَةٌ، يوُجَدُ الضَّعيفُ الذَّليلُ عِنْدَكَ قَوِيّاً عَزيزاً حَتّى تَأخُذَ لَهُ بِحَقِّهِ، وَالْقَوِيُّ الْعَزيزُ عِنْدَكَ ضَعيفاً حَتّى تَأخُذَ مِنْهُ الْحَقَّ، الْقَريبُ وَالْبَعيدُ عِنْدَكَ في ذلِكَ سَواءٌ، شَأنُكَ الْحَقُّ وَالصِّدْقُ وَالرِّفْقُ، وَقَوْلُكَ حُكْمٌ وَحَتْمٌ، '
                      'وَاَمْرُكَ حِلْمٌ وَعَزْمٌ، وَرَأيُكَ عِلْمٌ وَحَزْمٌ، اعْتَدَلَ بِكَ الدّينُ، وَسَهُلَ بِكَ الْعَسيرُ، وَاُطْفِئَتْ بِكَ النّيرانُ، وَقَوِيَ بِكَ الاْيمانُ، وَثَبَتَ بِكَ الاِْسْلامُ، وَهَدَّتْ مُصيبَتُكَ الاَْنامَ، فَاِنّا للهِ وَاِنّا اِلَيْهِ راجِعوُنَ، لَعَنَ اللهُ مَنْ قَتَلَكَ، وَلَعَنَ اللهُ مَنْ خالَفَكَ، وَلَعَنَ اللهُ مَنِ افْتَرى عَلَيْكَ، وَلَعَنَ اللهُ مَنْ ظَلَمَكَ وَغَصَبَكَ حَقَّكَ، وَلَعَنَ اللهُ مَنْ بَلَغَهُ ذلِكَ فَرَضِيَ بِهِ، اِنّا اِلَى اللهِ مِنْهُمْ بُرَاءُ، لَعَنَ اللهُ اُمَّةً خالَفَتْكَ، وَجَحَدَتْ وِلايَتَكَ، وَتَظاهَرَتْ عَلَيْكَ، وَقَتَلَتْكَ وَحادَتْ عَنْكَ وَخَذَلَتْكَ، اَلْحَمْدُ للهِ الَّذي جَعَلَ النّارَ مَثْواهُمْ، وَبِئْسَ الْوِرْدُ الْمَوْرُودُ، اَشْهَدُ لَكَ يا وَلِيَّ اللهِ وَوَلِيَّ رَسُولِهِ صَلَّى اللهُ عَلَيْهِ وَآلِهِ بِالْبَلاغِ وَالاَْداءِ، وَاَشْهَدُ اَنَّكَ حَبيبُ اللهِ وَبابُهُ، وَاَنَّكَ جَنْبُ اللهِ وَوَجْهُهُ الَّذي مِنْهُ يُؤْتى، وَاَنَّكَ سَبيلُ اللهِ، وَاَنَّكَ عَبْدُ اللهِ وَاخُو رَسُولِهِ صَلَّى اللهُ عَلَيْهِ وَآلِهِ، اَتَيْتُكَ زائِراً لِعَظيمِ حالِكَ وَمَنْزِلَتِكَ عِنْدَ اللهِ وَعِنْدَ رَسُولِهِ، مُتَقَرِّباً اِلَى اللهِ بِزِيارَتِكَ، راغِباً اِلَيْكَ فِي الشَّفاعَةِ، '
                      'ابْتَغي بِشَفاعَتِكَ خَلاصَ نَفْسي، مُتَعَوِّذاً بِكَ مِنَ النّارِ، هارِباً مِنْ ذُنوُبِي الَّتِي احْتَطَبْتُها عَلى ظَهْري، فَزِعاً اِلَيْكَ رَجآءَ رَحْمَةِ رَبّي، اَتَيْتُكَ اَسْتَشْفِعُ بِكَ يا مَوْلاىَ اِلَى اللهِ وَاَتَقَرَّبُ بِكَ اِلَيْهِ لِيَقْضِيَ بِكَ حَوائِجي، فَاشْفَعْ لي يا اَميرَ الْمُؤْمِنينَ اِلَى اللهِ فَاِنّي عَبْدُ اللهِ وَمَوْلاكَ وَزائِرُكَ، وَلَكَ عِنْدَ اللهِ الْمَقامُ الْمَعْلُومُ وَالْجاهُ الْعَظيمُ، وَالشَّأنُ الْكَبيرُ، وَالشَّفاعَةُ الْمَقْبُولَةُ، اَللّـهُمَّ صَلِّ عَلى مُحَمَّد وَآلِ مُحَمَّد، وَصَلِّ عَلى عَبْدِكَ وَاَمينِكَ الاَْوْفى، وَعُرْوَتِكَ الْوُثْقى، وَيَدِكَ الْعُلْيا، وَكَلِمَتُكَ الْحُسْنى، وَحُجَّتِكَ عَلَى الْوَرى، وَصِدِّيْقِكَ الاَْكْبَرِ سَيّدِ الاَْوْصِياءِ، وَرُكْنِ الاَْوْلِياءِ، وَعِمادِ الاَْصْفِياءِ، اَميرِ الْمُؤْمِنينَ، وَيَعْسُوبِ الْمُتَّقينَ، وَقُدْوَةِ الصِّدّيقينَ، وَاِمامِ الصّالِحينَ، الْمَعْصُومِ مِنَ الزَّلَلِ، وَالْمَفْطُومِ مِنَ الْخَلَلِ، وَالْمُهَذَّبِ مِنَ الْعَيْبِ، وَالْمُطَهَّرِ مِنَ الرَّيْبِ، اَخي نَبِيِّكَ وَوَصِيِّ رَسُولِكَ، وَالْبائِتِ عَلى فِراشِهِ، وَالْمُواسي لَهُ بِنَفْسِهِ، وَكاشِفِ الْكَرْبِ عَنْ وَجْهِهِ، الَّذي جَعَلْتَهُ سَيْفاً لِنُبُوَّتِهِ، وَمُعْجِزاً لِرِسالَتِهِ، وَدِلالَةً واضِحَةً لِحُجَّتِهِ، وَحامِلاً لِرايَتِهِ، وَوِقايَةً لِمُهْجَتِهِ، وَهادِياً لاُِمَّتِهِ، '
                      'وَيَداً لِبَأسِهِ، وَتاجاً لِرَأسِهِ، وَباباً لِنَصْرِهِ، وَمِفْتاحاً لِظَفَرِهِ، حَتّى هَزَمَ جُنُودَ الشِّرْكِ بِاَيْدِكَ، وَاَبادَ عَساكِرَ الْكُفْرِ بِاَمْرِكَ، وَبَذَلَ نَفْسَهُ في مَرْضاتِكَ وَمَرْضاةِ رَسُولِكَ، وَجَعَلَها وَقْفاً عَلى طاعَتِهِ، وَمَجِنّاً دُونَ نَكْبَتِهِ، حَتّى فاضَتْ نَفْسُهُ صَلَّى اللهُ عَلَيْهِ وَآلِهِ في كَفِّهِ، وَاسْتَلَبَ بَرْدَها وَمَسَحَهُ عَلى وَجْهِهِ، وَاَعانَتْهُ مَلائِكتُكَ على غُسْلِهِ وَتَجْهيزِهِ، وَصَلّى عَلَيْهِ وَوارى شَخْصَهُ، '
                      'وَقَضى دَيْنَهُ، وَاَنْجَزَ وَعْدَهُ، وَلَزِمَ عَهْدَهُ، وَاحْتَذى مِثالَهُ، وَحَفِظَ وَصِيَّتَهُ، وَحينَ وَجَدَ اَنْصاراً نَهَضَ مُسْتَقِلاًّ بِاَعْباءِ الْخِلافَةِ مُضْطَلِعاً بِاَثْقالِ الاْمامَةِ، فَنَصَبَ رايَةَ الْهُدى في عِبادِكَ، وَنَشَرَ ثَوْبَ الاَْمْنِ في بِلادِكَ، وَبَسَطَ الْعَدْلَ في بَرِيَّتِكَ، وَحَكَمَ بِكِتابِكَ في خَليقَتِكَ، وَاَقامَ الْحُدُودَ، وَقَمَعَ الْجُحُودَ، وَقَوَّمَ الزَّيْغَ، وَسَكَّنَ الْغَمْرَةَ، وَاَبادَ الْفَتْرَةَ، وَسَدَّ الْفُرْجَةَ، وَقَتَلَ النّاكِثَةَ وَالْقاسِطَةَ وَالْمارِقَةَ، وَلَمْ يَزَلْ عَلى مِنْهاجِ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَآلِهِ وَوَتيرَتِهِ،وَلُطْفِ شاكِلَتِهِ، وَجَمالِ سيرَتِهِ، مُقْتَدِياً بِسُنَّتِهِ، مُتَعَلِّقاً بِهِمَّتِهِ، مُباشِراً لِطَريقَتِهِ، وَاَمْثِلَتُهُ نَصبُ عَيْنَيْهِ، يَحْمِلُ عِبادَكَ عَلَيْها وَيَدْعُوهُمْ اِلَيْها، اِلى اَنْ خُضِبَتْ شَيْبَتُهُ مِنْ دَمِ رَأسِهِ، اَللّـهُمَّ فَكَما لَمْ يُؤْثِرْ في طاعَتِكَ شَكّاً عَلى يَقين، وَلَمْ يُشْرِكْ بِكَ طَرْفَةَ عَيْن، صَلِّ عَلَيْهِ صَلاةً زاكِيَةً نامِيَةً يَلْحَقُ بِها دَرَجَةَ النُّبُوَّةِ في جَنَّتِكَ، وَبَلِّغْهُ مِنّا تَحِيَّةً وَسَلاماً، وَآتِنا مِنْ لَدُنْكَ في مُوالاتِهِ فَضْلاً وَاِحْساناً وَمَغْفِرَةً وَرِضْواناً، اِنَّكَ ذُو الْفَضْلِ الْجَسيمِ بِرَحْمَتِكَ يا اَرْحَمَ الرّاحِمينَ.\n\n'
                      'ثمّ قبّل الضّريح وضع خدّك الايمن عليه ثمّ الايسر ومل الى القبلة وصلّ صلاة الزّيارة وادعُ بما بدا لك بعدها وقُل بعد تسبيح الزّهراء (عليها السلام) :\n\n'
                      'اَللّـهُمَّ اِنَّكَ بَشَّرْتَني عَلى لِسانِ نَبِيِّكَ وَرَسُولِكَ مُحَمَّد صَلَواتُكَ عَلَيْهِ وَآلِهِ، فَقُلْتَ : ( وَبَشِّرِ الَّذينَ آمَنُوا اَنَّ لَهُمْ قَدَمَ صِدْق عِنْدَ رَبِّهِمْ ) اَللّـهُمَّ وَاِنّي مُؤْمِنٌ بِجَميعِ اَنْبِيائِكَ وَرُسُلِكَ صَلَواتُكَ عَلَيْهِمْ، فَلا تَقِفْني بَعْدَ مَعْرِفَتِهِمْ مَوْقِفاً تَفْضَحُني فيهِ عَلى رُؤُوسِ الاَْشْهادِ، بَلْ قِفْني مَعَهُمْ وَتَوَفَّني عَلَى التَّصْديقِ بِهِمْ، اَللّـهُمَّ وَاَنْتَ خَصَصْتَهُمْ بِكَرامَتِكَ وَاَمَرْتَني بِاِتِّباعِهِمْ، اَللّـهُمَّ وَاِنّي عَبْدُكَ وَزائِرُكَ مُتَقَرِّباً اِلَيْكَ بِزِيارَةِ اَخي رَسُولِكَ، وَعَلى كُلِّ مَأتِيٍّ وَمَزُور حَقٌّ لِمَنْ اَتاهُ وَزارَهُ، وَاَنْتَ خَيْرُ مَأتِيٍّ وَاَكْرَمُ مَزُور فَأَسْأَلُكَ يا اَللهُ يا رَحْمنُ يا رَحيمُ يا جَوادُ يا ماجِدُ يا اَحَدُ يا صَمَدُ يا مَنْ لَمْ يَلِدْ وَلَمْ يوُلَدْ وَلَمْ يَكُنْ لَهُ كُفُواً اَحَدٌ وَلَمْ يَتَّخِذْ صاحِبَةً وَلا وَلَداً اَنْ '
                      'تُصَلِّيَ عَلى مُحَمَّد وَآلِ مُحَمَّد وَاَنْ تَجْعَلَ تُحْفَتَكَ اِيّايَ مِنْ زِيارَتي اَخا رَسُولِكَ فَكاكَ رَقَبَتي مِنَ النّارِ وَاَنْ تَجْعَلَني مِمَّنْ يُسارِعُ فِي الْخَيْراتِ، وَيَدْعُوكَ رَغَباً وَرَهَباً، وَتَجْعَلَني مِنَ الْخاشِعينَ، اَللّـهُمَّ اِنَّكَ مَنَنْتَ عَلَيَّ بِزِيارَةِ مَوْلايَ عَلِيِّ بْنِ أبي طالِب وَوِلايَتِهِ وَمَعْرِفَتِهِ، فَاجْعَلْني مِمَّنْ يَنْصُرُهُ وَيَنْتَصِرُ بِهِ، وَمُنَّ عَلَيَّ بِنَصْرِكَ لِدينِكَ اَللّـهُمَّ وَاجْعَلْني مِنْ شيعَتِهِ، وَتَوَفَّني عَلى دينِهِ، اَللّـهُمَّ اَوْجِبْ لي مِنَ الرَّحْمَةِ وَالرِّضْوانِ وَالْمَغْفِرَةِ وَالاِْحْسانِ وَالرِّزْقِ الْواسِعِ الْحَلالِ الطَّيِّبِ ما اَنْتَ اَهْلُهُ يا اَرْحَمَ الرّاحِمينَ وَالْحَمْدُ للهِ رَبِّ الْعالَمينَ.',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: 'أقول :',
                  subtitle:
                      'ورُوِيَ بسند مُعتبر انّ خضراً (عليه السلام) اسرع الى دار امير المؤمنين (عليه السلام) يوم شهادته وهو يبكي ويسترجع فوقف على الباب فقال : رَحِمَكَ اللهُ يا اَبَا الْحَسَنِ، كُنْتَ اَوَّلَ الْقَوْمِ اِسْلاماً، وَاَخْلَصَهُمْ ايماناً، وَاَشَدَّهُمْ يَقيناً، وَاَخْوَفَهُمْ للهِ، وعدّ كثيراً من فضائله بما يقرب من هذه العبائر الواردة في هذه الزّيارة، فمن المناسب أن يُزار (عليه السلام) فيه أيضاً بهذه الزّيارة وامّا نصوص تلك العبارة وهي كزيارة للامير (عليه السلام) في يوم شهادته فقد أودعْناها كتاب هديّة الزّائر فليطلبها منه من شاء، واعلم انّا قد أوردنا في ضمن أعمال ليلة المبعث ما قاله ابن بطوطة في رحلته ممّا يتعلّق بهذه الرّوضة الشّريفة صلوات الله على مشرفها فينبغي أن يُراجع هُناك.',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
            ],
          ),
        ),
        bottomNavigationBar: AddCustomBottomNavigationBar(
        pushNext: FiFadlZiyaratihi.screenRoute,
        pushBack: AlsaniyaMenAlziyarat.screenRoute,
        soud: 'https://cdn.jsdelivr.net/gh/SounaDiab/image_audio@master/audio/الثالثة من الزيارات المخصصة.mp3',
        onTap: (double fontSize) {
          // تحديث حجم الخط
          setState(() {
            isTablet ? _fontSizeTablet = fontSize : _fontSize = fontSize;
          });
          print('fontSize: $fontSize');
          // إغلاق Dialog
          Navigator.of(context).pop();
        },
        onLongPress: () {
          final snackBar = SnackBar(
            content: Center(
              child: Text(
                '${isTablet ? _fontSizeTablet.toInt() : _fontSize.toInt()}',
                style: TextStyle(
                  color: Colors.white,
                  fontSize: 16,
                ),
              ),
            ),
            width: 60,
            behavior: SnackBarBehavior.floating,
            backgroundColor: Colors.blue,
            duration: Duration(seconds: 2),
            shape: ShapeBorder.lerp(
              RoundedRectangleBorder(
                borderRadius: BorderRadius.circular(50),
              ),
              RoundedRectangleBorder(
                borderRadius: BorderRadius.circular(50),
              ),
              1,
            ),
          );
          ScaffoldMessenger.of(context).showSnackBar(snackBar);
        },
      ),
      ),
    );
  }
}
