import 'package:flutter/material.dart';
import 'package:maktabat_almoslim/widgets/container_scrollview.dart';
import 'package:provider/provider.dart';
import 'package:shared_preferences/shared_preferences.dart';

import '../../../../widgets/add_custom_bottom_navigation_bar.dart';
import '../../../../widgets/list_of_nine_verses.dart';
import '../../../favorites_provider.dart';
import '../../../favorites_screen.dart';
import '../zi_lhoja.dart';
import 'alyawm_alsamin_3ashar_zilhoja.dart';
import 'alyawm_altasi3_zilhoja.dart';

class AllaylaAltasi3aZilhoja extends StatefulWidget {
  static String screenRoute = 'allayla_altasi3a_zilhoja_screen';
  const AllaylaAltasi3aZilhoja({super.key});

  @override
  State<AllaylaAltasi3aZilhoja> createState() => _AllaylaAltasi3aZilhojaState();
}

double _fontSize = 18;
double _fontSizeTablet = 30;

class _AllaylaAltasi3aZilhojaState extends State<AllaylaAltasi3aZilhoja> {
  bool isIcon = true;
  @override
  void initState() {
    super.initState();
    _loadFavoriteState();
  }

  Future<void> _loadFavoriteState() async {
    final prefs = await SharedPreferences.getInstance();
    bool? savedState =
        prefs.getBool('isFavorite_allayla_altasi3a_zilhoja_screen');
    setState(() {
      isIcon = savedState ?? true;
    });
  }

  Future<void> _saveFavoriteState(bool value) async {
    final prefs = await SharedPreferences.getInstance();
    await prefs.setBool('isFavorite_allayla_altasi3a_zilhoja_screen', value);
  }

  Future<bool> _onWillPop() async {
    final args =
        ModalRoute.of(context)!.settings.arguments as Map<String, dynamic>?;
    final previousPage = args?['previousPage'];
    if (previousPage == 'favorite_screen') {
      Navigator.of(context).pushReplacementNamed(FavoritesScreen.screenRoute);
      return false;
    } else {
      Navigator.of(context).pushReplacementNamed(ZiLhoja.screenRoute);
      return false;
    }
  }

  @override
  Widget build(BuildContext context) {
    double size = MediaQuery.of(context).textScaleFactor;
    final screenWidth = MediaQuery.of(context).size.width;
    final isTablet = screenWidth >= 600;
    return WillPopScope(
      onWillPop: _onWillPop,
      child: Scaffold(
        appBar: AppBar(
          toolbarHeight: isTablet ? 100 : 50,
          centerTitle: true,
          leading: IconButton(
            onPressed: _onWillPop,
            icon: Icon(
              Icons.arrow_back,
              size: isTablet ? 50 : 25,
            ),
          ),
          actions: [
            IconButton(
              padding: EdgeInsets.only(left: isTablet ? 50 : 30),
              icon: Icon(
                isIcon ? Icons.favorite_border : Icons.favorite_rounded,
                size: isTablet ? 40 : 25,
                color: isIcon ? Colors.black : Colors.red,
              ),
              onPressed: () async {
                setState(() {
                  isIcon = !isIcon;
                });
                await _saveFavoriteState(isIcon);

                if (!isIcon) {
                  Provider.of<FavoritesProvider>(context, listen: false)
                      .addFavorite(
                          'الليلة التاسعة', AllaylaAltasi3aZilhoja.screenRoute);
                } else {
                  Provider.of<FavoritesProvider>(context, listen: false)
                      .removeFavorite(
                          'الليلة التاسعة',
                          AllaylaAltasi3aZilhoja.screenRoute,
                          AllaylaAltasi3aZilhoja.screenRoute);
                }
              },
            ),
          ],
          title: Text(
            'الليلة التاسعة',
            style: TextStyle(
              fontSize: isTablet
                  ? 40
                  : size > 1.0
                      ? 20
                      : 23,
              fontWeight: FontWeight.bold,
            ),
          ),
        ),
        body: ContainerScrollview(
          widget: Column(
            crossAxisAlignment: CrossAxisAlignment.start,
            children: [
              Container(
                child: Column(
                  children: [
                    Center(
                      child: Text(
                        'بسم الله الرحمن الرحيم',
                        style: TextStyle(
                          fontSize: isTablet ? _fontSizeTablet : _fontSize,
                          fontWeight: FontWeight.w900,
                        ),
                      ),
                    ),
                    Center(
                      child: Text(
                        'اللهم صلِّ على محمد وآل محمد',
                        style: TextStyle(
                          fontSize: isTablet ? _fontSizeTablet : _fontSize,
                          fontWeight: FontWeight.w900,
                        ),
                      ),
                    ),
                  ],
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: '',
                  subtitle:
                      'ليلة مباركة وهي ليلة مناجاة قاضي الحاجات، والتّوبة فيها مقبولة، والدّعاء فيها مستجاب، وللعامل فيها بطاعة الله أجر سبعين ومائة سنة، وفيها عدّة أعمال :',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: 'الاوّل :',
                  subtitle:
                      'أن يدعو بهذا الدّعاء الذي روى انّ من دعا به في ليلة عرفة أو ليالي الجُمع غفر الله له :\n\n'
                      'اَللّـهُمَّ يا شاهِدَ كُلِّ نَجْوى، وَمَوْضِعَ كُلِّ شَكْوى، وَعالِمَ كُلِّ خَفِيَّة، وَمُنْتَهى كُلِّ حاجَة، يا مُبْتَدِئاً بِالنِّعَمِ عَلَى الْعِبادِ، يا كَريمَ الْعَفْوِ، يا حَسَنَ التَّجاوُزِ، يا جَوادُ يا مَنْ لا يُواري مِنْهُ لَيْلٌ داج، وَلا بَحْرٌ عَجّاجٌ، وَلا سَمآءٌ ذاتُ اَبْراج، وَلا ظُلَمٌ ذاتُ ارْتِتاج، يا مَنِ الظُّلْمَةُ عِنْدَهُ ضِيآءٌ، اَسْاَلُكَ بِنوُرِ وَجْهِكَ الْكَريمِ الَّذى تَجَلَّيْتَ بِهِ لِلْجَبَلِ فَجَعَلْتَهُ دَكَّاً وَخَرَّ موُسى صَعِقاً، وَبِاِسْمِكَ الَّذى رَفَعْتَ بِهِ السَّماواتِ بِلا عَمَد، وَسَطَحْتَ بِهِ الاَْرْضَ عَلى وَجْهِ ماء جَمَد، وَبِاِسْمِكَ الَْمخْزوُنِ الْمَكْنوُنِ الْمَكْتوُبِ الطّاهِرِ الَّذى اِذا دُعيتَ بِهِ اَجَبْتَ، وَاِذا سُئِلْتَ بِهِ اعَطْيَتْ، وَبِاِسْمِكَ السُّبوُحِ الْقُدُّوسِ الْبُرْهانِ الَّذى هُوَ نوُرٌ عَلى كُلِّ نُور وَنوُرٌ مِنْ نوُر يُضيىُ مِنْهُ كُلُّ نوُر، اِذا بَلَغَ الاَْرْضَ انْشَقَّتْ، وَاِذا بَلَغَ السَّماواتِ فُتِحَتْ، وَاِذا بَلَغَ الْعَرْشَ اهْتَزَّ، وَبِاِسْمِكَ الَّذى تَرْتَعِدُ مِنْهُ فَرائِصُ مَلائِكَتِكَ، وَاَسْاَلُكَ بِحَقِّ جَبْرَئيلَ وَميكائيلَ وَاِسْرافيلَ، وَبِحَقِّ مُحَمَّد الْمُصْطَفى صَلَّى اللهُ عَلَيْهِ وَآلِهِ وَعَلى جَميعِ الاَْنْبِيآءِ وَجَميعِ الْمَلائِكَةِ، وَبِالاِْسْمِ الَّذى مَشى بِهِ الْخِضْرُ عَلى قُلَلِ الْمآءِ كَما مَشى بِهِ عَلى جَدَدِ الاَْرْضِ، وَبِاِسْمِكَ الَّذى فَلَقْتَ بِهِ الْبَحْرَ لِموُسى، وَاَغْرَقْتَ فِرْعَوْنَ وَقَوْمَهُ وَاَنْجَيْتَ بِهِ موُسَى بْنَ عِمْرانَ وَمَنْ مَعَهُ، وَبِاِسْمِكَ الَّذى دَعاكَ بِهِ موُسَى بْنُ عِمْران مِنْ جانِبِ الطُّورِ الاَْيْمَنِ فَاسْتَجَبْتَ لَهُ وَاَلْقَيْتَ عَلَيْهِ مَحَبَّةً مِنْكَ، وَبِاِسْمِكَ الَّذى بِهِ اَحْيى عيسَى بْنُ مَرْيَمَ الْمَوْتى، وَتَكَلَّمَ فِى الْمَهْدِ صَبِيّاً وَاَبْرَأَ الاَْكْمَهَ وَالاَْبْرَصَ بِاِذْنِكَ، وَبِاِسْمِكَ الَّذى دَعاكَ بِهِ حَمَلَةُ عَرْشِكَ وَجَبْرَئيلُ وَميكآئيلُ وَاِسْرافيلُ وَحَبيبِكَ مُحَمَّدٌ صَلَّى اللهُ عَلَيْهِ وَآلِهِ وَمَلائِكَتِكَ الْمُقَرَّبوُنَ وَاَنْبِيآؤُكَ الْمُرْسَلوُنَ وَعِبادُكَ الصّالِحوُنَ مِنْ اَهْلِ السَّماواتِ وَالاَْرَضينَ، وَبِاِسْمِكَ الَّذى دَعاكَ بِهِ ذوُ النُّونِ اِذْ ذَهَبَ مُغاضِباً فَظَنَّ اَنْ لَنْ نَقْدِرَ عَلَيْهِ فَنادى فِى الظُّلُماتِ اَنْ لا اِلـهَ اِلاّ اَنْتَ سُبْحانَك اِنّى كُنْتُ مِنَ الظّالِمينَ فَاسْتَجَبْتَ لَهُ وَنَجَّيْتَهُ مِنَ الْغَمِّ وَكَذلِكَ نُنْجِى الْمُؤْمِنينَ، وَبِاِسْمِكَ الْعَظيمِ الَّذى دَعاكَ بِهِ داوُدُ وَخَرَّ لَكَ ساجِداً فَغَفَرْتَ لَهُ ذَنْبَهُ، وَبِاِسْمِكَ الَّذى دَعَتْكَ بِهِ آسِيَةُ امْرَأَةُ فِرْعَوْنَ اِذْ قالَتْ رَبِّ ابْنِ لى عِنْدَكَ بَيْتاً فِى الْجَنَّةِ وَنَجِّنى مِنْ فِرْعَوْنَ وَعَمَلِهِ، وَنَجِّنى مِنَ الْقَوْمِ الظّالِمينَ، فَاسْتَجَبْتَ لَها دُعآءَها وَبِاِسْمِكَ الَّذى دَعاكَ بِهِ اَيُّوبُ اِذْ حَلَّ بِهِ الْبَلاءُ فَعافَيْتَهُ وَآتَيْتَهُ اَهْلَهُ وَمِثْلَهُمْ مَعَهُمْ رَحْمَةً مِنْ عِنْدَكَ وَذِكْرى لِلْعابِدينَ، وَبِاِسْمِكَ الَّذى دَعاكَ بِهِ يَعْقوُبُ فَرَدَدْتَ عَلَيْهِ بَصَرَهُ وَقُرَّةَ عَيْنِهِ يوُسُفَ وَجَمَعْتَ شَمْلَهُ، وَبِاِسْمِكَ الَّذى دَعاكَ بِهِ سُلَيْمانُ فَوَهَبْتَ لَهُ مُلْكاً لا يَنْبَغى لاَِحَد مِنْ بَعْدِهِ اِنَّكَ اَنْتَ الْوَهّابُ، وَبِاِسْمِكَ الَّذى سَخَّرْتَ بِهِ الْبُراقَ لُِمحَمَّد صَلَّى اللهُ عَلَيْهِ وَآلِهِ وَسَلِّمَ اِذْ قالَ تَعالى: سُبْحانَ الَّذى اَسْرى بِعَبْدِهِ لَيْلاً مِنَ الْمَسْجِدِ الْحرامِ اِلَى الْمَسْجِدِ الاَْقْصى، وَقَوْلُهُ: سُبْحانَ الَّذى سَخَّرَ لَنا هذا وَما كُنّا لَهُ مُقْرِنينَ وَاِنّا اِلى رَبِّنا لَمُنْقَلِبوُنَ، وَبِاِسْمِكَ الَّذى تَنَزَّلَ بِهِ جَبْرَئيلُ عَلى مُحَمَّد صَلَّى اللهُ عَلَيْهِ وَآلِهِ، وَبِاِسْمِكَ الَّذى دَعاكَ بِهِ آدَمُ فَغَفَرْتَ لَهُ ذَنْبَهُ وَاَسْكَنْتَهُ جَنَّتَكَ، وَاَسْاَلُكَ بِحَقِّ الْقُرْآنِ الْعَظيمِ، وَبِحَقِّ مُحَمَّد خاتِمَ النَّبِيّينَ، وَبِحَقِّ اِبْرهيمَ، وَبِحَقِّ فَصْلِكَ يَوْمَ الْقَضآءِ، وَبِحَقِّ الْمَوازينَ اِذا نُصِبَتْ، وَالصُّحُفِ اِذا نُشِرَتْ، وَبِحَقِّ الْقَلَمِ وَما جَرى، وَاللَّوْحِ وَما اَحْصى، وَبِحَقِّ الاِْسْمِ الَّذى كَتَبْتَهُ عَلى سُرادِقِ '
                      'الْعَرشِ قَبْلَ خَلْقِكَ الْخَلْقَ وَالدُّنْيا وَالشَّمْسَ وَالْقَمَرَ بِاَلْفَىْ عام، وَاَشْهَدُ اَنْ لا اِلـهَ اِلاَّ اللهُ وَحْدَهُ لا شَريكَ لَهُ، وَاَنَّ مُحَمَّداً عَبْدُهُ وَرَسوُلُهُ، وَاَسْاَلُكَ بِاِسْمِكَ الَْمخْزُونِ فى خَزآئِنِكَ الَّذى اسْتَأثَرْتَ بِهِ فى عِلْمِ الْغَيْبِ عِنْدَكَ لَمْ يَظْهَرْ عَلَيْهِ اَحَدٌ مِنْ خَلْقِكَ لا مَلَكٌ مُقَرَّبٌ وَلا نَبِىٌّ مُرْسَلٌ وَلا عَبْدٌ مُصْطَفىً، وَاَسْاَلُكَ بِاِسْمِكَ الَّذى شَقَقْتَ بِهِ الْبِحارَ، وَقامَتْ بِهِ الْجِبالُ، وَاخْتَلَفَ بِهِ اللَّيْلُ وَالنَّهارُ، وَبِحَقِّ السَّبْعِ الْمَثانى، وَالْقُرْآنِ الْعَظيمِ، وَبِحَقِّ الْكِرامَ الْكاتِبينَ، وَبِحَقِّ طه وَيس وَكهيعص وَحمعسق، وَبِحَقِّ تَوْراةِ موُسى وَاِنْجيلِ عيسى وَزَبوُرِ داوُدَ وَفُرْقانِ مُحَمَّد صَلَّى اللهُ عَلَيْهِ وَآلِهِ وَعَلى جَميعِ الرُّسُلِ وَِباهِيّاً شَراهِيّاً، اَللّـهُمَّ اِنّى اَسْاَلُكَ بِحَقِّ تِلْكَ الْمُناجاةِ الَّتى كانَتْ بَيْنَكَ وَبَيْنَ موُسَى بْنِ عَمْرانَ فَوْقَ جَبَلِ طوُرِ سَيْنآءَ، وَاَسْاَلُكَ بِاِسْمِكَ الَّذى عَلَّمْتَهُ مَلَكَ الْمَوْتِ لِقَبْضِ الاَْرْواحِ، وَاَسْاَلُكَ بِاِسْمِكَ الَّذى كُتِبَ عَلى وَرَقِ الزَّيْتوُنِ فَخَضَعَتِ النّيرانُ لِتِلْكَ الْوَرَقَةِ فَقُلْتُ يا نارُ كوُنى بَرْداً وَسَلاماً، وَاَسْاَلُكَ بِاِسْمِكَ الَّذى كَتَبْتَهُ عَلى سُرادِقِ الَْمجْدِ وَالْكَرامَةِ يا مَنْ لا يُحْفيهِ سآئِلٌ، وَلا يَنْقُصُهُ نآئِلٌ، يا مَنْ بِهِ يُسْتَغاثُ، وَاِلَيْهِ يُلْجَأُ، اَسْاَلُكَ بِمَعاقِدِ الْعِزِّ مِنْ عَرْشِكَ وَمُنْتَهَى الرَّحْمَةِ مِنْ كِتابِكَ، وَبِاِسْمِكَ الاَْعْظَمِ وَجَدِّكَ الاَْعْلى وَكَلِماتِكَ التّآمّاتِ الْعُلى، اَللّـهُمَّ رَبَّ الرِّياحِ وَما ذَرَتْ، وَالسَّمآءِ وَما اَظَلَّتْ، وَالاَْرْضِ وَما اَقَلَّتْ، وَالشَّياطينِ وَما اَضَلَّتْ، وَالْبِحارِ وَما جَرَتْ، وَبِحَقِّ كُلِّ حَقٍّ هُوَ عَلَيْكَ حَقٌّ، وَبِحَقِّ الْمَلائِكَةِ الْمُقَرَّبينَ وَالرَّوحانِيّينَ وَالْكَروُبِيّينَ وَالْمُسَبِّحينَ لَكَ بِاللَّيْلِ وَالنَّهارِ لا يَفْتَروُنَ، وَبِحَقِّ اِبْرهيمَ خَليلِكَ، وَبِحَقِّ كُلِّ وَلِىٍّ يُناديكَ بَيْنَ الصَّفا وَالْمَرْوَةِ وَتَسْتَجيبُ لَهُ دُعآءَهُ يا مُجيبُ اَسْاَلُكَ بِحَقِّ هذِهِ الاَْسْماءِ وَبِهذِهِ الدَّعَواتِ اَنْ تَغْفِرَ لَنا ما قَدَّمْنا وَما اَخَّرْنا وَما اَسْرَرْنا وَما اَعْلَنّا وَما اَبْدَيْنا وَما اَخْفَيْنا وَما اَنْتَ اَعْلَمُ بِهِ مِنّا اِنَّكَ عَلى كُلِّ شَىْء قَديرٌ بِرَحْمَتِكَ يا اَرْحَمَ الرّاحِمينَ، يا حافِظَ كُلِّ غَريب، يا موُنِسَ كُلِّ وَحيد، يا قُوَّةَ كُلِّ ضَعيف، يا ناصِرَ كُلِّ مَظْلوُم يا رازِقَ كُلِّ مَحْروُم، يا موُنِسَ كُلِّ مُسْتَوْحِش، يا صاحِبَ كُلِّ مُسافِر، يا عِمادَ كُلِّ حاضِر، يا غافِرَ كُلِّ ذَنْب وَخَطيئَة، يا غِياثَ الْمُسْتَغيثينَ، يا صَريخَ الْمُسْتَصْرِخينَ، يا كاشِفَ كُرَبِ الْمَكْروُبينَ، يا فارِجَ هَمِّ الْمَهْموُمينَ، يا بَديعَ السَّماواتِ وَالاَْرَضينَ، يا مُنْتَهى غايَةَ الطّالِبينَ، يا مُجيبَ دَعْوَةِ الْمُضْطَرّينَ، يا اَرْحَمَ الرّاحِمينَ، يا رَبَّ الْعالَمين، يا دَيّانِ يَوْمِ الدّينِ، يا اَجْوَدَ الاَْجْوَدينَ، يا اَكْرَمَ الاَْكْرَمِينَ، يا اَسْمَعَ السّامِعينَ، يا اَبْصَرَ النّاظِرينَ، يا اَقْدَرَ الْقادِرينَ، اِغْفِرْ لِىَ الذُّنوُبَ الَّتى تُغَيِّرُ النِّعَمَ، وَاغْفِرْ لِىَ الذُّنوُبَ الَّتى توُرِثُ النَّدَمَ، وَاغْفِرْ لِىَ الذُّنوُبَ الَّتى توُرَثُ السَّقَمَ، وَاغْفِرْ لِىَ الذُّنوُبَ الَّتى تَهْتِكُ الْعِصَمَ، وَاغْفِرْ لِىَ الذُّنوُبَ الَّتى تَرُدُّ الدُّعآءَ، وَاغْفِرْ لِىَ الذُّنوُبَ الَّتى تَحْبِسُ قَطْرَ السَّمآءِ، وَاغْفِرْ لِىَ الذُّنوُبَ الَّتى تُعَجِّلُ الْفَنآءَ، وَاغْفِرْ لِىَ الذُّنوُبَ الَّتى تَجْلِبُ الشَّقآءَ، وَاغْفِرْ لِىَ الذُّنوُبَ الَّتى تُظْلِمُ الْهَوآءَ، وَاغْفِرْ لِىَ الذُّنوُبَ الَّتى تَكْشِفُ الْغِطآءَ، وَاغْفِرْ لِىَ الذُّنوُبَ الَّتى لا يَغْفِرُها غَيْرُكَ يا اَللهُ، وَاحْمِلْ عَنّى كُلَّ تَبِعَة لاَِحَد مِنْ خَلْقِكَ، وَاجْعَلْ لى مِنْ اَمْرى فَرَجاً وَمَخْرَجاً وَيُسْراً، وَاَنْزِلْ يَقينَكَ فى صَدْرى، وَرَجآءَكَ فى قَلْبى حَتّى لا اَرْجُوَ غَيْرَكَ، اَللّـهُمَّ احْفَظْنى وَعافِنى فى مَقامى وَاصْحَبْنى فى لَيْلى وَنَهارى وَمِنْ بَيْنِ يَدَىَّ وَمِنْ خَلْفى وَعَنْ يَمينى وَعَنْ شِمالى وَمِنْ فَوْقى وَمِنْ تَحْتى، وَيَسِّرْ لِىَ السَّبيلَ، وَاَحْسِنْ لِىَ التَّيْسِيرَ، وَلا تَخْذُلْنى فِى الْعَسيرِ، وَاهْدِنى يا خَيْرَ دَليل، وَلا تَكِلْنى اِلى نَفْسى فِى الاُْموُرِ، وَلَقِّنى كُلَّ سُروُر، وَاقْلِبْنى اِلى اَهْلى بِالْفَلاحِ وَالنَّجاحِ مَحْبوُراً '
                      'فِى الْعاجِلِ وَالاَْجَلِ اِنَّكَ عَلى كُلِّ شَىْء قَديرٌ، وَارْزُقْنى مِنْ فَضْلِكَ، وَاَوْسِعْ عَلَىَّ مِنْ طَيِّباتِ رِزْقِكَ، وَاسْتَعْمِلْنى فى طاعَتِكَ، وَاَجِرْنى مِنْ عَذابِكَ وَنارِكَ، وَاقْلِبْنى اِذا تَوَفَّيْتَنى اِلى جَنَّتِكَ بِرَحْمَتِكَ، اَللّـهُمَّ اِنّى اَعوُذُ بِكَ مِنْ زَوالِ نِعْمَتِكَ، وَمِنْ تَحْويلِ عافِيَتِكَ، وَمِنْ حُلوُلِ نَقِمَتِكَ وَمِنْ نُزوُلِ عَذابِكَ، وَاَعوُذُ بِكَ مِنْ جَهْدِ الْبَلاءِ، وَدَرَكِ الشِّقآءِ، وَمِنْ سُوءِ الْقَضآءِ، وَشَماتَةِ الاَْعْدآءِ، وَمِنْ شَرِّ ما يَنْزِلُ مِنَ السَّمآءِ، وَمِنْ شَرِّ ما فِى الْكِتابِ الْمُنْزَلِ، اَللّـهُمَّ لا تَجْعَلْنى مِنَ الاَْشْرارِ، وَلا مِنْ اَصْحابِ النّارِ، وَلا تَحْرِمْنى صُحْبَةَ الاَْخْيارِ، وَاَحْيِنى حَياةً طَيِّبَةً وَتَوَفَّنى وَفاةً طَيِّبَةً تُلْحِقْنى بِالاَبْرارِ، وَارْزُقْنى مُرافَقَةِ الاَنْبِيآءِ فى مَقْعَدِ صِدْق عِنْدَ مَليك مُقْتَدِر، اَللّـهُمَّ لَكَ الْحَمْدُ عَلى حُسْنِ بَلائِكَ وَصُنْعِكَ، وَلَكَ الْحَمْدُ عَلَى الاِْسْلامِ وَاتِّباعِ السُّنَةِ يا رَبِّ كَما هَدَيْتَهُمْ لِدينِكَ وَعَلَّمْتَهُمْ كِتابَكَ فَاهْدِنا وَعَلِّمْنا، وَلَكَ الْحَمْدُ عَلى حُسْنِ بَلائِكَ وَصُنْعِكَ عِنْدى خآصَّةً كَما خَلَقْتَنى فَاَحْسَنْتَ خَلْقى، وَعَلَّمْتَنى فَاَحْسَنْتَ تَعْليمى، وَهَدَيْتَنى فَاَحْسَنْتَ هِدايَتى، فَلَكَ الْحَمْدُ عَلى اِنْعامِكَ عَلَىَّ قَديماً وَحَديثاً، فَكَمْ مِنْ كَرْب يا سَيِّدى قَدْ فَرَّجْتَهُ، وَكَمْ مِنْ غَمٍّ يا سَيِّدى قَدْ نَفَّسْتَهُ، وَ كَمْ مِنْ هَمّ يا سيِّدى قَد كَشَفتَه، وَكَم مَنْ بَلاء يا سيِّدى قَد صَرفَتَه وَكَمْ مِنْ عَيْب يا سَيِّدى قَدْ سَتَرْتَهُ، فَلَكَ الْحَمْدُ عَلى كُلِّ حال فى كُلِّ مَثْوىً وَزَمان وَمُنْقَلَب وَمَقام، وَعَلى هذِهِ الْحالِ وَكُلِّ حال اَللّـهُمَّ اجْعَلْنى مِنْ اَفْضَلِ عِبادِكَ نَصيباً فى هذَا الْيَوْمِ مِنْ خَيْر تَقْسِمُهُ اَوْ ضُرٍّ تَكْشِفُهُ اَوْ سُوء تَصْرِفُهُ اَوْ بَلاء تَدْفَعُهُ اَوْ خَيْر تَسوُقُهُ اَوْ رَحْمَة تَنْشُرُها اَوْ عافِيَة تُلْبِسُها، فَاِنَّكَ عَلى كُلِّ شَىْء قَديرٌ وَبِيَدِكَ خَزآئِنُ السَّماواتِ وَالاَْرْضِ، وَاَنْتَ الْواحِدُ الْكَريمُ الْمُعْطِى الَّذى لا يُرَدَّ سآئِلُهُ، وَلا يُخَيَّبُ آمِلُهُ، وَلا يَنْقُصُ نآئِلُهُ، وَلا يَنْفَدُ ما عِنْدَهُ بَلْ يَزْدادُ كَثْرَةً وَطَيِّباً وَعَطآءً وَجوُداً، وَارْزُقْنى مِنْ خَزآئِنِكَ الَّتى لا تَفْنى، وَمِنْ رَحْمَتِكَ الْواسِعَةِ اِنَّ عَطآءَكَ لَمْ يَكُنْ مَحْظوُراً، وَاَنْتَ عَلى كُلِّ شَىْء قَديرٌ بِرَحْمَتِكَ يا اَرْحَمَ الرّاحِمينَ.',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: 'الثاني :',
                  subtitle:
                      'أن يسبّح ألف مرّة بالتّسبيحات العشر الّتي رواها السّيد وستأتي في أعمال يوم عرفة.',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: 'الثالث :',
                  subtitle:
                      'أن يقرأ الدّعاء اَللّـهُمَّ مَنْ تَعَبَّأَ وَتَهَيَّأَ المسنون قراءته في يوم عرفة وليلة الجمعة ونهارها، وقد مرّ في خلال أعمال ليلة الجمعة.',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: 'الرابع :',
                  subtitle:
                      'أن يزور الحسين (عليه السلام) وأرض كربلاء ويقيم بها حتّى يعيّد، ليقيه الله شرّ سنته.',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
            ],
          ),
        ),
        bottomNavigationBar: AddCustomBottomNavigationBar(
        pushNext: AlyawmAltasi3Zilhoja.screenRoute,
        pushBack: AlyawmAlsamin3asharZilhoja.screenRoute,
        soud: 'https://cdn.jsdelivr.net/gh/SounaDiab/image_audio@master/audio/الليلة التاسعة من ذي الحجة.mp3',
        onTap: (double fontSize) {
          // تحديث حجم الخط
          setState(() {
            isTablet ? _fontSizeTablet = fontSize : _fontSize = fontSize;
          });
          print('fontSize: $fontSize');
          // إغلاق Dialog
          Navigator.of(context).pop();
        },
        onLongPress: () {
          final snackBar = SnackBar(
            content: Center(
              child: Text(
                '${isTablet ? _fontSizeTablet.toInt() : _fontSize.toInt()}',
                style: TextStyle(
                  color: Colors.white,
                  fontSize: 16,
                ),
              ),
            ),
            width: 60,
            behavior: SnackBarBehavior.floating,
            backgroundColor: Colors.blue,
            duration: Duration(seconds: 2),
            shape: ShapeBorder.lerp(
              RoundedRectangleBorder(
                borderRadius: BorderRadius.circular(50),
              ),
              RoundedRectangleBorder(
                borderRadius: BorderRadius.circular(50),
              ),
              1,
            ),
          );
          ScaffoldMessenger.of(context).showSnackBar(snackBar);
        },
      ),
      ),
    );
  }
}
