import 'package:flutter/material.dart';
import 'package:maktabat_almoslim/widgets/container_scrollview.dart';
import 'package:provider/provider.dart';
import 'package:shared_preferences/shared_preferences.dart';

import '../../../../widgets/add_custom_bottom_navigation_bar.dart';
import '../../../../widgets/list_of_nine_verses.dart';
import '../../../favorites_provider.dart';
import '../../../favorites_screen.dart';
import '../zi_lhoja.dart';
import 'allayla_alsamina_3ashara_zilhoja.dart';
import 'khotbat_amir_almo2minin_tawm_al8adir.dart';

class AlyawmAlsamin3asharZilhoja extends StatefulWidget {
  static String screenRoute = 'alyawm_alsamin_3ashar_zilhoja_screen';
  const AlyawmAlsamin3asharZilhoja({super.key});

  @override
  State<AlyawmAlsamin3asharZilhoja> createState() =>
      _AlyawmAlsamin3asharZilhojaState();
}

double _fontSize = 18;
double _fontSizeTablet = 30;

class _AlyawmAlsamin3asharZilhojaState
    extends State<AlyawmAlsamin3asharZilhoja> {
  bool isIcon = true;
  @override
  void initState() {
    super.initState();
    _loadFavoriteState();
  }

  Future<void> _loadFavoriteState() async {
    final prefs = await SharedPreferences.getInstance();
    bool? savedState =
        prefs.getBool('isFavorite_alyawm_alsamin_3ashar_zilhoja_screen');
    setState(() {
      isIcon = savedState ?? true;
    });
  }

  Future<void> _saveFavoriteState(bool value) async {
    final prefs = await SharedPreferences.getInstance();
    await prefs.setBool(
        'isFavorite_alyawm_alsamin_3ashar_zilhoja_screen', value);
  }

  Future<bool> _onWillPop() async {
    final args =
        ModalRoute.of(context)!.settings.arguments as Map<String, dynamic>?;
    final previousPage = args?['previousPage'];
    if (previousPage == 'favorite_screen') {
      Navigator.of(context).pushReplacementNamed(FavoritesScreen.screenRoute);
      return false;
    } else {
      Navigator.of(context).pushReplacementNamed(ZiLhoja.screenRoute);
      return false;
    }
  }

  @override
  Widget build(BuildContext context) {
    double size = MediaQuery.of(context).textScaleFactor;
    final screenWidth = MediaQuery.of(context).size.width;
    final isTablet = screenWidth >= 600;
    return WillPopScope(
      onWillPop: _onWillPop,
      child: Scaffold(
        appBar: AppBar(
          toolbarHeight: isTablet ? 100 : 50,
          centerTitle: true,
          leading: IconButton(
            onPressed: _onWillPop,
            icon: Icon(
              Icons.arrow_back,
              size: isTablet ? 50 : 25,
            ),
          ),
          actions: [
            IconButton(
              padding: EdgeInsets.only(left: isTablet ? 50 : 30),
              icon: Icon(
                isIcon ? Icons.favorite_border : Icons.favorite_rounded,
                size: isTablet ? 40 : 25,
                color: isIcon ? Colors.black : Colors.red,
              ),
              onPressed: () async {
                setState(() {
                  isIcon = !isIcon;
                });
                await _saveFavoriteState(isIcon);

                if (!isIcon) {
                  Provider.of<FavoritesProvider>(context, listen: false)
                      .addFavorite('اليوم الثامن عشر -- يوم الغدير وأعماله',
                          AlyawmAlsamin3asharZilhoja.screenRoute);
                } else {
                  Provider.of<FavoritesProvider>(context, listen: false)
                      .removeFavorite(
                          'اليوم الثامن عشر -- يوم الغدير وأعماله',
                          AlyawmAlsamin3asharZilhoja.screenRoute,
                          AlyawmAlsamin3asharZilhoja.screenRoute);
                }
              },
            ),
          ],
          title: Text(
            'اليوم الثامن عشر -- يوم الغدير وأعماله',
            style: TextStyle(
              fontSize: isTablet
                  ? 40
                  : size > 1.0
                      ? 20
                      : 23,
              fontWeight: FontWeight.bold,
            ),
          ),
        ),
        body: ContainerScrollview(
          widget: Column(
            crossAxisAlignment: CrossAxisAlignment.start,
            children: [
              Container(
                child: Column(
                  children: [
                    Center(
                      child: Text(
                        'بسم الله الرحمن الرحيم',
                        style: TextStyle(
                          fontSize: isTablet ? _fontSizeTablet : _fontSize,
                          fontWeight: FontWeight.w900,
                        ),
                      ),
                    ),
                    Center(
                      child: Text(
                        'اللهم صلِّ على محمد وآل محمد',
                        style: TextStyle(
                          fontSize: isTablet ? _fontSizeTablet : _fontSize,
                          fontWeight: FontWeight.w900,
                        ),
                      ),
                    ),
                  ],
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: '',
                  subtitle:
                      'يوم عيد الغدير وهو عيد الله الاكبر وعيد آل محمّد (عليهم السلام)، وهو أعظم الاعياد ما بعث الله تعالى نبيّاً الّا وهو يعيد هذا اليوم ويحفظ حُرمته، واسم هذا اليوم في السّماء يوم العهد المعهود، واسمه في الارض يوم الميثاق المأخوذ والجمع المشهود، وروي انّه سُئِل الصّادق (عليه السلام) : هل للمسلمين عيد غير يوم الجمعة والاضحى والفطر ؟ قال : نعم أعظمها حُرمة ، قال الراوي : وأيّ عيد هو ؟ قال : اليوم الذي نصب فيه رسول الله (صلى الله عليه وآله وسلم) امير المؤمنين (عليه السلام) وقال : ومن كنت مولاه فعليٌّ مولاه، وهو يوم ثماني عشر من ذي الحجّة . قال الراوي : وما ينبغي لنا أن نفعل في ذلك اليوم ؟ قال : الصّيام والعبادة والذّكر لمحمّد وآل محمّد (عليهم السلام) والصّلاة عليهم، وأوصى رسول الله (صلى الله عليه وآله وسلم) امير المؤمنين (عليه السلام) أن يتّخذ ذلك اليوم عيداً وكذلك كانت الانبياء تفعل، كانوا يوصون أوصياءهم بذلك فيتّخذونه عيداً، وفي حديث أبي نصر البزنطي عن الرّضا صلوات الله وسلامُه عليه انّه قال : يا ابن أبي نصر أينما كنت فاحضر يوم الغدير عند أمير المؤمنين (عليه السلام)فانّ الله تبارك وتعالى يغفر لكلّ مؤمن ومؤمنة ومسلم ومُسلمة ذنوبُ ستّين سنة، ويعتق من النّار ضعف ما اعتق في شهر رمضان وليلة القدر وليلة الفطر، والدرهم فيه بألف درهم لاخوانك العارفين، وأفضل على اخوانك في هذا اليوم وسُرّ فيه كلّ مؤمن ومؤمنة، والله لو عرف النّاس فضل هذا اليوم بحقيقته لصافحتهم الملائكة في كلّ يوم عشر مرّات، واخلاصة انّ تعظيم هذا اليوم الشّريف لازم وأعماله عديدة :',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: 'الاوّل :',
                  subtitle:
                      'الصوم وهو كفّارة ذنوبُ ستّين سنة، وقد روي انّ صيامه يعدل صيام الدّهر ويعدل مائة حجّة وعمرة.',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: 'الثاني :',
                  subtitle: 'الغُسل.',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: 'الثالث :',
                  subtitle:
                      'زيارة امير المؤمنين (عليه السلام) وينبغي أن يجتهد المرء أينما كان فيحضر عند قبر أمير المؤمنين (عليه السلام) وقد حكيت له (عليه السلام) زيارات ثلاث في هذا اليوم، أولاها زيارة امين الله المعروفة ويزاربها في القرب والبُعد وهي من الزّيارات الجامعة المطلقة ايضاً، وستأتي في باب الزّيارات ان شاء الله تعالى.',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: 'الرابع :',
                  subtitle:
                      'أن يتعوّذ بما رواه السّيد في الاقبال عن النّبي (صلى الله عليه وآله وسلم).',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: 'الخامس :',
                  subtitle:
                      'أن يصلّي ركعتين ثمّ يسجد ويشكر الله عزوجل مائة مرّة ثمّ يرفع رأسه من السّجود ويقول:\n\n'
                      'اَللّـهُمَّ اِنِّى اَسْاَلُكَ بِاَنَّ لَكَ الْحَمْدَ وَحْدَكَ لا شَرِيكَ لَكَ، وَاَنَّكَ واحِدٌ اَحَدٌ صَمَدٌ لَمْ تَلِدْ وَلَمْ تُولَدْ وَلَمْ يَكُنْ لَكَ كُفُواً اَحَدٌ، وَاَنَّ مُحَمّداً عَبْدُكَ وَرَسُولُكَ صَلَواتُكَ عَلَيْهِ وَآلِهِ، يا مَنْ هُوَ كُلَّ يَوْم فى شَأن كَما كانَ مِنْ شَأنِكَ اَنْ تَفَضَّلْتَ عَلَىَّ بِاَنْ جَعَلْتَنى مِنْ اَهْلِ اِجابَتِكَ، وَاَهْلِ دِينِكَ، وَاَهْلِ دَعْوَتِكَ، وَوَفَّقْتَنى لِذلِكَ فى مُبْتَدَءِ خَلْقى تَفَضُّلاً مِنْكَ وَكَرَماً وَجُوداً، ثُمَّ اَرْدَفْتَ الْفَضْلَ فَضْلاً، وَالْجُودَ جُوداً، وَالْكَرَمَ كَرَماً رَأفَةً مِنْكَ وَرَحْمَةً اِلى اَنْ جَدَّدْتُ ذلِكَ الْعَهْدَ لى تَجْدِيداً بَعْدَ تَجدِيدِكَ خَلْقى، وَكُنْتُ نَسْياً مَنْسِيّاً ناسِياً ساهِياً غافِلاً، فَاَتْمَمْتَ نِعْمَتَكَ بِاَنْ ذَكَّرْتَنى ذلِكَ وَمَنَنْتَ بِهِ عَلَىَّ، وَهَدَيْتَنى لَهُ، فَليَكُنْ مِنْ شَأنِكَ يا اِلهى وَسَيِّدى وَمَولاىَ اَنْ تُتِمَّ لى ذلِكَ وَلا تَسْلُبْنيهِ حَتّى تَتَوَفّانى عَلى ذلِكَ وَاَنتَ عَنّى راض، فَاِنَّكَ اَحَقُّ المُنعِمِينَ اَنْ تُتِمَّ نِعمَتَكَ عَلَىَّ، اَللّـهُمَّ سَمِعْنا وَاَطَعْنا وَاَجَبْنا داعِيَكَ بِمَنِّكَ، فَلَكَ الْحَمْدُ غُفْرانَكَ رَبَّنا وَاِلَيكَ المَصيرُ، آمَنّا بِاللهِ وَحدَهُ لا شَريكَ لَهُ، وَبِرَسُولِهِ مُحَمَّد صَلَّى اللهُ عَلَيْهِ وَآلِهِ، وَصَدَّقْنا وَاَجبْنا داعِىَ اللهِ، وَاتَّبَعْنا الرَّسوُلَ فى مُوالاةِ مَوْلانا وَمَوْلَى الْمُؤْمِنينَ اَميرَ المُؤْمِنينَ عَلِىِّ بْنِ اَبيطالِب عَبْدِاللهِ وَاَخى رَسوُلِهِ وَالصِّدّيقِ الاكْبَرِ، وَالحُجَّةِ عَلى بَرِيَّتِهِ، المُؤَيِّدِ بِهِ نَبِيَّهُ وَدينَهُ الْحَقَّ الْمُبينَ، عَلَماً لِدينِ اللهِ، وَخازِناً لِعِلْمِهِ، وَعَيْبَةَ غَيْبِ اللهِ، وَمَوْضِعَ سِرِّ اللهِ، وَاَمينَ اللهِ عَلى خَلْقِهِ، وَشاهِدَهُ فى بَرِيَّتِهِ، اَللّـهُمَّ رَبَّنا اِنَّنا سَمِعْنا مُنادِياً يُنادى لِلايمانِ اَنْ آمِنُوا بِرَبِّكُمْ فَآمَنّا رَبَّنا فَاغْفِرْ لَنا ذُنُوبَنا وَكَفِّرْ عَنّا سَيِّئاتِنا وَتَوَفَّنا مَعَ الابْرارِ، رَبَّنا وَآتِنا ما وَعَدْتَنا عَلى رُسُلِكَ وَلا تُخْزِنا يَوْمَ الْقِيامَةِ اِنَّكَ لا تُخْلِفُ الْميعادَ فَاِنّا يا رَبَّنا بِمَنِّكَ وَلُطْفِكَ اَجَبنا داعيكَ، وَاتَّبَعْنَا الرَّسُولَ، وَصَدَّقْناهُ '
                      'وَصَدَّقْنا مَوْلَى الْمُؤْمِنينَ، وَكَفَرْنا بِالجِبْتِ وَالطّاغُوتِ، فَوَلِّنا ما تَوَلَّيْنا، وَاحْشُرْنا مَعَ اَئِمَّتَنا فَاِنّا بِهِمْ مُؤْمِنُونَ مُوقِنُونَ، وَلَهُمْ مُسَلِّمُونَ آمَنّا بِسِرِّهِمْ وَعَلانِيَتِهِمْ وَشاهِدِهِمْ وَغائِبِهِمْ وَحَيِّهِمْ وَمَيِّتِهِمْ، وَرَضينا بِهِمْ اَئِمَّةً وَقادَةً وَسادَةً، وَحَسْبُنا بِهِمْ بَيْنَنا وَبَيْنَ اللهِ دُونَ خَلْقِهِ لا نَبْتَغى بِهِمْ بَدَلاً، وَلا نَتَّخِذُ مِنْ دُونِهِمْ وَليجَةً، وَبَرِئْنا اِلَى اِلله مِنْ كُلِّ مَنْ نَصَبَ لَهُمْ حَرْباً مِنَ الْجِنِّ وَالاِنْسِ مِنَ الاَوَّلينَ وَالاخِرِينَ، وَكَفَرْنا بِالْجِبْتِ وَالطّاغُوتِ وَالاوثانِ الارْبَعَةِ وَاَشْياعِهِمْ وَاَتْباعِهِمْ، وَكُلِّ مَنْ والاهُمْ مِنَ الْجِنِّ وَالاْنْسِ مِنْ اَوَّلِ الدَّهرِ اِلى آخِرِهِ، اَللّـهُمَّ اِنّا نُشْهِدُكَ اَنّا نَدينُ بِما دانَ بِهِ مُحَمَّدٌ وَآلَ مُحَمَّد صَلّى اللهُ عَلَيْهِ وَعَلَيْهِمْ، وَقَوْلُنا ما قالُوا وَدينُنا ما دانُوا بِهِ، ما قالُوا بِهِ قُلْنا، وَما دانُو بِهِ دِنّا، وَما اَنْكَرُوا اَنْكَرْنا، وَمَنْ والَوْا والَيْنا، وَمَنْ عادُوا عادَيْنا، وَمَنْ لَعَنُوا لَعَنّا، وَمَنْ تَبَرَّؤُا مِنهُ تَبَرَّأنا مِنْهُ، وَمَنْ تَرَحَّمُوا عَلَيْهِ تَرَحَّمْنا عَلَيْهِ آمَنّا وَسَلَّمْنا وَرَضينا وَاتَّبَعْنا مَوالينا صَلَواتُ اللهِ عَلَيْهِمْ، اَللّـهُمَّ فَتِمِّمْ لَنا ذلِكَ وَلا تَسْلُبْناُه، وَاجْعَلْهُ مُسْتَقِرّاً ثابِتاً عِنْدَنا، وَلا تَجْعَلْهُ مُسْتَعاراً، وَاَحْيِنا ما اَحْيَيْتَنا عَلَيْهِ، وَاَمِتْنا اِذا اَمَتَّنا عَلَيْهِ آلُ مُحَمَّد اَئِمَّتَنا فَبِهِمْ نَأتَمُّ وَاِيّاهُمْ نُوالى، وَعَدُوَّهُمْ عَدُوَّ اللهِ نُعادى، فَاجْعَلْنا مَعَهُمْ فِى الدُّنْيا وَالاخِرَةِ، وَمِنَ الْمُقَرَّبينَ فَاِنّا بِذلِكَ راضُونَ يا اَرْحَمَ الرّاحِمينَ.\n\n'
                      'ثمّ يسجد ثانياً ويقول مائة مرّة اَلْحَمْدُ للهِ (ومائة مرّة) شُكْراً للهِ، وروي انّ من فعل ذلك كان كمن حضر ذلك اليوم وبايع رسول الله (صلى الله عليه وآله وسلم) على الولاية الخبر ، والافضل أن يُصلّي هذه الصّلاة قُرب الزّوال وهي السّاعة التي نصب فيها أمير المؤمنين (عليه السلام) بغدير خم اماماً للنّاس وأن يقرأ في الرّكعة الاُولى منها سورة القدر وفي الثّانية التّوحيد.',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: 'السادس :',
                  subtitle:
                      'أن يغتسل ويُصلي ركعتين من قبل أن تزول الشّمس بنصف ساعة يقرأ في كلّ ركعة سورة الحمد مرّة وقُلْ هُوَ اللهُ اَحَدٌ عشر مرّات وآية الكرسي عشر مرّات واِنّا اَنزَلْناهُ عشراً، فهذا العمل يعدل عند الله عزوجل مائة ألف حجّة ومائة ألف عُمرة، ويُوجب أن يقضي الله الكريم حوائج دنياه وآخرته في يُسر وعافية، ولا يخفى عليك انّ السّيد في الاقبال قدّم ذكر سورة القدر على آية الكرسي في هذه الصّلاة، وتابعه العلامة المجلسي في زاد المعاد فقدّم ذكر القدر كما صنعت أنا في سائر كتبي، ولكنّي بعد التتبّع وجدت الاغلب ممّن ذكروا هذه الصّلاة قد قدّموا ذكر آية الكرسي على القدر واحتمال سهو القلم من السّيد نفسه أو من النّاسخين لكتابه في كلا موردي الخلاف وهما عدد الحمد وتقديم القدر بعيد غاية البُعد، كاحتمال كون ما ذكره السّيد عملاً مستقلاً مغايراً للعمل المشهور والله تعالى هو العالم، والافضل أن يدعو بعد هذه الصّلاة بهذا الدّعاء رَبَّنا اِنَّنا سَمِعْنا مُنادِياً الدّعاء بطوله.',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: 'السابع :',
                  subtitle: 'أن يدعو بدعاء النّدبة.',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: 'الثامن :',
                  subtitle:
                      'أن يدعو بهذا الدّعاء الذي رواه السّيد ابن طاووس عن الشّيخ المفيد :\n\n'
                      'اَللّـهُمَّ اِنّى اَسْاَلُكَ بِحَقِّ مُحَمَّد نَبِيِّكَ، وَعَلِىّ وَليُّك وَ الشَأن وَ الْقَدر اَلَّذي خَصَصَتْها بِه دونَ خَلقِكَ اَنْ تُصَلّى عَلى مُحَمَّد وَ علىٍّ وَاَنْ تَبْدَأَ بِهِما فى كُلِّ خَيْر عاجِل، اَللّـهُمَّ صَلِّ عَلى مُحَمَّد وَآلِ مُحَمَّد الاَْئِمَّةِ الْقادَةِ، وَالدُّعاةِ السّادَةِ، وَالنُّجُومِ الزّاهِرَةِ، وَالاَْعْلامِ الْباهِرَةِ، وَساسَةِ الْعِبادِ، وَاَرْكانِ الْبِلادِ، وَالنّاقَةِ الْمُرْسَلَةِ، وَالسَّفينَةِ النّاجيَةِ الْجارِيَةِ فِى الْلُّجَجِ الْغامِرَةِ، اَللّـهُمَّ صَلِّ عَلى مُحَمَّد وَآلِ مُحَمَّد خُزّانِ عِلْمِكَ، وَاَرْكانِ تَوْحِيدِكَ، وَدَعآئِمِ دينِكَ، وَمَعادِنِ كَرامَتِكَ وَصِفْوَتِكَ مِنْ بَرِيَّتِكَ وَخِيَرَتِكَ مِنْ خَلْقِكَ، الاَْتْقِيآءِ الاَْنْقِيآءِ النُّجَبآءِ الاَْبْرارِ، وَالْبابِ الْمُبْتَلى بِهِ النّاسُ، مَنْ اَتاهُ نَجى وَمَنْ اَباهُ هَوى، اَللّـهُمَّ صَلِّ عَلى مُحَمَّد وَآلِ مُحَمَّد اَهْلِ الذِّكْرِ الَّذينَ اَمَرْتَ بِمَسْأَلَتِهِمْ، وَذَوِى الْقُرْبى الَّذينَ اَمَرْتَ بِمَوَدَّتِهِمْ، وَفَرَضْتَ حَقَّهُمْ، وَجَعَلْتَ الْجَنَّةَ مَعادَ مَنِ اقْتَصَّ آثارَهُمْ، اَللّـهُمَّ صَلِّ عَلى مُحَمَّد وَآلِ مُحَمَّد كَما اَمرَوُا بِطاعَتِكَ، وَنَهَوْا '
                      'عَنْ مَعْصِيَتِكَ، وَدَلُّوا عِبادَكَ عَلى وَحْدانِيَّتِكَ، اَللّـهُمَّ اِنّى اَسْاَلُكَ بِحَقِّ مُحَمَّد نَبِيِّكَ وَنَجيبِكَ وَصَفْوَتِكَ وَاَمينِكَ وَرَسُولِكَ اِلى خَلْقِكَ، وَبِحَقِّ اَميرِ الْمُؤْمِنينَ، وَيَعْسُوبِ الدّينِ، وَقائِدِ الْغُرِّ الُْمحَجَّلينَ، الْوَصِىِّ الْوَفِىِّ، وَالصِّدّيقِ الاَْكْبَرِ، وَالْفارُوقِ بَيْنَ الْحَقِّ وَالْباطِلِ، وَالشّاهِدِ لَكَ، وَالدّالِّ عَلَيْكَ، وَالصّادِعِ بِاَمْرِكَ، وَالُْمجاهِدِ فى سَبيلِكَ، لَمْ تَأخُذْهُ فيكَ لَوْمَةُ لائِمِ، اَنْ تُصَلِّىَ عَلى مُحَمَّد وَآلِ مُحَمَّد، وَاَنْ تَجْعَلَنى فى هذَا الْيَوْمِ الَّذى عَقَدْتَ فيهِ لِوَلِيِّكَ الْعَهْدَ فى اَعْناقِ خَلْقِكَ، وَاَكْمَلْتَ لَهُمُ الّدينَ مِنَ الْعارِفينَ بِحُرْمَتِهِ، وَالْمُقِرّينَ بِفَضْلِهِ مِنْ عُتَقآئِكَ وَطُلَقائِكَ مِنَ النّارِ، وَلا تُشْمِتْ بى حاسِدىِ النِّعَمِ، اَللّـهُمَّ فَكَما جَعَلْتَهُ عيدَكَ الاَْكْبَرَ، وَسَمَّيْتَهُ فِى السَّمآءِ يَوْمَ الْعَهْدِ الْمَعْهُودِ، وَفِى الاَْرْضِ يَوْمَ الْميثاقِ الْمَاْخُوذِ وَالجَمْعِ المَسْؤولِ صَلِّ عَلى مُحَمَّد وَآلِ مُحَمَّد، وَاَقْرِرْ بِهِ عُيُونَنا، وَاجْمَعْ بِهِ شَمْلَنا، وَلا تُضِلَّنا بَعْدَ اِذْ هَدَيْتَنا، وَاجْعَلْنا لاَِنْعُمِكَ مِنَ الشّاكِرينَ يا اَرْحَمَ الرّاحِمينَ، الْحَمْدُ للهِ الَّذى عَرَّفَنا فَضْلَ هذَا الْيَوْمِ، وَبَصَّرَنا حُرْمَتَهُ، وَكَرَّمَنا بِهِ، وَشَرَّفَنا بِمَعْرِفَتِهِ، وَهَدانا بِنُورِهِ، يا رَسُولَ اللهِ يا اَميرِ الْمُؤْمِنينَ عَلَيْكُما وَعَلى عِتْرَتِكُما وَعَلى مُحِبِّيكُما مِنّى اَفْضَلُ السَّلامِ ما بَقِىَ اللّيْلُ وَالنَّهارُ، وَبِكُما اَتَوَجَّهُ اِلىَ اللهِ رَبّى وَرَبِّكُما فى نَجاحِ طَلِبَتى، وَقَضآءِ حَوآئِجى، وَتَيْسيرِ اُمُورى، اَللّـهُمَّ اِنّى اَسْاَلُكَ بِحَقِّ مُحَمَّد وَآلِ مُحَمَّد اَنْ تُصَلِّىَ عَلى مُحَمَّد وَآلِ مُحَمَّد، وَاَنْ تَلْعَنَ مَنْ جَحَدَ حَقَّ هذَا الْيَوْمِ، وَاَنْكَرَ حُرْمَتَهُ فَصَدَّ عَنْ سَبيلِكَ لاِطْفآءِ نُورِكَ، فَاَبَى اللهُ اِلاّ اَنْ يُتِمَّ نُورَهُ، اَللّـهُمَّ فَرِّجْ عَنْ اَهْلِ بَيْتِ مُحَمَّد نَبِيِّكَ، وَاكْشِفْ عَنْهُمْ وَبِهِمْ عَنِ الْمُؤْمِنِينَ الْكُرُباتِ، اَللّـهُمَّ امْلاِِ الاَْرْضَ بِهِمْ عَدْلاً كَما مُلِئَتْ ظُلْماً وَجُوْراً، وَاَنْجِز لَهُمْ ما وَعَدْتَهُمْ اِنَّكَ لا تُخْلِفُ الْميعادَ.\n\n'
                      'وليقرأ إن أمكنته الادعية المبسوطة التي رواها السّيد في الاقبال.',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: 'التاسع',
                  subtitle:
                      'أن يهنّىء من لاقاهُ من اخوانه المؤمنين بقوله : اَلْحَمْدُ للهِ الّذى جَعَلَنا مِنَ الْمُتَمَسِّكينَ بِوِلايَةِ اَميرِ الْمُؤْمِنينَ وَالاَئِمَّةِ عَلَيْهِمُ السَّلامُ ويقول أيضاً : اَلْحَمْدُ للهِ الَّذى اَكْرَمَنا بِهذَا الْيَوْمِ وَجَعَلَنا مِنَ الْمُوفينَ، بِعَهْدِهِ اِلَيْنا وَميثاقِهِ الّذى واثَقَنا بِهِ مِنْ وِلايَةِ وُلاةِ اَمْرِهِ وَالْقَوّامِ بِقِسْطِهِ، وَلَمْ يَجْعَلْنا مِنَ الْجاحِدينَ وَالْمُكَذِّبينَ بِيَوْمِ الدِّينَ.',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: 'العاشر :',
                  subtitle:
                      'أن يقول مائة مرّة : اَلْحَمْدُ للهِ الّذى جَعَلَ كَمالَ دينِهِ وَتَمامَ نِعْمَتِهِ بِوِلايَةِ اَميرِ الْمُؤمِنينَ عَلىِّ بْنِ اَبى طالِب عَلَيْهِ السَّلامُ.',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: '',
                  subtitle:
                      'واعلم انّه قد ورد في هذا اليوم فضيلة عظيمة لكلّ من اعمال تحسين الثّياب، والتزيّن، واستعمال الطّيب، والسّرور، والابتهاج، وافراح شيعة امير المؤمنين صلوات الله وسلامُهُ عليه، والعفو عنهم، وقضاء حوائجهم، وصلة الارحام، والتّوسّع على العيال، واطعام المؤمنين، وتفطير الصّائمين، ومصافحة المؤمنين، وزيارتهم، والتّبسّم في وجوههم، وارسال الهدايا اليهم، وشكر الله تعالى على نعمته العظمى نعمة الولاية، والاكثار من الصّلاة على محمّد وآل محمّد (عليهم السلام)، ومن العبادة والطّاعة، ودرهم يعطى فيه المؤمن أخاه يعدل مائة ألف درهم في غيره من الايّام، واطعام المؤمن فيه كأطعام جميع الانبياء والصّديقين.',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
            ],
          ),
        ),
        bottomNavigationBar: AddCustomBottomNavigationBar(
        pushNext: KhotbatAmirAlmo2mininTawmAl8adir.screenRoute,
        pushBack: AllaylaAlsamina3asharaZilhoja.screenRoute,
        soud: '',
        onTap: (double fontSize) {
          // تحديث حجم الخط
          setState(() {
            isTablet ? _fontSizeTablet = fontSize : _fontSize = fontSize;
          });
          print('fontSize: $fontSize');
          // إغلاق Dialog
          Navigator.of(context).pop();
        },
        onLongPress: () {
          final snackBar = SnackBar(
            content: Center(
              child: Text(
                '${isTablet ? _fontSizeTablet.toInt() : _fontSize.toInt()}',
                style: TextStyle(
                  color: Colors.white,
                  fontSize: 16,
                ),
              ),
            ),
            width: 60,
            behavior: SnackBarBehavior.floating,
            backgroundColor: Colors.blue,
            duration: Duration(seconds: 2),
            shape: ShapeBorder.lerp(
              RoundedRectangleBorder(
                borderRadius: BorderRadius.circular(50),
              ),
              RoundedRectangleBorder(
                borderRadius: BorderRadius.circular(50),
              ),
              1,
            ),
          );
          ScaffoldMessenger.of(context).showSnackBar(snackBar);
        },
      ),
      ),
    );
  }
}
