import 'package:flutter/material.dart';
import 'package:maktabat_almoslim/widgets/container_scrollview.dart';
import 'package:provider/provider.dart';
import 'package:shared_preferences/shared_preferences.dart';

import '../../../../widgets/add_custom_bottom_navigation_bar.dart';
import '../../../../widgets/list_of_nine_verses.dart';
import '../../../favorites_provider.dart';
import '../../../favorites_screen.dart';
import '../zi_lhoja.dart';
import 'alyawm_al2a5ir_men_zilhoja.dart';
import 'fi_a3mal_shaher_zilhoja.dart';

class ZiyaratAmirAlmo2mininYawmAl8adir extends StatefulWidget {
  static String screenRoute = 'ziyarat_amir_almo2minin_yawm_al8adir_screen';
  const ZiyaratAmirAlmo2mininYawmAl8adir({super.key});

  @override
  State<ZiyaratAmirAlmo2mininYawmAl8adir> createState() =>
      _ZiyaratAmirAlmo2mininYawmAl8adirState();
}

double _fontSize = 18;
double _fontSizeTablet = 30;

class _ZiyaratAmirAlmo2mininYawmAl8adirState
    extends State<ZiyaratAmirAlmo2mininYawmAl8adir> {
  bool isIcon = true;
  @override
  void initState() {
    super.initState();
    _loadFavoriteState();
  }

  Future<void> _loadFavoriteState() async {
    final prefs = await SharedPreferences.getInstance();
    bool? savedState =
        prefs.getBool('isFavorite_ziyarat_amir_almo2minin_yawm_al8adir_screen');
    setState(() {
      isIcon = savedState ?? true;
    });
  }

  Future<void> _saveFavoriteState(bool value) async {
    final prefs = await SharedPreferences.getInstance();
    await prefs.setBool(
        'isFavorite_ziyarat_amir_almo2minin_yawm_al8adir_screen', value);
  }

  Future<bool> _onWillPop() async {
    final args =
        ModalRoute.of(context)!.settings.arguments as Map<String, dynamic>?;
    final previousPage = args?['previousPage'];
    if (previousPage == 'favorite_screen') {
      Navigator.of(context).pushReplacementNamed(FavoritesScreen.screenRoute);
      return false;
    } else {
      Navigator.of(context).pushReplacementNamed(ZiLhoja.screenRoute);
      return false;
    }
  }

  @override
  Widget build(BuildContext context) {
    double size = MediaQuery.of(context).textScaleFactor;
    final screenWidth = MediaQuery.of(context).size.width;
    final isTablet = screenWidth >= 600;
    return WillPopScope(
      onWillPop: _onWillPop,
      child: Scaffold(
        appBar: AppBar(
          toolbarHeight: isTablet ? 100 : 50,
          centerTitle: true,
          leading: IconButton(
            onPressed: _onWillPop,
            icon: Icon(
              Icons.arrow_back,
              size: isTablet ? 50 : 25,
            ),
          ),
          actions: [
            IconButton(
              padding: EdgeInsets.only(left: isTablet ? 50 : 30),
              icon: Icon(
                isIcon ? Icons.favorite_border : Icons.favorite_rounded,
                size: isTablet ? 40 : 25,
                color: isIcon ? Colors.black : Colors.red,
              ),
              onPressed: () async {
                setState(() {
                  isIcon = !isIcon;
                });
                await _saveFavoriteState(isIcon);

                if (!isIcon) {
                  Provider.of<FavoritesProvider>(context, listen: false)
                      .addFavorite('زيارة أميرالمؤمنين (ع) في يوم الغدير',
                          ZiyaratAmirAlmo2mininYawmAl8adir.screenRoute);
                } else {
                  Provider.of<FavoritesProvider>(context, listen: false)
                      .removeFavorite(
                          'زيارة أميرالمؤمنين (ع) في يوم الغدير',
                          ZiyaratAmirAlmo2mininYawmAl8adir.screenRoute,
                          ZiyaratAmirAlmo2mininYawmAl8adir.screenRoute);
                }
              },
            ),
          ],
          title: Text(
            'زيارة أميرالمؤمنين (ع) في يوم الغدير',
            style: TextStyle(
              fontSize: isTablet
                  ? 40
                  : size > 1.0
                      ? 20
                      : 23,
              fontWeight: FontWeight.bold,
            ),
          ),
        ),
        body: ContainerScrollview(
          widget: Column(
            crossAxisAlignment: CrossAxisAlignment.start,
            children: [
              Container(
                child: Column(
                  children: [
                    Center(
                      child: Text(
                        'بسم الله الرحمن الرحيم',
                        style: TextStyle(
                          fontSize: isTablet ? _fontSizeTablet : _fontSize,
                          fontWeight: FontWeight.w900,
                        ),
                      ),
                    ),
                    Center(
                      child: Text(
                        'اللهم صلِّ على محمد وآل محمد',
                        style: TextStyle(
                          fontSize: isTablet ? _fontSizeTablet : _fontSize,
                          fontWeight: FontWeight.w900,
                        ),
                      ),
                    ),
                  ],
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title:
                      'روي عن الإمام الرضا (عليه السلام) أنه قال لابن أبي نصر :',
                  subtitle:
                      'يا ابن أبي نصر أينما كنت فاحضر يوم الغدير عند أمير المؤمنين (عليه السلام) فإنّ الله تعالى يغفر لكلّ مؤمن ومؤمنة ومُسلم ومُسلمة ذنُوب ستّين سنة، ويعتق مِنَ النّار ضعف ما اعتق في شهر رمضان وفي ليلة القدر وفي ليلة الفطر… الخبر.\n\n'
                      'وهذه الزيارة مرويّة باسناد معتبر عن الامام عليّ بن محمد النقي (عليهما السلام) قد زار (عليه السلام) بها الامير (عليه السلام) يوم الغدير في السّنة التي أشخصه المعتصم، وصفتها كما يلي : اذا أردت ذلك فقف على باب القُبّة المنوّرة واستأذن، وقال الشّيخ الشّهيد : تغتسل وتلبس أنظف ثيابك وتستأذن وتقول : اَللّـهُمَّ اِنّي وَقَفْتُ عَلى باب وهذا هوَ الاستيذان الاوّل الذي اثبتناه في الباب الاوّل ثمّ ادخل مقدماً رجلك اليمنى على اليسرى وامش حتّى تقف على الضّريح واستقبله واجعل القِبلة بين كتفيك وقُل:\n\n'
                      'اَلسَّلامُ عَلى مُحَمَّد رَسُولِ اللهِ خاتَمِ النَّبِيّينَ وَسَيِّدِ الْمُرْسَلينَ، وَصَفْوَةِ رَبِّ الْعالَمينَ، اَمينِ اللهِ عَلى وَحْيِهِ وَعَزائِمِ اَمْرِهِ، وَالْخاتِمِ لِما سَبَقَ، وَالْفاتِحِ لِمَا اسْتُقْبِلَ، وَالْمُهَيْمِنِ عَلى ذلِكَ كُلِّهِ وَرَحْمَةُ اللهِ وَبَرَكاتُهُ وَصَلَواتُهُ وَتَحِيّاتُهُ، اَلسَّلامُ عَلى اَنْبِياءِ اللهِ وَرُسُلِهِ وَمَلائِكَتِهِ الْمُقَرَّبينَ وَعِبادِهِ الصّالِحينَ، اَلسَّلامُ عَلَيْكَ يا اَميرَ الْمُؤْمِنينَ، وَسَيِّدَ الْوَصِيّينَ، وَوارِثَ عِلْمِ النَّبِيّينَ، وَوَلِيَّ رَبِّ الْعالَمينَ، وَمَوْلايَ وَمَوْلَى الْمُؤْمِنينَ وَرَحْمَةُ اللهِ وَبَرَكاتُهُ، اَلسَّلامُ عَلَيْكَ يا مَوْلايَ يا اَميرَ الْمُؤْمِنينَ ،يا اَمينَ اللهِ في اَرْضِهِ، وَسَفيرَهُ في خَلْقِهِ، وَحُجَّتَهُ الْبالِغَةَ عَلى عِبادِهِ، اَلسَّلامُ عَلَيْكَ يا دينَ اللهِ الْقَويمَ، وَصِراطَهُ الْمُسْتَقيمَ، اَلسَّلامُ عَلَيْكَ اَيُّهَا النَّبَأُ الْعَظيمُ الَّذي هُمْ فيهِ مُخْتَلِفُونَ وَعَنْهُ يَسْأَلُونَ، اَلسَّلامُ عَلَيْكَ يا اَميرَ الْمُؤْمِنينَ، آمَنْتَ بِاللهِ وَهُمْ مُشْرِكُونَ، وَصَدَّقْتَ بِالْحَقِّ وَهُمْ مُكَذِّبُونَ، وَجاهَدْتَ وَهُمْ مُحْجمُونَ، وَعَبَدْتَ اللهَ مُخْلِصاً لَهُ الدّينَ صابِراً مُحْتَسِباً حَتّى أَتاكَ الْيَقينُ، اَلا لَعْنَةُ اللهِ عَلَى الظّالِمينَ، اَلسَّلامُ عَلَيْكَ يا سَيِّدَ الْمُسْلِمينَ، وَيَعْسُوبَ الْمُؤْمِنينَُ وَاِمامَ الْمُتَّقينَ، وَقآئِدَ الْغُرِّ الُْمحَجَّلينَ وَرَحْمَةُ اللهِ وَبَرَكاتُهُ، اَشْهَدُ اَنَّكَ اَخُو رَسُولِ اللهِ وَوَصِيُّهُ، وَوارِثُ عِلْمِهِ وَاَمينُهُ عَلى شَرْعِهِ وَخَليفَتُهُ في اُمَّتِهِ، وَاَوَّلُ مَنْ آمَنَ بِاللهِ، وَصَدَّقَ بِما اُنْزِلَ عَلى نَبِيِّهِ، وَاَشْهَدُ اَنَّهُ قَدْ بَلَّغَ عَنِ اللهِ ما اَنْزَلَهُ فيكَ، فَصَدَعَ بِاَمْرِهِ، وَاَوْجَبَ عَلى اُمَّتِهِ فَرْضَ طاعَتِكَ وَوِلايَتِكَ، وَعَقَدَ عَلَيْهِمُ الْبَيْعَةَ لَكَ، وَجَعَلَكَ اَوْلى بِالْمُؤْمِنينَ مِنْ اَنْفُسِهِمْ كَما جَعَلَهُ اللهُ كَذلِكَ، ثُمَّ اَشْهَدَ اللهَ تَعالى عَلَيْهِمْ فَقالَ: اَلَسْتُ قَدْ بَلَّغْتُ، فَقالُوا: اَللّـهُمَّ بَلى، فَقالَ: اَللّـهُمَّ اشْهَدْ وَكَفى بِكَ شَهيداً وَحاكِماً بَيْنَ الْعِبادِ، فَلَعَنَ اللهُ جاحِدَ وِلايَتِكَ بَعْدَ الاِْقْرارِ، وَناكِثَ عَهْدِكَ بَعْدَ الْميثاقِ، وَاَشْهَدُ اَنَّكَ وَفَيْتَ بِعَهْدِ اللهِ تَعالى، وَاَنَّ اللهَ تَعالى مُوف لَكَ بِعَهْدِهِ، (وَمَنْ اَوْفى بِما عاهَدَ عَلَيْهُ اللهَ فَسَيُؤْتيهِ اَجْراً عَظيماً)، وَاَشْهَدُ اَنَّكَ اَميرُالْمُؤْمِنينَ الْحَقُّ الَّذي نَطَقَ بِوِلايَتِكَ التَّنْزيلُ، وَاَخَذَ لَكَ الْعَهْدَ عَلَى الاُْمَّةِ بِذلِكَ الرَّسُولُ، وَاَشْهَدُ اَنَّكَ وَعَمَّكَ وَاَخاكَ الَّذينَ تاجَرْتُمُ اللهَ بِنُفوُسِكُمْ فَاَنْزَلَ اللهُ فيكُمْ (اِنَّ اللهَ اشْتَرى مِنَ الْمُؤْمِنينَ اَنْفُسَهُمْ وَاَمْوالَهُمْ بِاَنَّ لَهُمُ الْجَنَّةَ يُقاتِلُونَ في سَبيلِ اللهِ فَيَقْتُلُونَ وَيُقْتَلُونَ وَعْداً عَلَيْهِ حَقّاً فِي التَّوْراةِ وَالاِْنْجيلِ وَالْقُرْآنِ وَمَنْ اَوْفى بِعَهْدِهِ مِنَ اللهِ فَاسْتَبْشِروُا بِبِيْعِكُمُ الَّذي بايَعْتُمْ بِهِوَذلِكَ هُوَ الْفَوْزُ الْعَظيمُ)  (التّائِبُونَ الْعابِدُونَ الْحامِدُونَ السّائِحُونَ الرّاكِعُونَ السّاجِدُونَ الاْمِرُونَ بِالْمَعْرُوفِ، وَالنّاهُونَ عَنِ الْمُنْكَرِ، وَالْحافِظُونَ لِحُدُودِ اللهِ وَبَشِّرِ الْمُؤْمِنينَ)، أشهَدُ يا اَميرَ الْمُؤْمِنينَ اَنَّ الشّآكَّ فيكَ ما آمَنَ بِالرَّسُولِ الاَْمينِ، وَاَنَّ الْعادِلَ بِكَ غَيْرَكَ عانِدٌ عَنِ الدّينِ الْقَويمِ الَّذِي ارْتَضاهُ لَنا '
                      'رَبُّ الْعالَمينَ، وَاَكْمَلَهُ بِوِلايَتِكَ يَوْمَ الْغَديرِ، وَاَشْهَدُ اَنَّكَ الْمَعْني بِقَوْلِ الْعَزيزِ الرَّحيمِ: (وَاَنَّ هذا صِراطي مُسْتَقيماً فَاتَّبِعُوهُ وَلا تَتَّبِعُوا السُّبُلَ فَتَفَّرَقَ بِكُمْ عَنْ سَبيلِهِ)، ضَلَّ وَاللهِ وَاَضَلَّ مَنِ اتَّبَعَ سِواكَ، وَعَنَدَ عَنِ الْحَقِّ مَنْ عاداكَ، اَللّـهُمَّ سَمِعْنا لاَِمْرِكَ وَاَطَعْنا وَاتَّبَعْنا صِراطِكَ الْمُسْتَقيمَ فَاهْدِنا رَبَّنا وَلا تُزِغْ قُلُوبَنا بَعْدَ اِذْ هَدَيْتَنا اِلى طاعَتِكَ، وَاجْعَلْنا مِنَ الشّاكِرينَ لاَِنْعُمِكَ، وَاَشْهَدُ اَنَّكَ لَمْ تَزَلْ لِلْهَوى مُخالِفاً، وَللِتُّقى مُحالِفاً، وَعَلى كَظْمِ الْغَيْظِ قادِراً، وَعَنِ النّاسِ عافِياً غافِراً، وَاِذا عُصِيَ اللهُ ساخِطاً، وَاِذا اُطيعَ اللهُ راضياً، وَبِما عَهِدَ اِلَيْكَ عامِلاً، راعِياً لِمَا اسْتُحْفِظْتَ، حافِظاً لِمَا اسْتوُدِعْتَ، مُبَلِّغاً ما حُمِّلْتَ، مُنْتَظِراً ما وُعِدْتَ، وَاَشْهَدُ اَنَّكَ مَا اتَّقَيْتَ ضارِعاً، وَلا اَمْسَكْتَ عَنْ حَقِّكَ جازِعاً، وَلا أحْجَمتَ عَنْ مُجاهَدَةِ غاصِبيكَ ناكِلاً، وَلا اَظْهَرْتَ الرِّضا بِخِلافِ ما يُرْضِي اللهَ مُداهِناً، وَلا وَهَنْتَ لِما اَصابَكَ في سَبيلِ اللهِ، وَلا ضَعُفْتَ وَلاَ اسْتَكَنْتَ عَنْ طَلَبِ حَقِّكَ مُراقِباً، مَعاذَ اللهِ اَنْ تَكُونَ كَذلِكَ بَلْ اِذْ ظُلِمْتَ احْتَسَبْتَ رَبَّكَ، وَفَوَّضْتَ اِلَيْهِ اَمْرَكَ، وَذَكَّرْتَهُمْ فَمَا ادَّكَرُوا وَوَعَظْتَهُمْ فَمَا اتَّعَظُوا، وَخَوَّفْتَهُمُ اللهَ فَما تَخَوَّفُوا، وَاَشْهَدُ اَنَّكَ يا اَميرَ الْمُؤْمِنينَ جاهَدْتَ فِي اللهِ حَقَّ جِهادِهِ حَتّى دَعاكَ اللهُ اِلى جِوارِهِ، وَقَبَضَكَ اِلَيْهِ بِاخْتِيارِهِ، وَاَلْزَمَ اَعْداءَكَ الْحُجَّةَ بِقَتْلِهِمْ اِيّاكَ لِتَكُونَ الْحُجَّةُ لَكَ عَلَيْهِمْ مَعَ ما لَكَ مِنَ الْحُجَجِ الْبالِغَةِ، عَلى جَميعِ خَلْقِهِ، اَلسَّلامُ عَلَيْكَ يا اَميرَ الْمُؤْمِنينَ، عَبَدْتَ اللهَ مُخْلِصاً، وَجاهَدْتَ فِي اللهِ صابِراً، وَجُدْتَبِنَفْسِكَ مُحْتَسِباً، وَعَمِلْتَ بِكِتابِهِ، وَاتَّبَعْتَ سُنَّةَ نَبِيِّهِ، وَاَقَمْتَ الصَّلاةَ، وَآتَيْتَ الزَّكاةَ وَاَمَرْتَ بِالْمَعْرُوفِ، وَنَهَيْتَ عَنِ الْمُنْكَرِ مَا اسْتَطَعْتَ، مُبْتَغِياً ما عِنْدَ اللهِ، راغِباً فيـما وَعَدَ اللهُ، لا تَحْفِلُ بِالنَّوائِبِ، وَلا تَهِنُ عِنْدَ الشَّدائِدِ، وَلا تُحْجُمُ عَنْ مُحارِب اَفَكَ مَنْ نَسَبَ غَيْرَ ذلِكَ اِلَيْكَ، وَافْتَرى باطِلاً عَلَيْكَ، وَاَوْلي لِمَنْ عَنَدَ عَنْكَ، لَقَدْ جاهَدْتَ فِي اللهِ حَقَّ الْجِهادِ، وَصَبَرْتَ عَلَى الاَْذى صَبْرَ احْتِساب، وَاَنْتَ اَوَّلُ مَنْ آمَنَ بِاللهِ وَصَلّى لَهُ وَجاهَدَ وَاَبْدى صَفْحَتَهُ في دارِ الشِّرْكِ، وَالاَْرْضُ مَشْحوُنَةٌ ضَلالَةً، وَالشَّيْطانُ يُعْبَدُ جَهْرَةً، وَاَنْتَ الْقائِلُ : لا تَزيدُني كَثْرَةُ النّاسِ حَوْلي عِزَّةً، وَلا تَفَرُّقُهُمْ عَنّي وَحْشَةً، وَلَوْ اَسْلَمَنِي النّاسُ جَميعاً لَمْ اَكُنْ مُتَضَرِّعاً، اِعْتَصَمْتَ بِاللهِ فَعَزَزْتَ، وَآثَرْتَ الاْخِرَةَ عَلَى الاُْولى فَزَهِدْتَ وَاَيَّدَكَ اللهُ وَهَداكَ وَاَخْلَصَكَ وَاجْتَباكَ، فَما تَناقَضَتْ اَفْعالُكَ، وَلاَ اخْتَلَفَتْ اَقْوالُكَ، وَلا تَقَلَّبَتْ اَحْوالُكَ، وَلاَ ادَّعَيْتَ وَلاَ افْتَرَيْتَ عَلَى اللهِ كَذِباً، وَلا شِرَهْتَ اِلَى الْحُطامِ، وَلا دَنَّسَكَ الاْثامُ، وَلَمْ تَزَلْ عَلى بَيِّنة مِنْ رَبِّكَ وَيَقين مِنْ اَمْرِكَ تَهْدي اِلَى الْحَقِّ وَاِلى صِراط مُسْتَقيم، اَشْهَدُ شَهادَةَ حَقّ، وَاُقْسِمُ بِاللهِ قَسَمَ صِدْق اَنَّ مُحَمَّداً وَآلَهُ صَلَواتُ اللهِ عَلَيْهِمْ ساداتُ الْخَلْقِ، وَاَنَّكَ مَوْلايَ وَمَوْلَى الْمُؤْمِنينَ، وَاَنَّكَ عَبْدُ اللهِ وَوَلِيُّهُ وَاَخُو الرَّسُولِ وَوَصِيُّهُ وَوارِثُهُ، وَاَنَّهُ الْقائِلُ لَكَ : وَالذَّي بَعَثني بِالْحَقِّ ما آمَنَ بي مَنْ كَفَرَ بِكَ، وَلا اَقَرَّ بِاللهِ مَنْ جَحَدَكَ، وَقَدْ ضَلَّ مَنْ صَدَّ عَنْكَ وَلَمْ يَهْتَدِ اِلَى اللهِ، وَلا اِلَيَّ مَنْ لا يَهْتَدي بِكَ، وَهُوَ قَوْلُ رَبّي عَزَّوَجَلَّ : (وَاِنّي لَغَفّارٌ لِمَنْ تابَ وَآمَنَ وَعَمِلَ صالِحاً ثُمَّ اَهْتَدى) اِلى وِلايَتِكَ، مَوْلايَ فَضْلُكَ لا يَخْفى وَنُوُركَ لا يُطْفَأُ، وَاَنَّ مَنْ جَحَدَكَ الظَّلُومُ الاَْشْقى، مَوْلايَ اَنْتَ الْحُجَّةُ عَلَى الْعِبادِ، وَالْهادي اِلَى الرَّشادِ، وَالْعُدَّةُ لِلْمَعادِ، مَوْلايَ لَقَدْ رَفَعَ اللهُ فِي الاُْولى مَنْزِلَتَكَ، وَاَعْلى فِي الاْخِرَةِ دَرَجَتَكَ، وَبَصَّرَكَ ما عَمِيَ عَلى مَنْ خالَفَكَ، وَحالَ بَيْنَكَ وَبَيْنَ مَواهِبِ اللهِ لَكَ، فَلَعَنَ اللهُ مُسْتَحِلِّي الْحُرْمَةِ مِنْكَ وَذائِدِي الْحَقِّ عَنْكَ، وَاَشْهَدُ '
                      'اَنَّهُمُ الاَْخْسَرُونَ الذَّينَ تَلْفَحُ وُجُوهَهُمُ النّارُ وَهُمْ فيها كالِحُونَ، وَاَشْهَدُ اَنَّكَ ما اَقْدَمْتَ وَلا أحجَْمْتَ وَلا نَطَقْتَ وَلا اَمْسَكْتَ اِلاّ بِاَمْر مِنَ اللهِ وَرَسُولِهِ، قُلْتَ : وَالَّذي نَفْسي بِيَدِهِ لَقَدْ نَظَرَ اِلَيَّ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَآلِهِ اَضْرِبُ بِالسَّيْفِ قُدْماً، فَقالَ : يا عَلِيُّ اَنْتَ مِنّي بِمَنْزِلَةِ هارُونَ مِنْ مُوسى اِلاّ اَنَّهُ لا نَبِيَّ بَعدْي، وَاُعْلِمُكَ اَنَّ مَوْتَكَ وَحَياتَكَ مَعي وَعَلى سُنَّتي، فَوَاللهِ ما كَذِبْتُ وَلا كُذِبْتُ، وَلا ضَلَلْتُ وَلا ضُلَّ بي، وَلا نَسيتُ ما عَهِدَ اِلَيَّ رَبّي، وَاِنّي لَعَلى بَيِّنَة مِنْ رَبّي بَيَّنَها لِنَبِيِّهِ، وَبَيَّنَهَا النَّبِيُّ لي وَاِنّي لَعَلَى الطَّريقِ الْواضِحِ، اَلْفِظُهُ لَفْظاً، صَدَقْتَ وَاللهِ وَقُلْتَ الْحَقَّ، فَلَعَنَ اللهُ مَنْ ساواكَ بِمَنْ ناواكَ، وَاللهُ جَلَّ اسْمُهُ يَقُولُ : (هَلْ يَسْتَوِي الَّذينَ يَعْلَمُونَ وَالَّذينَ لا يَعْلَمُونَ)، فَلَعَنَ اللهُ مَنْ عَدَلَ بِكَ مَنْ فَرَضَ اللهُ عَلَيْهِ وِلايَتَكَ وَاَنْتَ وَلِيُّ اللهِ وَاَخُو رَسُولِهِ، وَالذّابُّ عَنْ دينِهِ، وَالَّذي نَطَقَ الْقُرْآنُ بِتَفْضيلِهِ، قالَ اللهُ تَعالى : (وَفَضَّلَ اللهُ الُْمجاهِدينَ عَلَى الْقاعِدينَ اَجْراً عَظيماً دَرَجات مِنْهُ وَمَغْفِرَةً وَرَحْمَةً وَكانَ اللهُ غَفوُراً رَحيماً)، وَقالَ اللهُ تَعالى: (اَجَعَلْتُمْ سِقايَةَ الْحاجِّ وَعِمارَةَ الْمَسْجِدِ الْحَرامِ كَمَنْ آمَنَ بِاللهِ وَالْيَوِم الاْخِرِ وَجاهَدَ في سَبيلِ اللهِ لا يَسْتَوونَ عِنْدَ اللهِ وَاللهُ لا يَهْدِي الْقَوْمَ الظّالِمينَ الَّذينَ آمَنُوا وَهاجَرُوا وَجاهَدُوا في سَبيلِ اللهِ بِاَمْوالِهِمْ وَاَنْفُسِهِمْ اَعْظَمُ دَرَجَةً عِنْدَ اللهِ وَاُولئِكَ هُمُ الْفآئِزُونَ يُبَشِّرُهُمْ رَبُّهُمْ بِرَحْمَة مِنْهُ وَرِضْوان وَجَنّات لَهُمْ فيها نَعيمٌ مُقيمٌ خالِدينَ فيها اَبَداً اِنَّ اللهَ عِنْدَهُ اَجْرٌ عَظيمٌ)، اَشْهَدُ اَنَّكَ الَْمخْصُوصُ بِمِدْحَةِ اللهِ، الُْمخْلِصُ لِطاعَةِ اللهِ، لَمْ تَبْغِ بِالْهُدى بَدَلاً، وَلَمْ تُشْرِكْ بِعِبادَةِ رَبِّكَ اَحَداً، وَاَنَّ اللهَ تَعالَى اسْتَجابَ لِنَبِيِّهِ صَلَّى اللهُ عَلَيْهِ وَآلِهِ فيكَ دَعْوَتَهُ ثُمَّ اَمَرَهُ بِاِظْهارِ ما اَوْلاكَ لاُِمَّتِهِ، اِعْلاءً لِشَأنِكَ، وَاِعْلاناً لِبُرْهانِكَ، وَدَحْضاً لِلاَْباطيلِ، وَقَطْعاً لِلْمَعاذيرِ، فَلَمّا اَشْفَقَ مِنْ فِتْنَةِ الْفاسِقينَ، وَاتَّقى فيكَ الْمُنافِقينَ، اَوْحى اِلَيْهِ رَبُّ الْعالَمينَ: (يا اَيُّهَا الرَّسُولُ بَلِّغْ ما اُنْزِلَ اِلَيْكَ مِنْ رَبِّكَ وَاِنْ لَمْ تَفْعَلْ فَما بَلَّغْتَ رِسالَتَهُ وَاللهُ يَعْصِمُكَ مِنَ النّاسِ)، فَوَضَعَ عَلى نَفْسِهِ اَوْ زارَ الْمَسيرِ، وَنَهَضَ في رَمْضاءِ الْهَجيرِ، فَخَطَبَ وَاسْمَعَ وَنادى فَاَبْلَغَ ثُمَّ سَأَلَهُمْ اَجْمَعَ، فَقالَ : هَلْ بَلَّغْتُ، فَقالوُا : اللّهُمَّ بَلى، فَقالَ : اللّهُمَّ اشْهَدْ، ثُمَّ قالَ : اَلَسْتُ اَوْلى بِالْمُؤْمِنينَ مِنْ اَنْفُسِهِمْ ؟، فَقالوُا : بَلى، فَاَخَذَ بِيَدِكَ وَقالَ : مَنْ كُنْتُ مَوْلاهُ فَهذا عَلِيٌّ مَوْلاهُ، اَللّـهُمَّ والِ مَنْ والاهُ وَعادِ مَنْ عاداهُ، وَانْصُرْ مَنْ نَصَرَهُ، وَاخْذُلْ مَنْ خَذَلَهُ، فَما آمَنَ بِما اَنْزَلَ اللهُ فيكَ عَلى نَبِيِّهِ اِلاّ قَليلٌ وَلا زادَ اَكْثَرَهُمْ غَيْرَ تَخْسير، وَلَقَدْ اَنْزَلَ اللهُ تَعالى فيكَ مِنْ قَبْلُ وَهُمْ كارِهوُنَ: (يا اَيُّهَا الَّذينَ آمَنوُا مَنْ يَرْتَدَّ مِنْكُمْ عَنْ دينِهِ فَسَوْفَ يَأتِي اللهُ بِقَوْم يُحِبُّهُمْ وَيُحِبُّونَهُ اَذِلَّة عَلَى الْمُؤْمِنينَ اَعِزَّة عَلَى الْكافِرينَ يُجاهِدُونَ في سَبيلِ اللهِ وَلا يَخافُونَ لَوْمَةَ لائِم ذلِكَ فَضْلُ اللهِيُؤْتيهِ مَنْ يَشاءُ وَاللهُ واسِعٌ عَليمٌ)، (اِنَّما وَلِيُّكُمُ اللهُ وَرَسُولَهُ وَالَّذينَ آمَنوُا الَّذينَ يُقيمُونَ الصَّلاةَ وَيُؤْتُونَ الزَّكاةَ وَهُمْ راكِعُونَ وَمَنْ يَتَوَلَّ اللهَ وَرَسُولَهُ وَالَّذينَ آمَنُوا فَاِنَّ حِزْبَ اللهِ هُمُ الْغالِبُونَ)، (رَبَّنا آمَنّا بِما اَنْزَلْتَ وَاتَّبَعْنَا الرَّسُولَ فَاكْتُبْنا مَعَ الشّاهِدينَ)، (رَبَّنا لا تُزِغْ قُلُوبَنا بَعْدَ اِذْ هَدَيْتَنا وَهَبْ لَنا مِنْ لَدُنْكَ رَحْمَةً اِنَّكَ اَنْتَ الوَهّابُ)، اَللّـهُمَّ اِنّا نَعْلَمُ اِنَّ هذا هُوَ الْحَقُّمِنْ عِنْدِكَ، فَالْعَنْ مَنْ عارَضَهُ وَاسْتَكْبَرَ وَكَذَّبَ بِهِ وَكَفَرَ، وَسَيَعْلَمُ الَّذينَ ظَلَمُوا اَيَّ مُنْقَلَب يَنْقَلِبُونَ، اَلسَّلامُ عَلَيْكَ يا اَميرَ الْمُؤْمِنينَ وَسَيِّدِ الْوَصِيّينَ، وَاَوَّلَ العابِدينَ، وَاَزْهَدَ الزّاهِدينَ وَرَحْمَةُ اللهِ وَبَرَكاتُهُ '
                      'وَصلَواتُهُ وَتَحِيّاتُهُ، اَنْتَ مُطْعِمُ الطَّعامِ عَلى حُبِّهِ مِسْكيناً وَيَتيماً وَاَسيراً لِوَجْهِ اللهِ، لا تُريدُ مِنْهُمْ جَزاءً وَلا شُكُوراً، وَفيكَ اَنْزَلَ اللهُ تَعالى وَيُؤْثِرُونَ عَلى اَنْفُسِهِمْ وَلَوْ كانَ بِهِمْ خَصاصَةٌ وَمَنْ يُوقَ شُحَّ نَفْسِهِ فَاوُلئِكَ هُمُ الْمُفْلِحُونَ، وَاَنْتَ الْكاظِمُ لِلْغَيْظِ، وَالْعافي عَنِ النّاسِ، وَاللهُ يُحِبُّ الُْمحْسِنينَ، وَاَنْتَ الصّابِرُ فِي الْبَأساءِ وَالضَّرّاءِ وَحينَ الْبَأسِ، وَاَنْتَ الْقاسِمُ بِالسَّوِيَّةِ، وَالْعادِلُ فِي الرَّعِيَّةِ، وَالْعالِمُ بِحُدُودِ اللهِ مِنْ جَميعِ الْبَرِيَّةِ، وَاللهُ تَعالى اَخْبَرَ عَمّا اَوْلاكَ مِنْ فَضْلِهِ بِقَوْلِه: (أفَمَنْ كانَ مُؤْمِناً كَمَنْ كانَ فاسِقاً لا يَسْتَُوونَ اَمَّا الَّذينَ آمَنوُا وَعَمِلُوا الصّالِحاتِ فَلَهُمْ جَنّاتُ الْمَأوى نُزُلاً بِما كانُوا يَعْمَلُونَ)، وَاَنْتَ الَْمخْصُوصُ بِعِلْمِ التَّنْزيلِ، وَحُكْمِ التَّأويلِ، وَنَصِّ الرَّسُولِ، وَلَكَ الْمَواقِفُ الْمَشْهُودَةُ، وَالْمَقاماتُ الْمَشْهُورَةُ، وَالاَْيّامُ الْمَذْكُورَةُ يَوْمَ بَدْر وَيَوْمَ الاَْحْزابِ ( إذ زاغَتِ الاَْبْصارُ، وَبَلَغَتِ الْقُلُوبُ الْحَناجِرَ وَتَظُنُّونَ بِاللهِ الْظُّنُونا هُنالِكَ ابْتُلِيَ الْمُؤْمِنُونَ وَزُلْزِلُوا زِلْزالاً شَديداً وَاِذْ يَقُولُ الْمُنافِقُونَ وَالَّذينَ في قُلُوبِهِمْ مَرَضٌ ما وَعَدَنَا اللهُ وَرَسُولُهُ اِلاّ غُرُوراً وَاِذْ قالَتْ طائِفَةٌ مِنْهُمْ يا اَهْلَ يَثْرِبَ لا مُقامَ لَكُمْ فَارْجِعُوا وَيَسْتَأْذِنُ فَريقٌ مِنْهُمُ النَّبِيَّ يَقُولُونَ اِنَّ بُيُوتَنا عَوْرَةٌ وَما هِيَ بِعَوْرَة اِنْ يُريدُونَ اِلاّ فِراراً)، وَقالَ اللهُ تَعالى: (وَلَمّا رَاَى الْمُؤْمِنُونَ الاَْحْزابَ قالُوا هذا ما وَعَدَنَا اللهُ وَرَسُولُهُ وَصَدَقَ اللهُ وَرَسُولُهُ وَما زادَهُمْ اِلاّ ايماناً وَتَسْليماً)، فَقَتَلْتَ عَمْرَهُمْ وَهَزَمْتَ جَمْعَهُمْ (وَرَدَّ اللهُ الَّذينَ كَفَرُوا بِغَيْظِهِمْ لَمْ يَنالوُا خَيْرا وَكَفَى اللهُ الْمُؤْمِنينَ الْقِتالَ وَكانَ اللهُ قَوِيَّاً عَزيزاً)، وَيَوْمَ اُحُد (اِذْ يُصْعِدُونَ وَلا يَلْوُونَ عَلى اَحَد وَالرَّسُولُ يَدْعُوهُمْ في اُخْراهُمْ) وَاَنْتَ تَذُودُ بُهَمَ الْمُشْرِكينَ عَنِ النَّبِيِّ ذاتَ الَْيمينِ وَذاتَ الشِّمالِ حَتّى رَدَّهُمُ اللهُ تَعالى عَنْكما خائِفينَ، وَنَصَرَ بِكَ الْخاذِلينَ، وَيَوْمَ حُنَيْن عَلى ما نَطَقَ بِهِ التَّنْزيلُ (إذْ اَعْجَبَتْكُمْ كَثْرَتُكُمْ فَلَمْ تُغْنِ عَنْكُمْ شَيْئاً وَضاقَتْ عَلَيْكُمُ الاَْرْضُ بِما رَحُبَتْ ثُمَّ وَلَّيْتُمْ مُدْبِرينَ ثُمَّ اَنْزَلَ اللهُ سَكينَتَهُ عَلى رَسُولِهِ وَعَلَى الْمُؤْمِنينَ)، وَالْمُؤْمِنوُنَ اَنْتَ وَمَنْ يَليكَ، وَعَمُّكَ الْعَبّاسُ يُنادِي الْمُنْهَزِمينَ يا اَصْحابَ سورَةِالْبَُقَرَةِ، يا اَهْلَ بَيْعَةِ الشَّجَرَةِ، حَتَّى اسْتَجابَ لَهُ قَوْمٌ قَدْ كَفَيْتَهُمُ الْمَؤُنَةَ، وَتَكَفَّلْتَ دُونَهُمُ الْمَعُونَةَ، فَعادُوا آيِسينَ مِنَ المَثُوبَةِ، راجينَ وَعْدَ اللهِ تَعالى بِالتَّوْبَةِ، وَذلِكَ قَوْلُ اللهِ جَلَّ ذِكْرُهُ ثُمَّ يَتُوبُ اللهُ مِنْ بَعْدِ ذلِكَ عَلى مَنْ يَشاءُ، وَاَنْتَ حائِزٌ دَرَجَةَ الصَّبْرِ، فائِزٌ بِعَظيمِ الاَْجْرِ، وَيَوْمَ خَيْبَرَ اِذْ اَظْهَرَ اللهُ خَوَرَ الْمُنافِقينَ، وَقَطَعَ دابِرَ الْكافِرينَ، وَالْحَمْدُ للهِ رَبِّ الْعالَمينَ، وَلَقَدْ كانُوا عاهَدُوا اللهَ مِنْ قَبْلُ لا يُوَلُّونَ الاَْدْبارَ، وَكانَ عَهْدُ اللهِ مَسْئُوولاً، مَوْلايَ اَنْتَ الْحُجَّةُ الْبالِغَةُ، وَالُْمحَجَّةُ الْواضِحَةُ، وَالنِّعْمَةُ السّابِغَةُ، وَالْبُرْهانُ الْمُنيرُ، فَهَنيئاً لَكَ بِما آتاكَ اللهُ مِنْ فَضْل، وَتَبّاً لِشانِئِكَ ذِي الْجَهْلِ، شَهِدْتَ مَعَ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَآلِهِ جَميعَ حُرُوبِهِ وَمَغازيهِ، تَحْمِلُ الرّايَةَ اَمامَهُ، وَتَضْرِبُ بِالسَّيْفِ قُدّامَهُ، ثُمَّ لِحَزْمِكَ الْمَشْهُورِ، وَبَصيرَتِكَ فِي الاُْمُورِ، اَمَّرَكَ فِي الْمَواطِنِ وَلَمْ يَكُنْ عَلَيْكَ اَميرٌ، وَكَمْ مِنْ اَمْر صَدَّكَ عَنْ اِمْضاءِ عَزْمِكَ فيهِ التُّقى، وَاتَّبَعَ غَيْرُكَ في مِثْلِهِ الْهَوى، فَظَنَّ الْجاهِلُونَ اَنَّكَ عَجَزْتَ عَمّا اِلَيْهِ انْتَهى، ضَلَّ وَاللهِ الظّانُّلِذلِكَ وَمَا اهْتَدى، وَلَقَدْ اَوْضَحْتَ ما اَشْكَلَ مِنْ ذلِكَ لِمَنْ تَوَهَّمَ وَامْتَرى بِقَوْلِكَ صَلَّى اللهُ عَلَيْكَ : قَدْ يَرَى الْحُوَّلُ الْقُلَّبُ وَجْهَ الْحيلَةِ وَدُونَها حاجِزٌ مِنْ تَقْوَى اللهِ فَيَدَعُها رَأيَ الْعَيْنِ، وَيَنْتَهِزُ فُرْصَتَها مَنْ لا حَريجَةَ لَهُ فِي الدّينِ، صَدَقْتَ وَخَسِرَ الْمُبْطِلُونَ، وَاِذْ ما كَرَكَ النّاكِثانِ فَقالا : نُريدُ '
                      'الْعُمْرَةَ فَقُلْتُ لَهُما : لَعَمْرُ كُما ما تُريدانِ الْعُمْرَةَ لكِنْ تُريدانِ الْغَدْرَةَ، فَاَخَذْتَ الْبَيْعَةَ عَلَيْهِما، وَجَدَّدْتَ الْميثاقَ، فَجَدّا فِي النِّفاقِ، فَلَمّا نَبَّهْتَهُما عَلى فِعْلِهِما اَغْفَلا وَعادا وَمَا انْتَفَعا وَكانَ عاقِبَةُ اَمْرِهِما خُسْراً، ثُمَّ تَلاهُما اَهْلُ الشّامِ فَسِرْتَ اِلَيْهِمْ بَعْدَ الاِْعْذارِ ،وَهُمْ لا يَدينُونَ دينَ الْحَقِّ، وَلا يَتَدَبَّرُونَ الْقُرْآنَ، هَمَجٌ رَعاعٌ ضالّوُنَ، وَبِالَّذي اُنْزِلَ عَلى مُحَمَّد فيكَ كافرُِونَ، وَلاَِهْلِ الْخِلافِ عَلَيْكَ ناصِرُونَ، وَقَدْ اَمَرَ اللهُ تَعالى بِاتِّباعِكَ، وَنَدَبَ الْمُؤْمِنينَ اِلى نَصْرِكَ، وَقالَ عَزَّوَجَلَّ: (يا اَيُّهَا الَّذينَ آمَنُوا اتَّقواُ اللهَ وَكُونُوا مَعَ الصّادِقينَ)، مَوْلايَ بِكَ ظَهَرَ الْحَقُّ وَقَدْ نَبَذَهُ الْخَلْقُ، وَاَوْضَحْتَ السُّنَنَ بَعْدَ الدُّرُوسِ وَالطَّمْسِ، فَلَكَ سابِقَةُ الْجِهادِ عَلى تَصْديقِ التَّنْزيلِ، وَلَكَ فَضيلَةُ الْجِهادِ عَلى تَحْقيقِ التَّأْويلِ، وَعَدُوُّكَ عَدُوُّ اللهِ جاحِدٌ لِرَسُولِ اللهِ يَدْعُو باطِلاً، وَيَحْكُمُ جائِراً، وَيَتَاَمَّرُ غاصِباً، وَيَدْعُو حِزْبَهُ اِلَى النّارِ، وَعَمّارٌ يُجاهِدُ وَيُنادي بَيْنَ الصَّفَّيْنِ : الرَّواحَ الرَّواحَ اِلَى الْجَنَّةِ، وَلَمَّا اسْتَسْقى فَسُقِيَ اللَّبَنَ كَبَّرَ وَقالَ : قالَ لي رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَآلِهِ : آخِرُ شَرابِكَ مِنَ الدُّنْيا ضَياحٌ مِنْ لَبَن، وَتَقْتُلُكَ الْفِئَةُ الْباغِيَةُ، فَاعْتَرَضَهُ اَبُو، الْعادِيَةِ الْفَزارِيُّ فَقَتَلَهُ، فَعَلى اَبِى الْعادِيَةِ لَعْنَةُ اللهِ وَلَعْنَةُ مَلائِكَتِهِ وَرُسُلِهِ اَجْمَعينَ، وَعَلى مَنْ سَلَّ سَيْفَهُ عَلَيْكَ وَسَلَلْتَ سَيْفَكَ عَلَيْهِ يا اَميرَ الْمُؤْمِنينَ مِنَ الْمُشْرِكينَوَالْمُنافِقينَ اِلى يَوْمِ الدّينَ، وَعَلى مَنْ رَضِيَ بِما ساءَكَ وَلَمْ يَكْرَهْهُ وَأغْمَضَ عَيْنَهُ وَلَمْ يُنْكِرْ، اَوْ اَعانَ عَلَيْكَ بِيَد اَوْ لِسان، اَوْ قَعَدَ عَنْ نَصْرِكَ، اَوْ خَذَلَ عَنِ الْجِهادِ مَعَكَ، اَوْ غَمَطَ  فَضْلَكَ وَجَحَدَ حَقَّكَ، اَوْ عَدَلَ بِكَ مَنْ جَعَلَكَ اللهُ اَوْلى بِهِ مِنْ نَفْسِهِ، وَصَلَواتُ اللهِ عَلَيْكَ وَرَحْمَةُ اللهِ وَبَرَكاتُهُ وَتَحِيّاتُهُ، وَعَلَى الاَْئِمَّةِ مِنْ آلِكَ الطّاهِرينَ، اِنَّهُ حَميدٌ مَجيدٌ، وَالاَْمْرُ الاَْعْجَبُ وَالْخَطْبُ الاَْفْظَعُ بَعْدَ جَحْدِكَ حَقَّكَ، غَصْبُ الصِّديقَةِ الطّاهِرَةِ الزَّهْراءِ سَيِّدَةِ النِّساءِ فَدَكاً، وَرَدُّ شَهادَتِكَ وَشَهادَةِ السَّيِّدَيْنِ سُلالَتِكَ وَعِتْرَةِ الْمُصْطَفى صَلَّى اللهُ عَلَيْكُمْ، وَقَدْ اَعْلَى اللهُ تَعالى عَلَى الاُْمَّةِ دَرَجَتَكُمْ، وَرَفَعَ مَنْزِلَتَكُم وَاَبانَ فَضْلَكُم وَشَرَّفَكُمْ عَلَى الْعالَمينَ، فَاَذْهَبَ عَنْكُمُ الرِّجْسَ وَطَهَّرَكُمْ تَطْهيراً، قالَ اللهُ عَزَّوَجَل: (اِنَّ الاِْنْسانَ خُلِقَ هَلوُعاً اِذا مَسَّهُ الشَّرُّ جَزوُعاً وَاِذا مَسَّهُ الْخَيْرُ مَنوُعاً اِلاَّ الْمُصَلّينَ)، فَاسْتَثْنَى اللهُ تَعالى نَبِيَّهُ الْمُصْطَفى وَاَنْتَ يا سَيِّدَ الاَْوْصِياءِ مِنْ جَميعِ الْخَلْقِ، فَما اَعْمَهَ مَنْ ظَلَمَكَ عَنِ الْحَقِّ، ثُمَّ اَفْرَضُوكَ سَهْمَ ذَوِيالْقُرْبى مَكْراً، وَاَحادُو عَنْ اَهْلِهِ جَوْراً، فَلَمّا آلَ الاَْمْرُ اِلَيْكَ اَجْرَيْتَهُمْ عَلى ما اَجْرَيا رَغْبَةً عَنْهُما بِما عِنْدَ اللهِ لَكَ، فَاَشْبَهَتْ مِحْنَتُكَ بِهِما مِحَنَ الاَْنْبِياءِ عَلَيْهِمُ السَّلامُ عِنْدَ الْوَحْدَةِ وَعَدَمِ الاَْنْصارِ، وَاَشْبَهْتَ فِي الْبَياتِ عَلَى الْفِراشِ الذَّبيحَ عَلَيْهِ السَّلامُ، اِذْ اَجَبْتَ كَما اَجابَ، وَاَطَعْتَ كَما اَطاعَ اِسْماعيلُ صابِراً مُحْتَسِباً اِذْ قالَ لَهُ: (يا بُنَيَّ اِنّي اَرى فِي الْمَنامِ اَنّي اَذْبَحُكَ فَانْظُرْ ماذا تَرى قالَ يا اَبَتِ افْعَلْ ما تُؤْمَرُ سَتَجِدُني اِنْ شاءَ اللهُ مِنَ الصّابِرينَ)، وَكَذلِكَ اَنْتَ لَمّا اَباتَكَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَآلِهِ، وَاَمَرَكَ اَنْ تَضْجَعَ في مَرْقَدِهِ واقياً لَهُ بِنَفْسِكَ اَسْرَعْتَ اِلى اِجابَتِهِ مُطيعاً، وَلِنَفْسِكَ عَلَى الْقَتْلِ مُوَطِّناً، فَشَكَرَ اللهُ تَعالى طاعَتَكَ وَاَبانَ عَنْ جَميلِ فِعْلِكَ بِقَوْلِهِ جَلَّ ذِكْرُهُ: (وَمِنَ النّاسِ مَنْ يَشْرى نَفْسَهُ ابْتِغاءَ مَرْضاةِ اللهِ)، ثُمَّ مِحْنَتُكَ يَوْمَ صِفّينَ وَقَدْ رُفِعَتِ الْمَصاحِفُ حيلَةً وَمَكْراً، فَاَعْرَضَ الشَّكُّ، وَعُزِفَ الْحَقُّ وَاتُّبِعَ الظَّنُّ، اَشْبَهَتْ مِحْنَةَ هارُونَ اِذْ اَمَّرَهُ موُسى عَلى قَوْمِهِ فَتَفَرَّقُوا عَنْهُ وَهارُونُ يُنادى بِهِمْ وَيَقوُلُ: (يا قَوْمِ اِنَّما فُتِنْتُمْ بِهِ وَاِنَّ رَبَّ '
                      'كُمُ الرَّحْمنُ فَاتَّبِعوُني وَاَطيعُوا اَمْري قالوُا لَنْ نَبْرَحَ عَلَيْهِ عاكِفينَ حَتّى يَرْجِعَ اِلَيْنا موُسى)، وَكَذلِكَ اَنْتَ لَمّا رُفِعَتِ الْمَصاحِفُ قُلْتَ يا قَوْمِ اِنَّما فُتِنْتُمْ بِها وَخُدِعْتُمْ، فَعَصَوْكَ وَخالَفُوا عَلَيْكَ، وَاسْتَدْعَوْا نَصْبَ الْحَكَمَيْنِ، فَاَبَيْتَ عَلَيْهِمْ، وَتَبَرَّأْتَ اِلَى اللهِ مِنْ فِعْلِهِمْ، وَفَوَّضْتَهُ اِلَيْهِم فَلَمّا اَسْفَرَ الْحَقُّ وَسَفِهَ الْمُنْكَرُ، وَاعْتَرَفُوا بِالزَّلَلِ وَالْجَوْرِ عَنِ الْقَصْدِاخْتَلَفُوا مِنْ بَعْدِهِ، وَاَلْزَمُوكَ عَلى سَفَه التَّحْكيمَ الَّذي اَبَيْتَهُ وَاَحَبُّوهُ وَحَظَرْتَهُ، وَاَباُحُوا ذَنْبَهُمُ الَّذي اقْتَرَفُوهُ وَاَنْتَ عَلى نَهْجِ بَصيرَة وَهُدى، وَهُمْ عَلى سُنَنِ ضَلالَة وَعَمىً، فَما زالُوا عَلَى الِّنْفاقِ مُصِرّينَ، وَفِي الْغَيِّ مُتَرَدِّدينَ حَتىّ اَذاقَهُمُ اللهُ وَبالَ اَمْرِهِمْ، فَاَماتَ بِسَيْفِكَ مَنْ عانَدَكَ، فَشَقِيَ وَهَوى وَاَحْيا بِحُجَّتِكَ مَنْ سَعَدَ فَهُدِيَ صَلَواتُ اللهِ عَلَيْكَ غادِيَةً وَرائِحَةً وَعاكِفَةً وَذاهِبَةً، فَما يُحيطُ الْمادِحُ وَصْفَكَ، وَلا يُحْبِطُ الطّاعِنُ فَضْلَكَ، اَنْتَ اَحْسَنُ الْخَلْقِ عِبادَةً، وَاَخْلَصُهُمْ زَهادَةً، وَاَذَّبُهُمْ عَنِ الدّينِ، اَقَمْتَ حُدُودَ اللهِ بِجُهْدِكَ، وَفَلَلْتَ عَساكِرَ الْمارِقينَ بِسَيْفِكَ، تُخْمِدُ لَهَبَ الْحُرُوبِ بِبَنانِكَ، وَتَهْتِكُ سُتُورَ الشُّبَهِ بِبَيانِكَ، وَتَكْشِفُ لَبْسَ الْباطِلِ عَنْ صَريحِ الْحَقِّ، لا تَأخُذُكَ فِي اللهِ لَوْمَةُ لائِم، وَفي مَدْحِ اللهِ تَعالى لَكَ غِنىً عَنْ مَدْحِ الْمادِحينَ وَتَقْريظِ  الْواصِفينَ، قالَ اللهُ تَعالى: (مِنَ الْمُؤْمِنينَ رِجالٌ صَدَقُوا ما عاهَدُوا اللهَ عَلَيْهِ فَمِنْهُمْ مَنْ قَضى نَحْبَهُ وَمِنْهُمْ مَنْ يَنْتَظِرُ وَما بَدَّلوُا تَبْديلاً)، وَلَمّا رَأَيْتَ اَنْ قَتَلْتَ النّاكِثينَ وَالْقاسِطينَ وَالْمارِقينَ وَصَدَقَكَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَآلِهِ وَعْدَهُ فَاَوْفَيْتَ بِعَهْدِهِ قُلْتَ : اَما آنَ اَنْ تُخْضَبَ هذِهِ مِنْ هذِهِ ؟ اَمْ مَتى يُبْعَثُ اَشْقاها ؟ واثِقاً بِاَنَّكَ عَلى بَيِّنَة مِنْ رَبِّكَ وَبَصيرَة مِنْ اَمْرِكَ، قادِمٌ عَلَى اللهِ، مُسْتَبْشِرٌ بِبَيْعِكَ الَّذي بايَعْتَهُ بِهِ، وَذلِكَ هُوَ الْفَوْزُ الْعَظيمُ ،اَللّـهُمَّ الْعَنْ قَتَلَةَ اَنْبِيائِكَ وَاَوْصِياءِ اَنْبِيائِكَ بِجَميعِ لَعَناتِكَ، وَاَصْلِهِمْ حَرَّ نارِكَ، وَالْعَنْ مَنْ غَصَبَ وَلِيَّكَ حَقَّهُ، وَاَنَكَرَ عَهْدَهُ، وَجَحَدَهُ بَعْدَ الْيَقينِ وَالاِْقْرارِ بِالْوِلايَةِ لَهُ يَوْمَ اَكْمَلْتَ لَهُ الدّينَ، اَللّـهُمَّ الْعَنْ قَتَلَةَ اَميرِ الْمُؤْمِنينَ وَمَنْ ظَلَمَهُ وَاَشْياعَهُمْ وَاَنْصارَهُم، اَللّـهُمَّ الْعَنْ ظالِمي الْحُسَيْنِ وَقاتِليهِ، وَالْمُتابِعينَ عَدُوَّهُ، وَناصِريهِ، وَالرّاضينَ بِقَتْلِهِ وَخاذِليهِ لَعْناً وَبيلاً، اَللّـهُمَّ الْعَنْ اَوَّلَ ظالِم ظَلَمَ آلَ مُحَمَّد وَمانِعيهِمْ حُقُوقَهُمْ، اَللّـهُمَّ خُصَّ اَوَّلَ ظالِم وَغاصِب لاِلِ مُحَمَّد بِاللَّعْنِ، وَكُلَّ مُسْتَن بِما سَنَّ اِلى يَوْمِ الْقِيامَةِ اَللّـهُمَّ صَلِّ عَلى مُحَمَّد خاتَمِ النَّبِيّينَ وَعَلى عَلِيٍّ سَيِّدِ الْوَصِيّينَ وَآلِهِ الطّاهِرينَ، وَاجْعَلْنا بِهِمْ مُتَمَسِّكينَ وَبِوِلايَتِهِمْ مِنَ الْفائِزينَ الاْمِنينَ الَّذينَ لا خَوْفٌ عَلَيْهِمْ وَلا هُمْ يَحْزَنُونَ.',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
            ],
          ),
        ),
        bottomNavigationBar: AddCustomBottomNavigationBar(
        pushNext: FiA3malShaherZilhoja.screenRoute,
        pushBack: AlyawmAl2a5irMenZilhoja.screenRoute,
        soud: '',
        onTap: (double fontSize) {
          // تحديث حجم الخط
          setState(() {
            isTablet ? _fontSizeTablet = fontSize : _fontSize = fontSize;
          });
          print('fontSize: $fontSize');
          // إغلاق Dialog
          Navigator.of(context).pop();
        },
        onLongPress: () {
          final snackBar = SnackBar(
            content: Center(
              child: Text(
                '${isTablet ? _fontSizeTablet.toInt() : _fontSize.toInt()}',
                style: TextStyle(
                  color: Colors.white,
                  fontSize: 16,
                ),
              ),
            ),
            width: 60,
            behavior: SnackBarBehavior.floating,
            backgroundColor: Colors.blue,
            duration: Duration(seconds: 2),
            shape: ShapeBorder.lerp(
              RoundedRectangleBorder(
                borderRadius: BorderRadius.circular(50),
              ),
              RoundedRectangleBorder(
                borderRadius: BorderRadius.circular(50),
              ),
              1,
            ),
          );
          ScaffoldMessenger.of(context).showSnackBar(snackBar);
        },
      ),
      ),
    );
  }
}
