import 'package:flutter/material.dart';
import 'package:maktabat_almoslim/widgets/container_scrollview.dart';
import 'package:provider/provider.dart';
import 'package:shared_preferences/shared_preferences.dart';

import '../../../../widgets/add_custom_bottom_navigation_bar.dart';
import '../../../../widgets/list_of_nine_verses.dart';
import '../../../favorites_provider.dart';
import '../../../favorites_screen.dart';
import '../ziyarat_2a2imat_sir.dart';
import 'ziyarat_al2imam_almahdi_almankoula.dart';
import 'ziyarat_alimam_al3askari.dart';

class AlmakamAlsani extends StatefulWidget {
  static String screenRoute = 'almakam_alsani_screen';
  const AlmakamAlsani({super.key});

  @override
  State<AlmakamAlsani> createState() => _AlmakamAlsaniState();
}

double _fontSize = 18;
double _fontSizeTablet = 30;

class _AlmakamAlsaniState extends State<AlmakamAlsani> {
  bool isIcon = true;
  @override
  void initState() {
    super.initState();
    _loadFavoriteState();
  }

  Future<void> _loadFavoriteState() async {
    final prefs = await SharedPreferences.getInstance();
    bool? savedState = prefs.getBool('isFavorite_almakam_alsani_screen');
    setState(() {
      isIcon = savedState ?? true;
    });
  }

  Future<void> _saveFavoriteState(bool value) async {
    final prefs = await SharedPreferences.getInstance();
    await prefs.setBool('isFavorite_almakam_alsani_screen', value);
  }

    Future<bool> _onWillPop() async {
    final args =
        ModalRoute.of(context)!.settings.arguments as Map<String, dynamic>?;
    final previousPage = args?['previousPage'];
    if (previousPage == 'favorite_screen') {
      Navigator.of(context).pushReplacementNamed(FavoritesScreen.screenRoute);
      return false;
    } else {
      Navigator.of(context).pushReplacementNamed(Ziyarat2a2imatSir.screenRoute);
      return false;
    }
  }

  @override
  Widget build(BuildContext context) {
    double size = MediaQuery.of(context).textScaleFactor;
    final screenWidth = MediaQuery.of(context).size.width;
    final isTablet = screenWidth >= 600;
    return WillPopScope(
      onWillPop: _onWillPop,
      child: Scaffold(
        appBar: AppBar(
          toolbarHeight: isTablet ? 100 : 50,
          centerTitle: true,
          leading: IconButton(
            onPressed: _onWillPop,
            icon: Icon(
              Icons.arrow_back,
              size: isTablet ? 50 : 25,
            ),
          ),
          actions: [
            IconButton(
              padding: EdgeInsets.only(left: isTablet ? 50 : 30),
              icon: Icon(
                isIcon ? Icons.favorite_border : Icons.favorite_rounded,
                size: isTablet ? 40 : 25,
                color: isIcon ? Colors.black : Colors.red,
              ),
              onPressed: () async {
                setState(() {
                  isIcon = !isIcon;
                });
                await _saveFavoriteState(isIcon);
      
                if (!isIcon) {
                  Provider.of<FavoritesProvider>(context, listen: false).addFavorite(
                      'المقام الثاني: في آداب السرداب الطاهر وصفة زيارة حجة الله على العباد وبقية الله في البلاد الإمام المهدي الحجة بن الحسن صاحب الزمان',
                      AlmakamAlsani.screenRoute);
                } else {
                  Provider.of<FavoritesProvider>(context, listen: false)
                      .removeFavorite(
                          'المقام الثاني: في آداب السرداب الطاهر وصفة زيارة حجة الله على العباد وبقية الله في البلاد الإمام المهدي الحجة بن الحسن صاحب الزمان',
                          AlmakamAlsani.screenRoute,
                          AlmakamAlsani.screenRoute);
                }
              },
            ),
          ],
          title: Text(
            'المقام الثاني: في آداب السرداب الطاهر وصفة زيارة حجة الله على العباد وبقية الله في البلاد الإمام المهدي الحجة بن الحسن صاحب الزمان',
            style: TextStyle(
              fontSize: isTablet
                  ? 40
                  : size > 1.0
                      ? 20
                      : 23,
              fontWeight: FontWeight.bold,
            ),
          ),
        ),
        body: ContainerScrollview(
          widget: Column(
            crossAxisAlignment: CrossAxisAlignment.start,
            children: [
              Container(
                child: Column(
                  children: [
                    Center(
                      child: Text(
                        'بسم الله الرحمن الرحيم',
                        style: TextStyle(
                          fontSize: isTablet ? _fontSizeTablet : _fontSize,
                          fontWeight: FontWeight.w900,
                        ),
                      ),
                    ),
                    Center(
                      child: Text(
                        'اللهم صلِّ على محمد وآل محمد',
                        style: TextStyle(
                          fontSize: isTablet ? _fontSizeTablet : _fontSize,
                          fontWeight: FontWeight.w900,
                        ),
                      ),
                    ),
                  ],
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: '',
                  subtitle:
                      'في آداب السرداب الطاهر وصفة زيارة حجة الله على العباد وبقية الله في البلاد الإمام المهدي الحجة بن الحسن صاحب الزمان (صلوات الله عليه وعلى آبائه) وعلينا أن نصدِّر المقصد بالتنبيه على أمر تحدّثنا عنه في كتاب (الهداية) نقلاً عن كتاب (التحيّة) وهو أن هذا السرداب الطاهر هو قسم من دارهما (عليهما السلام) وقبلما يشيد هذا البناء الحديث (الصحن والحرم والقبّة) كان المدخل إلى السرداب خلف القبر عند مرقد السيدة نرجس (نرجس خاتون) ولعله الان واقع في الرواق فكان ينحدر إلى مسلك مظلم طويل ينتهي بباب يفتح وسط سرداب الغيبة.\n\n'
                      'والسرداب في عصرنا الحاضر مزخرف بالمرايا وله في جانب القبلة نافذة إلى صحن العسكريين (عليهما السلام)، وموضع الباب السابق معلَّم بصورة المحراب منقوشة بالقاشاني فكانت الزيارات وغيرها لهؤُلاءِ الأئمة الثلاث تؤدى كلها من حرم واحد ولذلك نجد الشهيد الأول في (المزار) يعقب زيارة العسكريين (عليهما السلام) بزيارة السرداب ثم يذكر زيارة السيدة نرجس ومنذ مائة وبضعة سنين تأهب للبناء المؤيد المسدد أحمد خان الدّنبلي وأفرز بما أنفقه من المبلغ الخطير صحن الإمامين (عليهما السلام) كما هو الان وشيد الروضة والرواق والقبّة الشامخة وأسّس للسرداب الطاهر الصحن الخاص والايوان والمدخل والدِّهليز كما شيد للنساء سرداباً خاصاً كما هو قائم الان فطمست معالم ماكان من قبل المدخل والدّرج والباب وانمحى جميع آثاره فزال بذلك بعض الاداب المأثورة ولكن أصل السرداب الشريف وهو موضع جملة من الزيارات باقٍ لم يتغير.\n\n'
                      'وأما الاستئذان لدخول السرداب فلم يسقط‍ بانسداد المدخل السابق، فلكل زيارة استئذان كما دلّ عليه الاستقراء ونجد العلماء كذلك يصرّحون بلزوم الاستئذان تأدباً للدخول من أي باب اعتيد الدخول منه إلى حرم إمام من الأئمة (عليهم السلام) والان نبدأ في صفة الزيارة.\n\n'
                      'إعلم أنّ الاستئذان الخاص المأثور لدخول السرداب هو الزيارة الاتية التي مفتتحها: السَّلامُ عَلَيْكَ ياخَلِيفَةَ اللهِ، وتنتهي بالاستئذان ويزار بها على باب السرداب قبل النزول إليه وقد أورد السيد ابن طاووس (رض) استئذانا آخر يقرب من الاستئذان العام الأول الذي أوردناه في الفصل الثاني من باب الزيارات.\n\n'
                      'وأورد العلامة المجلسي (رض) استئذانا آخر حكاه عن نسخة قديمة وأوّلها: [ اللّهُمَّ إِنَّ هذِهِ بُقْعَةٌ طَهَّرْتَها وَعَقْوَةٌ شَرَّفْتَها… ]، وهو ماعقبنا به الاستئذان العام المذكور فارجع إليه واستأذن به ثم انزل إلى السرداب وزره (عليه السلام) بما روي عنه نفسه الشريفة كما عن الشيخ الجليل أحمد بن أبي طالب الطبرسي في كتاب الاحتجاج أنّه خرج من الناحية المقدسة إلى محمد الحميري بعد الجواب عن المسائل التي سألها:\n\n'
                      '[ بِسْمِ الله الرَّحْمنِ الرَّحِيمِ لا لاِ مْرِهِ تعْقِلوُنَ وَلا مِنْ أَوْلِيائِهِ تَقْبَلُونَ حِكْمَةٌ بالِغَةٌ فَما تُغْنِي النُّذُرُ السَّلامُ عَلَيْنا وَعَلى عِبادِ الله الصَّالِحِينَ ].\n\n'
                      'إذا أردتم التوجه بنا إلى الله تعالى وإلينا فقولوا كما قال الله تعالى:\n\n'
                      '[ سَلامٌ عَلى آلِ يَّس، السَّلامُ عَلَيْكَ ياداعِيَ الله وَرَبَّانِيَّ آياتِهِ السَّلامُ عَلَيْكَ يابابَ الله وَدَيَّانَ دِينِهِ السَّلامُ عَلَيْكَ ياخَلِيفَةَ الله وَناصِرَ حَقِّهِ السَّلامُ عَلَيْكَ ياحُجَّةَ الله وَدَلِيلَ إِرادَتِهِ السَّلامُ عَلَيْكَ ياتالِيَ كِتابِ الله وَتَرْجُمانَهُ، السَّلامُ عَلَيْكَ فِي آناءِ لَيْلِكَ وَأَطْرافِ نَهارِكَ السَّلامُ عَلَيْكَ يابَقِيَّةَ الله فِي أَرْضِهِ السَّلامُ عَلَيْكَ يامِيثاقِ الله الَّذِي أَخَذَهُ وَوَكَّدَهُ السَّلامُ عَلَيْكَ ياوَعْدَ الله الَّذِي ضَمِنَهُ، السَّلامُ عَلَيْكَ أَيُّها العَلَمُ المَنْصُوبُ وَالعِلْمُ المَصْبُوبُ وَالغَوْثُ وَالرَّحْمَةُ الواسِعَةُ وَعْداً غَيْرَ مَكْذُوبٍ، السَّلامُ عَلَيْكَ حِينَ تَقُومُ السَّلامُ عَلَيْكَ حِيْنَ تَقْعُدْ السَّلامُ عَلَيْكَ حِينَ تَقْرَأُ وَتُبَيِّنُ السَّلامُ '
                      'عَلَيْكَ حِينَ تُصَلِّيَ وَتَقْنُتُ السَّلامُ عَلَيْكَ حِينَ تَرْكَعُ وَتَسْجُدُ السَّلامُ عَلَيْكَ حِينَ تُهَلِّلُ وَتُكَبِّرُ السَّلامُ عَلَيْكَ حِينَ تَحْمَدُ وَتَسْتَغْفِرُ السَّلامُ عَلَيْكَ حِينَ تُصْبِحُ وَتُمْسِي السَّلامُ عَلَيْكَ فِي اللَيْلِ إِذا يَغْشى وَالنَّهارِ إِذا تَجَلّى، السَّلامُ عَلَيْكَ أَيُّها الإمام المَأْمُونُ السَّلامُ عَلَيْكَ أَيُّها المُقَدَّمُ المَأْمُولُ السَّلامُ عَلَيْكَ بِجَوامِعِ السَّلامِ. أُشْهِدُكَ يامَوْلايَ أَنِّي أَشْهَدُ أَنْ '
                      'لا إِلهَ إِلاّ الله وَحْدَهُ لاشَرِيكَ لَهُ وَأَنَّ مُحَمَّداً عَبْدُهُ وَرَسُولُهُ لاحَبِيبَ إِلاّ هُوَ وَأَهْلُهُ، وَأُشْهِدُكَ يامَوْلايَ أَنَّ عَلِيّاً أَمِيرَ المُوْمِنِينَ حُجَّتُهُ وَالحَسَنَ حُجَّتُهُ وَالحُسَيْنَ حُجَّتُهُ وَعَلِيَّ بْنَ الحُسَيْنِ حُجَّتُهُ وَمُحَمَّدَ بْنَ عَلِيٍّ حُجَّتُهُ وَجَعْفَرَ بْنَ مُحَمَّدٍ حُجَّتُهُ وَمُوسى بْنَ جَعْفَرٍ حُجَّتُهُ وَعَلِيَّ بْنَ مُوسى حُجَّتُهُ وَمُحَمَّدَ بْنَ عَلِيٍّ حُجَّتُهُ وَعَلِيِّ بْنَ مُحَمَّدٍ حُجَّتُهُ وَالحَسَنَ بْنَ عَلِيٍّ حُجَّتُهُ، وَأَشْهَدُ أَنَّكَ حُجَّةُ الله أَنْتُمْ الأوَّلُ وَالآخِرُ، وَأَنَّ رَجْعَتَكُمْ حَقُّ لارَيْبَ فِيها يَوْمَ لايَنْفَعُ نَفْساً إِيمانُها لَمْ تَكُنْ آمَنَتْ مِنْ قَبْلُ أَوْ كَسَبَتْ فِي إِيمانِها خَيْراً، وَأَنَّ المَوْتَ حَقُّ وَأَنَّ ناكِراً وَنَكِيراً حَقُّ وَأَشْهَدُ أَنَّ '
                      'النَّشْرَ حَقُّ وَالبَعْثَ حَقُّ وَأَنَّ الصِّراطَ حَقُّ وَالمِرْصادَ حَقُّ وَالمِيزانَ حَقُّ وَالحَشْرَ حَقُّ وَالحِسابَ حَقُّ وَالجَنَّةَ حَقُّ وَالنَّارَ حَقُّ وَالوَعْدَ وَالوَعِيدَ بِهِما حَقُّ. يامَوْلايَ شَقِيَ مَنْ خالَفَكَ وَسَعِدَ مَنْ أَطاعَكَ ؛ فَاشْهَدْ عَلى ماأَشْهَدْتُكَ عَلَيْهِ وَأَنا وَلِيُّ لَكَ بَرِيٌ مِنْ عَدُوِّكَ، فَالحَقُّ مارَضَيْتُمُوهُ وَالباطِلُ ماأَسْخَطْتُمُوهُ وَالمَعْرُوفُ ماأَمَرْتُمْ بِهِ وَالمُنْكَرُ مانَهَيْتُمْ عَنْهُ فَنَفْسِي مُؤْمِنَةٌ بِالله وَحْدَهُ لاشَرِيكَ لَهُ وَبِرَسُولِهِ وَبِأَمِيرَ المُؤْمِنِينَ وَبِكُمْ يامَوْلايَ أَوَّلِكُمْ وَآخِرِكُمْ وَنُصْرَتِي مُعَدَّةٌ لَكُمْ وَمَوَدَّتِي خالِصَةٌ لَكُمْ آمِينَ آمِينَ ].\n\n'
                      'الدعاء عقيب هذا القول:\n\n'
                      '[ اللّهُمَّ إِنِّي أَسْأَلُكَ أَنْ تُصَلِّيَ عَلى مُحَمَّدٍ نَبِيِّ رَحْمَتِكَ وَكَلِمَةِ نُورِكَ وَأَنْ تَمْلا قَلْبِي نُورَ اليَّقِينِ وَصَدْرِي نُورَ الإيْمانِ وَفِكْرِي نُورَ النِّيَّاتِ وَعَزْمِي نُورَ العِلْمِ وَقُوَّتِي نُورَ العَمَلِ وَلِسانِي نُورَ الصِّدْقِ وَدِينِي نُورَ البَّصائِرِ مِنْ عِنْدِكَ وَبَصَرِي نُورَ الضِّياءِ وَسَمْعِي نُورَ الحِكْمَةِ وَمَوَدَّتِي نُورَ المُوالاةِ لِمُحَمَّدٍ وَآلِهِ عَلَيْهِمُ السَّلامُ، حَتّى أَلْقاكَ وَقَدْ وَفَيْتُ بِعَهْدِكَ وَمِيثاقِكَ فَتُغَشِّيَنِي رَحْمَتُكَ ياوَلِيُّ ياحَمِيدُ، اللّهُمَّ صَلِّ عَلى مُحَمَّدٍ حُجَتِّكَ فِي أَرْضِكَ وَخَلِيفَتِكَ فِي بِلادِكَ وَالدَّاعِي إِلى سَبِيلِكَ وَالقائِمِ بِقِسْطِكَ وَالثَّائِرِ بِأَمْرِكَ وَلِيِّ المُؤْمِنِينَ وَبَوارِ الكافِرِينَ وَمُجَلِّي الظُّلْمَةِ وَمُنِيرِ الحَقِّ وَالنَّاطِقِ بِالحِكْمَةِ وَالصِّدْقِ وَكَلِمَتِكَ التَّامَّةِ فِي أَرْضِكَ المُرْتَقِبِ الخائِفِ وَالوَلِيِّ النَّاصِحِ، سَفِينَةِ النَّجاةِ وَعَلَمِ الهُدى وَنُورِ أَبْصارِ الوَرى '
                      'وَخَيْرِ مَنْ تَقَمَّصَ وَارْتَدى وَمُجَلِّي العَمى الَّذِي يَمْلاُ الاَرْضَ عَدْلاً وَقِسْطاً كَما مُلِئَتْ ظُلْماً وَجَوْراً إِنَّكَ عَلى كُلِّ شَيٍْ قَدِيرٌ، اللّهُمَّ صَلِّ عَلى وَلِيِّكَ وَابْنِ أَوْلِيائِكَ الَّذِينَ فَرَضْتَ طاعَتَهُمْ وَأَوْجَبْتَ حَقَّهُمْ وَاذْهَبْتَ عَنْهُمْ الرِّجْسَ وَطَهَّرْتَهُمْ تَطْهِيراً، اللّهُمَّ انْصُرْهُ وَانْتَصِرْ بِهِ لِدِينِكَ وَانْصُرْ بِهِ أَوْلِيائَكَ وَأَوْلِيائهُ وَشِيعَتَهُ وَأَنْصارَهُ وَاجْعَلْنا مِنْهُمْ، اللّهُمَّ أَعِذْهُ مِنْ شَرِّ كُلِّ باغٍ وَطاغٍ وَمِنْ شَرِّ جَمِيعِ خَلْقِكَ وَاحْفَظْهُ مِنْ بَيْنِ يَدَيْهِ وَمِنْ خَلْفِهِ وَعَنْ يَمِينِهِ وَعَنْ شِمالِهِ وَاحْرُسْهُ وَامْنَعْهُ مِنْ أَنْ يُوصَلَ إِلَيْهِ بِسُوءٍ، وَاحْفَظْ فِيهِ رَسُولُكَ وَآلَ رَسُولَكَ وَأَظْهِرْ بِهِ العَدْلَ وَأَيِّدْهُ بِالنَّصْرِ وَانْصُرْ ناصِرِيهِ وَاخْذُلْ خاذِلِيهِ وَاقْصِمْ قاصِميهِ وَاقْصِمْ بِهِ جَبابِرَةَ الكُفْرِ وَاقْتُلْ بِهِ الكُفَّارَ وَالمُنافِقِينَ وَجَمِيعَ المُلْحِدِينَ حَيْثُ كانُوا مِنْ مَشارِقِ الاَرْضِ وَمَغارِبِها بَرِّها وَبَحْرِها، وَأَمْلاْ بِهِ الأرْضَ عَدْلاً وَأظْهِرْ بِهِ '
                      'دِينَ نَبِيِّكَ صَلّى الله عَلَيْهِ وَآلِهِ وَاجْعَلْنِي اللّهُمَّ مِنْ أَنْصارِهِ وَأَعْوانِهِ وَأَتْباعِهِ وَشِيعَتِهِ، وَأَرِنِي فِي آلِ مُحَمَّدٍ عَلَيْهِمْ السَّلامُ مايَأْمَلُونَ وَفِي عَدُوِّهِمْ مايَحْذَرُونَ ؛ إِلهَ الحَقِّ آمِينَ ياذا الجَلالِ وَالاِكْرامِ ياأَرْحَمَ الرَّاحِمِينَ ].\n\n'
                      'زيارة أخرى منقولة عَنْ الكتب المعتبرة: قف على باب حرمه الشريف وَقل:\n\n'
                      '[ السَّلامُ عَلَيْكَ ياخَلِيفَةَ الله وَخَلِيفَةَ آبائِهِ المَهْدِيِّينَ السَّلامُ عَلَيْكَ ياوَصِيَّ الأَوْصِياء الماضِينَ السَّلامُ عَلَيْكَ ياحافِظَ أَسْرارِ رَبِّ العالَمِينَ السَّلامُ عَلَيْكَ يابَقِيَّةَ الله مِنَ الصَّفْوَةِ المُنْتَجَبِينَ السَّلامُ عَلَيْكَ يا ابْنَ الاَنْوارِ الزَّاهِرَةِ السَّلامُ عَلَيْكَ ياابْنَ '
                      'الاَعْلامِ الباهِرَةِ السَّلامُ عَلَيْكَ ياابْنَ العِتْرَةِ الطَّاهِرَةِ السَّلامُ عَلَيْكَ يامَعْدِنَ العُلُومِ النَّبَوِيَّةِ السَّلامُ عَلَيْكَ يابابَ الله الَّذِي لايُؤْتى إِلاّ مِنْهُ، السَّلامُ عَلَيْكَ ياسَبِيلَ الله الَّذِي مِنْ سَلَكَ غَيْرَهُ هَلَكَ السَّلامُ عَلَيْكَ ياناظِرَ شَجَرَةِ طُوبى وَسِدْرَةِ المُنْتَهى، السَّلامُ عَلَيْكَ يانُورَ الله الَّذِي لايُطْفى السَّلامُ عَلَيْكَ ياحُجَّةَ الله الَّتِي لاتَخْفى السَّلامُ عَلَيْكَ ياحُجَّةَ الله عَلى مَنْ فِي الاَرْضِ وَالسَّماء السَّلامُ عَلَيْكَ سَلامَ مَنْ عَرَفَكَ بِما عَرَّفَكَ بِهِ الله وَنَعَتَكَ بِبَعْضِ نُعُوتِكَ الَّتِي أَنْتَ أَهْلُها وَفَوْقَها.\n\n'
                      'أَشْهَدُ أَنَّكَ الحُجَّةُ عَلى مَنْ مَضى وَمَنْ بَقِيَ وَأَنَّ حِزْبَكَ هُمُ الغالِبُونَ وَأَوْلِيائَكَ هُمُ الفائِزُونَ وَأَعْدائَكَ هُمُ الخاسِرُونَ، وَأَنَّكَ خازِنُ كُلِّ عِلْمٍ وَفاتِقُ كُلِّ رَتْقٍ وَمُحَقِّقُ كُلِّ حَقٍّ وَمُبْطِلُ كُلِّ باطِلٍ ؛ رَضَيْتُكَ يامَوْلايَ إِماماً وَهادِيا وَوَلِيَّا وَمُرْشِداً لاأَبْتَغِي بِكَ بَدَلاً وَلا أَتَّخِذُ مِنْ دُونِكَ وَلِيّاً، أَشْهَدُ أَنَّكَ الحَقُّ الثَّابِتُ الَّذِي لاعَيْبَ فِيهِ وَأَنَّ وَعْدَ الله فِيكَ حَقُّ لاارْتِيابَ لِطُولِ الغَيْبَةِ وَبُعْدِ الاَمَدِ وَلا أَتَحَيَّرُ مَعَ مَنْ جَهِلَكَ وَجَهِلَ بِكَ ، مُنْتَظِرٌ مُتَوَقِّعٌ لأيّامِكَ وَأَنْتَ الشَّافِعُ الَّذِي لاتُنازَعُ وَالوَلِيُّ الَّذِي لاتُدافَعُ ذَخَرَكَ الله لِنُصْرَةِ الدِّينِ وَإِعْزازِ المُؤْمِنِينَ وَالاِنْتِقامِ مِنْ الجاحِدِينَ المارِقِينَ. أَشْهَدُ أَنَّ بِوِلايَتِكَ تُقْبَلُ الأعْمالُ وَتُزَكّى الاَفْعالُ وَتُضاعَفُ الحَسَناتُ وَتُمْحى السَيِّئاتُ فَمَنْ جاءَ بِوِلايَتِكَ وَاعْتَرَفَ بِإِمامَتِكَ قُبِلَتْ أَعْمالُهُ وَصُدِّقَتْ أَقْوالُهُ وَتَضاعَفَتْ حَسَناتُهُ وَمُحِيَتْ سَيِّئاتُهُ، وَمَنْ عَدَلَ '
                      'عَنْ وِلايَتِكَ وَجَهِلَ مَعْرِفَتَكَ وَاسْتَبْدَلَ بِكَ غَيْرَكَ كَبَّهُ اللهُ عَلى مَنْخَرِهِ فِي النَّارِ وَلَمْ يَقْبَلِ الله لَهُ عَمَلاً وَلَمْ يُقِمْ لَهُ يَوْمَ القِيامَةِ وَزْنا أُشْهِدُ الله وَأُشْهِدُ مَلائِكَتَهُ وَأُشْهِدُكَ يامَوْلايَ بِهذا ظاهِرُهُ كَباطِنِهِ وَسِرِّهِ كَعَلانِيَّتِهِ، وَأَنْتَ الشَّاهِدُ عَلى ذلِكَ وَهُوَ عَهْدِي إِلَيْكَ وَمِيثاقِي لَدَيْكَ إِذْ أَنْتَ نِظامُ الدِّينِ وَيَعْسُوبُ المُتَّقِينَ وَعِزُّ المُوَحِّدِينَ وَبِذلِكَ أَمَرَنِي رَبُّ العالَمِينَ، فَلَوْ تَطاوَلَتِ الدُّهُورُ وَتَمادَتِ الاَعْمارُ لَمْ أَزْدَدْ فِيكَ إِلاّ يَقِيناً وَلَكَ إِلاّ حُبّاً وَعَلَيْكَ إِلاّ مُتَّكَلاً وَمُعْتَمَداً وَلِظُهُورِكَ إِلاّ مُتَوَقِّعاً وَمُنْتَظِراً وَلِجِهادِي بَيْنَ يَدَيْكَ مُتَرَقِّباً ؛ فَأَبْذُلْ نَفْسِي وَمالِي وَوَلَدِي وَأَهْلِي وَجَمِيعَ ماخَوَّلَنِي رَبِّي بَيْنَ يَدَيْكَ وَالتَّصَرُّفَ بَيْنَ أَمْرِكَ وَنَهْيِكَ.\n\n'
                      'مَوْلايَ فَإِنْ أَدْرَكْتُ أَيَّامَكَ الزَّاهِرَةَ وَأَعْلامَكَ الباهِرَةَ فَها أَنا ذا عَبْدُكَ المُتَصَرِّفُ بَيْنَ أَمْرِكَ وَنَهْيِكَ أَرْجُو بِهِ الشَّهادَةَ بَيْنَ يَدَيْكَ وَالفَوْزَ لَدَيْكَ، مَوْلايَ فَإِنْ أَدْرَكَنِي المَوْتُ قَبْلَ ظُهُورِكَ فَإِنِّي أَتَوَسَّلُ بِكَ وَبِآبائِكَ الطَّاهِرِينَ إِلى الله تَعالى وَأَسْأَلُهُ أَنْ يُصَلِّيَ عَلى مُحَمَّدٍ وَآلِ مُحَمَّدٍ وَأَنْ يَجْعَلَ لِي كَرَّةً فِي ظُهُورِكَ وَرَجْعَةً فِي أَيّامِكَ لاَبْلُغَ مِنْ طاعَتِكَ مُرادِي وَأَشْفِي مِنْ أَعْدائِكَ فُؤادِي، مَوْلايَ وَقَفْتُ فِي زِيارَتِكَ مَوْقِفَ الخاطِئِينَ النَّادِمِينَ الخائِفِينَ مِنْ عِقابِ رَبِّ العالَمِينَ وَقَدْ اتَّكَلْتُ عَلى شَفاعَتِكَ وَرَجَوْتُ بِمُوالاتِكَ وَشَفاعَتِكَ مَحْوَ ذُنُوبِي وَسَتْرَ عُيُوبِي وَمَغْفِرَةَ زَلَلِي، فَكُنْ لِوَلِيِّكَ يامَوْلايَ عِنْدَ تَحْقِيقِ أَمَلِهِ وَاسْأَلِ الله غُفْرانَ زَلَلِهِ فَقَدْ تَعَلَّقَ بِحَبْلِكَ وَتَمَسَّكَ بِوِلايَتِكَ وَتَبَرَّأَ مِنْ أَعْدائِكَ. اللّهُمَّ صَلِّ عَلى مُحَمَّدٍ وَآلِهِ وَأَنْجِزْ لِوَلِيِّكَ ماوَعَدْتَهُ، اللّهُمَّ أظْهِرْ كَلِمَتَهُ وَأعْلِ '
                      'دَعْوَتَهُ وَانْصُرْهُ عَلى عَدُوِّهِ وَعَدُوِّكَ يارَبَّ العالَمِينَ، اللّهُمَّ صَلِّ عَلى مُحَمَّدٍ وَآلِ مُحَمَّدٍ وَاظْهِرْ كَلِمَتَكَ التَّامَّةَ وَمُغَيَّبَكَ فِي أَرْضِكَ الخائِفَ المُتَرَقِّبَ، اللّهُمَّ انْصُرْهُ نَصْراً عَزِيزاً وَافْتَحْ لَهُ فَتْحاً يَسِيراً، اللّهُمَّ وَأَعِزَّ بِهِ الدِّينَ بَعْدَ الخُمُولِ وَأَطْلِعْ بِهِ الحَقَّ بَعْدَ الاُفُولِ وَأَجْلِ بِهِ الظُّلْمَةَ وَاكْشِفْ بِهِ الغُمَّةَ، اللّهُمَّ وَآمِنْ بِهِ البِلادَ وَاهْدِ بِهِ العِبادَ، اللّهُمَّ امْلاء بِهِ الاَرْضَ عَدْلاً وَقِسْطاً كَما مُلِئَتْ ظُلْماً وَجَوْراً إِنَّكَ سَمِيعٌ مُجِيبٌ.\n\n'
                      'السَّلامُ عَلَيْكَ ياوَلِيَّ الله إِئْذَنْ لِوَلِيِّكَ فِي الدُّخُولِ إِلى حَرَمِكَ صَلَواتُ الله عَلَيْكَ وَعَلى آبائِكَ الطَّاهِرِينَ وَرَحْمَةُ الله وَبَرَكاتُهُ ].\n\n'
                      'ثم ائت سرداب الغيبة وقف بين البابين ماسكا جانب الباب بيدك ثم تنحنح كالمستأذن وقل: [ بِسْمِ الله الرَّحْمنِ الرَّحِيمِ ]، وانزل بسكينة وحضور قلب وصل ركعتين في عرصة السرداب وقل:\n\n'
                      '[ الله أَكْبَرُ الله أَكْبَرُ الله أَكْبَرُ لا إِلهَ إِلاّ الله وَالله أَكْبَرُ وَللهِ الحَمْدُ الحَمْدُ للهِ الَّذِي هَدانا لِهذا وَعَرَّفَنا أَوْلِيائَهُ وَأَعْدائَهُ وَوَفَّقَنا لِزِيارَةِ أَئِمَّتِنا، وَلَمْ يَجْعَلْنا مِنَ المُعانِدِينَ النَّاصِبِينَ وَلا مِنَ الغُلاةِ المُفَوِّضِينَ وَلا مِنَ المُرْتابِينَ المُقَصِّرِينَ. السَّلامُ عَلى وَلِيِّ الله وَابْنَ أَوْلِيائِهِ السَّلامُ عَلى المُدَّخَر لِكَرامَةِ أَوْلِياء الله وَبَوارِ أَعْدائِهِ السَّلامُ عَلى النُّورِ الَّذِي أَرادَ أَهْلُ الكُفْرِ إِطْفأَهُ فَأَبى الله إِلاّ أَنْ يُتِمَّ نُورَهُ بِكُرْهِهِمْ وَأَيَّدَهُ بِالحَياةِ حَتّى يُظْهِرَ عَلى يَدِهِ الحَقَّ بِرَغْمِهِمْ، أَشْهَدُ أَنَّ الله اصْطَفاكَ صَغِيراً وَأَكْمَلَ لَكَ عُلُومَهُ كَبِيراً وَأَنَّكَ حَيُّ لاتَمُوتَ حَتّى تُبْطِلَ الجِبْتَ وَالطَّاغُوتَ، اللّهُمَّ صَلِّ عَلَيْهِ وعَلى خُدَّامِهِ وَأَعْوانِهِ وَعَلى غَيْبَتِهِ وَنَأْيِهِ وَاسْتُرْهُ سَتْراً عَزِيزاً وَاجْعَلْ لَهُ مَعْقِلاً حَرِيزاً وَاشْدُدِ اللّهُمَّ وَطْأَتَكَ عَلى مُعانِدِيهِ وَاحْرُسْ مَوالِيهِ وَزائِرِيهِ، اللّهُمَّ كَما جَعَلْتَ قَلْبِي بِذِكْرِهِ مَعْمُوراً فَاجْعَلْ سِلاحِي بِنُصْرَتِهِ مَشْهُوراً، وَإِنْ حالَ بَيْنِي وَبَيْنَ لِقائِهِ المَوْتُ الَّذِي جَعَلْتَهُ عَلى عِبادِكَ حَتْما وَأَقْدَرْتَ بِهِ عَلى خَلِيقَتِكَ رَغْما فَابْعَثْنِي عِنْدَ خُرُوجِهِ ظاهِراً مِنْ حُفْرَتِي مُؤْتَزِراً كَفَنِي '
                      'حَتّى أُجاهِدَ بَيْنَ يَدَيْهِ فِي الصَّفِّ الَّذِي أَثْنَيْتَ عَلى أَهْلِهِ فِي كِتابِكَ فَقُلْتَ: كَأَنَّهُمْ بُنْيانٌ مَرْصُوصٌ. اللّهُمَّ طالَ الاِنْتِظارُ وَشَمُتَ مِنّا الفُجّارُ وَصَعُبَ عَلَيْنا الاِنْتِصارُ، اللّهُمَّ أَرِنا وَجْهَ وَلِيِّكَ المَيْمُونَ فِي حَياتِنا وَبَعْدَ المَنُونِ، اللّهُمَّ إِنِّي أَدِينُ لَكَ بِالرَّجْعَةِ بَيْنَ يَدَيْ صاحِبِ هذِهِ البُقْعَةِ الغَوْثَ الغَوْثَ ياصاحِبَ الزَّمانِ! قَطَعْتُ فِي وُصْلَتِكَ الخُلاّ نَ وَهَجَرْتُ لِزِيارَتِكَ الاَوْطانَ وَأَخْفَيْتُ أَمْرِي عَنْ أَهْلِ البُلْدانِ، لِتَكُونَ شَفِيعاً عِنْدَ رَبِّكَ وَرَبِّي وَإِلى آبائِكَ وَمَوالِيَّ فِي حُسْنِ التَّوْفِيقِ لِي وَإسْباغِ النِّعْمَةِ عَلَيَّ وَسَوْقِ الاِحْسانِ إِلَيَّ، اللّهُمَّ صَلِّ عَلى مُحَمَّدٍ وَآلِ مُحَمَّدٍ أَصْحابِ الحَقِّ وَقادَةِ الخَلْقِ وَاسْتَجِبْ مِنِّي مادَعَوْتُكَ وَأَعْطِنِي مالَمْ أَنْطِقْ بِهِ فِي دُعائِي مِنْ صَلاحِ دِينِي وَدُنْيايَ إِنَّكَ حَمِيدٌ مَجِيدٌ، وَصَلّى الله عَلى مُحَمَّدٍ وَآلِهِ الطَّاهِرِينَ ].\n\n'
                      'ثم ادخل الصّفة فصل ركعتين وقل:\n\n'
                      '[ اللّهُمَّ عَبْدُكَ الزَّائِرُ فِي فَناءِ وَلِيِّكَ المَزُورِ الَّذِي فَرَضْتَ طاعَتَهُ عَلى العَبِيدِ وَالاَحْرارِ وَأَنْقَذْتَ بِهِ أَوْلِياءَكَ مِنْ عَذابِ النَّارِ، اللّهُمَّ اجْعَلْها زِيارَةً مَقْبُولَةً ذاتَ دُعاءٍ مُسْتَجابٍ مِنْ مُصَدِّقٍ بِوَلِيِّكَ غَيْرِ مُرْتابٍ، اللّهُمَّ لاتَجْعَلْهُ آخِرَ العَهْدِ بِهِ وَلا بِزِيارَتِهِ وَلاتَقْطَعْ أَثَرِي مِنْ مَشْهَدِهِ وَزِيارَةِ أَبِيهِ وَجَدِّهِ، اللّهُمَّ أَخْلِفْ عَلَيَّ نَفَقَتِي وَانْفَعْنِي بِما رَزَقْتَنِي فِي دُنْيايَ وَآخِرَتِي لِي وَلاِخْوانِي وَأَبَوَيَّ وَجَمِيعِ عُتْرَتِي أَسْتَوْدِعُكَ الله أَيُّها الإمام الَّذِي يَفُوزُ بِهِ المُؤْمِنُونَ وَيَهْلِكُ عَلى يَدَيْهِ الكافِرُونَ المُكَذِّبُونَ يامَوْلايَ ياابْنَ الحَسَنِ بْنِ عَلِيٍّ جِئْتُكَ زائِراً وَلاَبِيكَ وَجَدِّكَ مُتَيَقِّنا الفَوْزَ بِكُمْ مُعْتَقِداً إِمامَتَكُمْ، اللّهُمَّ اكْتُبْ هذِهِ الشَّهادَةَ وَالزِّيارَةَ لِي عِنْدَكَ فِي عِلِّيِّينَ وَبَلِّغْنِي بَلاغَ الصَّالِحِينَ وَانْفَعْنِي بِحُبِّهُمْ يارَبَّ العالَمِينَ.',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
            ],
          ),
        ),
        bottomNavigationBar: AddCustomBottomNavigationBar(
        pushNext: ZiyaratAl2imamAlmahdiAlmankoula.screenRoute,
        pushBack: ZiyaratAlimamAl3askari.screenRoute,
        soud: 'https://cdn.jsdelivr.net/gh/SounaDiab/image_audio@master/audio/المقام الثاني.mp3',
        onTap: (double fontSize) {
          // تحديث حجم الخط
          setState(() {
            isTablet ? _fontSizeTablet = fontSize : _fontSize = fontSize;
          });
          print('fontSize: $fontSize');
          // إغلاق Dialog
          Navigator.of(context).pop();
        },
        onLongPress: () {
          final snackBar = SnackBar(
            content: Center(
              child: Text(
                '${isTablet ? _fontSizeTablet.toInt() : _fontSize.toInt()}',
                style: TextStyle(
                  color: Colors.white,
                  fontSize: 16,
                ),
              ),
            ),
            width: 60,
            behavior: SnackBarBehavior.floating,
            backgroundColor: Colors.blue,
            duration: Duration(seconds: 2),
            shape: ShapeBorder.lerp(
              RoundedRectangleBorder(
                borderRadius: BorderRadius.circular(50),
              ),
              RoundedRectangleBorder(
                borderRadius: BorderRadius.circular(50),
              ),
              1,
            ),
          );
          ScaffoldMessenger.of(context).showSnackBar(snackBar);
        },
      ),
      ),
    );
  }
}
