import 'package:flutter/material.dart';
import 'package:maktabat_almoslim/widgets/container_scrollview.dart';
import 'package:provider/provider.dart';
import 'package:shared_preferences/shared_preferences.dart';

import '../../../../widgets/add_custom_bottom_navigation_bar.dart';
import '../../../../widgets/list_of_nine_verses.dart';
import '../../../favorites_provider.dart';
import '../../../favorites_screen.dart';
import '../ziyarat_2a2imat_sir.dart';
import 'ziyarat_al2imam_almahdi_al2o5ra_alsalisa.dart';
import 'ziyarat_alimam_al3askari.dart';

class AlmakamAl2awal extends StatefulWidget {
  static String screenRoute = 'almakam_al2awal_screen';
  const AlmakamAl2awal({super.key});

  @override
  State<AlmakamAl2awal> createState() => _AlmakamAl2awalState();
}

double _fontSize = 18;
double _fontSizeTablet = 30;

class _AlmakamAl2awalState extends State<AlmakamAl2awal> {
  bool isIcon = true;
  @override
  void initState() {
    super.initState();
    _loadFavoriteState();
  }

  Future<void> _loadFavoriteState() async {
    final prefs = await SharedPreferences.getInstance();
    bool? savedState = prefs.getBool('isFavorite_almakam_al2awal_screen');
    setState(() {
      isIcon = savedState ?? true;
    });
  }

  Future<void> _saveFavoriteState(bool value) async {
    final prefs = await SharedPreferences.getInstance();
    await prefs.setBool('isFavorite_almakam_al2awal_screen', value);
  }

    Future<bool> _onWillPop() async {
    final args =
        ModalRoute.of(context)!.settings.arguments as Map<String, dynamic>?;
    final previousPage = args?['previousPage'];
    if (previousPage == 'favorite_screen') {
      Navigator.of(context).pushReplacementNamed(FavoritesScreen.screenRoute);
      return false;
    } else {
      Navigator.of(context).pushReplacementNamed(Ziyarat2a2imatSir.screenRoute);
      return false;
    }
  }

  @override
  Widget build(BuildContext context) {
    double size = MediaQuery.of(context).textScaleFactor;
    final screenWidth = MediaQuery.of(context).size.width;
    final isTablet = screenWidth >= 600;
    return Scaffold(
      appBar: AppBar(
        toolbarHeight: isTablet ? 100 : 50,
        centerTitle: true,
        leading: IconButton(
          onPressed: () {
            Navigator.of(context).pop();
          },
          icon: Icon(
            Icons.arrow_back,
            size: isTablet ? 50 : 25,
          ),
        ),
        actions: [
          IconButton(
            padding: EdgeInsets.only(left: isTablet ? 50 : 30),
            icon: Icon(
              isIcon ? Icons.favorite_border : Icons.favorite_rounded,
              size: isTablet ? 40 : 25,
              color: isIcon ? Colors.black : Colors.red,
            ),
            onPressed: () async {
              setState(() {
                isIcon = !isIcon;
              });
              await _saveFavoriteState(isIcon);

              if (!isIcon) {
                Provider.of<FavoritesProvider>(context, listen: false).addFavorite(
                    'المقام الأول: في زيارة أئمة سر من رأى (عليه السلام) وأعمال السرداب',
                    AlmakamAl2awal.screenRoute);
              } else {
                Provider.of<FavoritesProvider>(context, listen: false)
                    .removeFavorite(
                        'المقام الأول: في زيارة أئمة سر من رأى (عليه السلام) وأعمال السرداب',
                        AlmakamAl2awal.screenRoute,
                        AlmakamAl2awal.screenRoute);
              }
            },
          ),
        ],
        title: Text(
          'المقام الأول: في زيارة أئمة سر من رأى (عليه السلام) وأعمال السرداب',
          style: TextStyle(
            fontSize: isTablet
                ? 40
                : size > 1.0
                    ? 20
                    : 23,
            fontWeight: FontWeight.bold,
          ),
        ),
      ),
      body: ContainerScrollview(
        widget: Column(
          crossAxisAlignment: CrossAxisAlignment.start,
          children: [
            Container(
              child: Column(
                children: [
                  Center(
                    child: Text(
                      'بسم الله الرحمن الرحيم',
                      style: TextStyle(
                        fontSize: isTablet ? _fontSizeTablet : _fontSize,
                        fontWeight: FontWeight.w900,
                      ),
                    ),
                  ),
                  Center(
                    child: Text(
                      'اللهم صلِّ على محمد وآل محمد',
                      style: TextStyle(
                        fontSize: isTablet ? _fontSizeTablet : _fontSize,
                        fontWeight: FontWeight.w900,
                      ),
                    ),
                  ),
                ],
              ),
            ),
            Container(
              child: ListOfNineVerses(
                title: '',
                subtitle:
                    'في زيارة الإمامين المعصومين علي بن محمد النقي والحسن بن علي العسكري (صلوات الله عليهم) إذا دخلت سرّ من رأى إن شاء الله وقصدت زيارتهما (عليهما السلام) فاغتسل وتأدّب بآداب دخول المشاهد الشريفة ثم سر بسكينة ووقار حتى تبلغ باب الحرم الطاهر واستاذن للدخول بالاستئذان العام السالف في أوائل هذا الباب، ثم ادخل الحرم الشريف وزرهما (عليه السلام) بهذه الزيارة وهي أصح الزيارات:\n\n'
                    '[ السَّلامُ عَلَيْكُما ياوَلِيَّيِ الله السَّلامُ عَلَيْكُما ياحُجَّتَي الله السَّلامُ عَلَيْكُما يانُورَي الله فِي ظُلُماتِ الاَرْضِ السَّلامُ عَلَيْكُما يامَنْ بَداً للهِ فِي شَأْنِكُما، أَتَيْتُكُما زائِراً عارِفاً بِحَقِّكُما مُعادِياً لاَعْدائِكُما مُوالِياً لاَوْلِيائِكُما مُؤْمِناً بِما آمَنْتُما بِهِ كافِراً بِما كَفَرْتُما بِهِ مُحَقِّقاً لِما حَقَّقْتُما مُبْطِلاً لِما أَبْطَلْتُما، أَسْأَلُ الله رَبِّي وَرَبَّكُما أَنْ يَجْعَلَ حَظِّي مِنْ زِيارَتِكُما الصَّلاةَ عَلى مُحَمَّدٍ وَآلِهِ، وَأَنْ يَرْزُقَنِي مُرافَقَتَكُما فِي الجِنانِ مَعَ آبائِكُما الصَّالِحِينَ، وَأَسْأَلُهُ أَنْ يُعْتِقَ رَقَبَتِي مِنَ النَّارِ وَيَرْزُقَنِي شَفاعَتَكُما وَمُصاحَبَتَكُما وَيُعَرِّفَ بَيْنِي وَبَيْنَكُما وَلايَسْلُبَنِي حُبَّكُما وَحُبَّ آبائِكُما الصَّالِحِينَ، وَأَنْ لايَجْعَلَهُ آخِرَ العَهْدِ مِنْ زِيارَتِكُما وَيَحْشُرَنِي مَعَكُما فِي الجَنَّةِ بِرَحْمَتِهِ. اللّهُمَّ ارْزُقْنِي حُبَّهُما وَتَوَفَّنِي عَلى مِلَّتِهما، اللّهُمَّ العَنْ ظالِمِي آلِ مُحَمَّدٍ حَقَّهُمْ وَانْتَقِمْ مِنْهُمْ، اللّهُمَّ العَنْ الأوَّلِينَ مِنْهُمْ وَالآخِرِينَ وَضاعِفْ عَلَيْهِمُ العَذابَ وَأَبْلِغ بِهِمْ وَبِأَشْياعِهِمْ وَمُحِبِّيهِمْ وَمُتَّبِعِيهِمْ أَسْفَلَ دَرَكٍ مِنْ الجَّحِيمِ إِنَّكَ عَلى كُلِّ شَيٍْ قَدِيرٌ، اللّهُمَّ عَجِّلْ فَرَجَ وَلِيِّكَ وَابْنِ وَلِيِّكَ وَاجْعَلْ فَرَجَنا مَعَ فَرَجِهِمْ ياأَرْحَمَ الرَّاحِمِينَ ].\n\n'
                    'وتجتهد في الدعاء لنفسك ولوالديك وتخير من الدعاء فإن وصلت إليهما (أي إن أمكنك الوصول إلى قبرهما) (صلوات الله عليهما) فصلِّ عند قبريهما ركعتين وإذا دخلت المسجد (أي لم تتمكن من القبر) وصليت دعوت الله بما احببت إنّه قريب مجيب. وهذا المسجد إلى جانب الدار وفيه كانا يصلّيان (عليهما السلام).\n\n'
                    'أقول: قد أثبتنا هذه الزيارة طبقاً لكتاب (كامل الزيارة) وقد روى الزيارة باختلاف يسير الشيخ محمد ابن المشهدي والشيخ المفيد والشهيد أيضاً في مزاراتهم وقد ورد في نسخهم بعد الفقرة: (في الجنة برحمته) ثم اذهب وانكبّ على كل من القبرين وقبلهما وضع جانبي وجهك عليهما ثم ارفع رأسك وقل: [ اللّهُمَّ ارْزُقْنِي حُبَّهُمْ وَتَوَفَّنِي عَلى مِلَّتِهِمْ… ] إلى آخر الزيارة السالفة.\n\n'
                    'ثم قالوا صل أربع ركعات عند الرأس المقدّس وصلّ ماشئت بعد صلاة الزيارة… الخ . ولايخفى أنّهما (عليهما السلام) مدفونان في دارهما وكان للدار باب يفتح حينا فتدخل الشيعة منه وتزور قَرِيباً من القبر، ويغلق حينا فتقف الشيعة للزيارة أمام نافذةٍ في الجدار المقابل للقبر، ويلاحظ في مفتتح الرواية التي وردت فيها هذه الزيارة هذه العبارة تقول بعد الغسل إن وصلت إلى قبرهما وإِلاّ أومات بالسلام من عند الباب الذي على الشارع (الشبّاك) وهذا الزائر الذي لم يتمكن من الاقتراب من القبر يصلي الصلاة في المسجد. وقد اكترث للامر الشيعة الموالون فنسفوا الدار وشيدوا في موضعه القبّة والحرم والرواق والايوان فأصبح المسجد داخل الحرم الشريف.\n\n'
                    'والمشهور الان أنّ الايوان المستطيل المتصل بالرواق خلف العسكريين (عليهما السلام) هو المسجد المذكور وعلى كل حال فقد نجا الزائر من هذا الضيق.\n\n'
                    'ولهما (عليهما السلام) زيارات خاصّة تخصّ كلاً منهما، وعامة مشتركة بينهما وهي مذكورة في كتب الزيارات ونسخها كثيرة شايعة لمن رغب في الزيارة بهما. والزائر إذا أسعفه الحال والمجال فمن المناسب أن يزور بالزيارة الجامعة الكبيرة الاتية إن شاء الله تعالى، فهي بما تحتويه من الكلمات الفصيحة البليغة المعبّرة عن أقصى مراتب الطاعة والخضوع والاقرار بعظمة الأئمة (عليهم السلام) وجلالهم هي قد صدرت من منبع الجلال والعظمة الإمام الهادي (عليه السلام).والسيد ابن طاووس قد خصّ في (مصباح الزائر) كل واحد منهما (عليهما '
                    'السلام) بزيارة مبسوطة وصلاة عليه ودعاء يدعى به بعد صلاة زيارته وهي بما تحتويها من الفوائد تبعثنا على إيرادها هنا وإن أوجبت التطويل. قال: إذا وصلت إلى محلّه الشريف بسرّ من رأى فاغتسل عند وصولك غسل الزيارة والبس أطهر ثيابك وامش على سكينة ووقار إلى أن تصل الباب الشريف فإذا بلغته فاستاذن وقل:\n\n'
                    '[ أَأَدْخُلُ يانَبِيَّ الله أَأَدْخُلُ ياأمِيرَ المُؤْمِنِينَ أَأَدْخُلُ يافاطِمَةَ الزَّهْراءَ سَيِّدَةَ نِساءِ العالمِينَ أَأَدْخُلُ يامَوْلايَ الحَسَنَ بْنَ عَلِيٍّ أَأَدْخُلُ يامَوْلايَ الحُسَيْنَ بْنَ عَلِيٍّ أَأَدْخُلُ يامَوْلايَ عَلِيّ بْنَ الحُسَيْنِ أَأَدْخُلُ يامَوْلايَ مُحَمَّدَ بْنَ عَلِيٍّ أَأَدْخُلُ يامَوْلايَ جَعْفَرَ بْنَ مُحَمَّدٍ أَأَدْخُلُ يامَوْلايَ مُوسىْ بْنَ جَعْفَرٍ أَأَدْخُلُ يامَوْلايَ عَلِيَّ بْنَ مُوسى أَأَدْخُلُ يامَوْلايَ مُحَمَّدَ بْنَ عَلِيٍّ أَأَدْخُلُ يامَوْلايَ ياأَبا الحَسَنِ عَلِيّ بْنَ مُحَمَّدٍ أَأَدْخُلُ يامَوْلايَ ياأَبا مُحَمَّدٍ الحَسَنَ بْنَ عَلِيٍّ أَأَدْخُلُ يامَلائِكَةَ الله المُوَكَّلِينَ بِهذا الحَرَمِ الشَّرِيفِ ]. ثم تدخل مقدّما رجلك اليمنى وتقف على ضريح الإمام أبي الحسن الهادي (عليه السلام) مستقبلاً القبر ومستدبراً القبلة وتقول “مائة مرة “: الله أَكْبَرُ، وتقول:[ السَّلامُ عَلَيْكَ ياأَبا الحَسَنِ عَلِيَّ بْنَ '
                    'مُحَمَّدٍ الزَّكِيَّ الرَّاشِدَ النُّورَ الثَّاقِبَ وَرَحْمَةُ الله وَبَرَكاتُهُ، السَّلامُ عَلَيْكَ ياصَفِيَّ الله السَّلامُ عَلَيْكَ ياسِرَّ الله السَّلامُ عَلَيْكَ ياحَبْلَ الله السَّلامُ عَلَيْكَ ياآلَ الله السَّلامُ عَلَيْكَ ياخِيرَةَ الله السَّلامُ عَلَيْكَ ياصَفْوَةَ الله السَّلامُ عَلَيْكَ ياأَمِينَ الله السَّلامُ عَلَيْكَ ياحَقَّ الله السَّلامُ عَلَيْكَ ياحَبِيبَ اللهِ، السَّلامُ عَلَيْكَ يانُورَ الاَنْوارِ السَّلامُ عَلَيْكَ يازَيْنَ الاَبْرارِ السَّلامُ عَلَيْكَ ياسَلِيلَ الاَخْيارِ السَّلامُ عَلَيْكَ ياعُنْصُرَ الاَطْهارِ، السَّلامُ عَلَيْكَ ياحُجَّةَ الرَّحْمنِ السَّلامُ عَلَيْكَ يارُكْنَ الإيْمانِ السَّلامُ عَلَيْكَ يامَوْلى المُؤْمِنِينَ السَّلامُ عَلَيْكَ ياوَلِيَّ الصَّالِحِينَ السَّلامُ عَلَيْكَ ياعَلَمَ الهُدى السَّلامُ عَلَيْكَ ياحَلِيفَ التُّقى، السَّلامُ عَلَيْكَ ياعَمُودَ الدِّينِ السَّلامُ عَلَيْكَ يابْنَ خاتَمِ النَّبِيِّينَ السَّلامُ عَلَيْكَ يابْنَ سَيِّدِ الوَصِيِّينَ السَّلامُ عَلَيْكَ يابْنَ فاطِمَةَ الزَّهْراءِ سَيِّدَةِ نِساءِ العالَمِينَ، السَّلامُ عَلَيْكَ أَيُّها الاَمِينُ الوَفِيُّ السَّلامُ عَلَيْكَ أَيُّها العَلَمُ الرَّضِيُّ السَّلامُ '
                    'عَلَيْكَ أَيُّها الزَّاهِدُ التَّقِيُّ السَّلامُ عَلَيْكَ أَيُّها الحُجَّةُ عَلى الخَلْقِ أَجْمَعِينَ، السَّلامُ عَلَيْكَ أَيُها التَّالِيَ لِلْقُرْآنِ السَّلامُ عَلَيْكَ أَيُها المُبَيِّنُ لِلْحَلالِ مِنَ الحَرامِ، السَّلامُ عَلَيْكَ أَيُها الوَلِيُّ النَّاصِحُ السَّلامُ عَلَيْكَ أَيُها الطَّرِيقُ الواضِحُ السَّلامُ عَلَيْكَ أَيُها النَّجْمُ اللائِحُ، أَشْهَدُ يامَوْلايَ ياأَبا الحَسَنِ أنَكَّ حُجَّةُ اللهِ عَلى خَلْقِهِ وَخَلِيفَتُهُ فِي بَرِيَّتِهِ وَأَمِينُهُ فِي بِلادِهِ وَشاهِدُهُ عَلى عِبادِهِ، '
                    'وَأَشْهَدُ أَنَّكَ كَلِمَةُ التَّقْوى وَبابُ الهُدى وَالعُرْوَةُ الوُثْقى وَالحُجَّةُ عَلى مَنْ فَوْقَ الاَرْضِ وَمَنْ تَحْتَ الثَّرى، وَأَشْهَدُ أَنَّكَ المُطَهَّرُ مِنَ الذُّنُوبِ المُبَرَّأُ مِنَ العُيُوبِ وَالمُخْتَصُّ بِكَرامَةِ الله وَالمَحْبُوُّ بِحُجَّةِ الله وَالمَوْهُوبُ لَهُ كَلِمَةُ الله وَالرُّكْنُ الَّذِي يَلْجَأُ إِلَيْهِ العِبادُ وَتُحْيا بِهِ البِلادُ، وَأَشْهَدُ يامَوْلايَ أَنِّي بِكَ وَبِآبائِكَ وَأَبْنائِكَ مُوقِنٌ مُقِرُّ وَلَكُمْ تابِعٌ فِي ذاتِ نَفْسِي وَشَرائِعِ دِينِي وَخاتِمَةِ عَمَلِي وَمُنْقَلَبِي وَمَثْوايَ، وَأَنِّي وَلِيُّ لِمَنْ وَالاكُمْ وَعَدُوُّ لِمَنْ عاداكُمْ مُؤْمِنٌ بِسِرِّكُمْ وَعَلانِيَّتَكُمْ وَأَوَّلِكُمْ وَآخِرِكُمْ بِأَبِي أَنْتَ وَاُمِّي وَالسَّلامُ عَلَيْكَ وَرَحْمَةُ الله وَبَرَكاتُهُ ].\n\n'
                    'ثم قبّل ضريحه وضع خدّك الايمن عليه ثم الأيسر وقل\n\n'
                    '[ اللّهُمَّ صَلِّ عَلى مُحَمَّدٍ وَآلِ مُحَمَّدٍ وَصَلِّ عَلى حُجَّتِكَ الوَفِيِّ وَوَلِيِّكَ الزَّكِيَ وَأَمِينِكَ المُرْتَضى وَصَفِيِّكَ الهادِي وَصِراطِكَ المُسْتَقِيمِ وَالجادَّةِ العُظْمى وَالطَّرِيقَةِ الوُسْطى، نُورِ قُلُوبِ المُؤْمِنِينَ وَوَلِيِّ المُتَّقِينَ وَصاحِبِ المُخْلِصِينَ، اللّهُمَّ صَلِّ عَلى سَيِّدِنا وَمَوْلانا مُحَمَّدٍ وَأَهْلِ بَيْتِهِ وَصَلِّ عَلى عَلِيٍّ بْنِ مُحَمَّدٍ الرَّاشِدِ المَعْصُومِ مِنَ الزَّلَلِ وَالطَّاهِرِ مِنَ الخَلَلِ وَالمُنْقَطِعِ إِلَيْكَ بِالاَمَلِ، المَبْلُوِّ بِالفِتَنِ وَالمُخْتَبَرِ بِالمِحَنِ وَالمُمْتَحَنِ بِحُسْنِ البَلْوى وَصَبْرِ الشَّكْوى مُرْشِدِ عِبادِكَ وَبَرَكَةِ بِلادِكَ وَمَحَلِّ رَحْمَتِكَ وَمُسْتَوْدَعِ حِكْمَتِكَ وَالقائِدِ إِلى جَنَّتِكَ العالِمِ فِي بَرِيَّتِكَ وَالهادِي فِي خَلِيقَتِكَ، الَّذِي ارْتَضَيْتَهُ وَانْتَجَبْتَهُ وَاخْتَرْتَهُ لِمَقامِ رَسُولِكَ فِي اُمَّتِهِ وَأَلْزَمْتَهُ حِفْظَ '
                    'شَرِيعَتِهِ فَاسْتَقَلَّ بِأَعْباءِ الوَصِيَّةِ ناهِضا بِها وَمُضْطَلِعاً بِحَمْلِها لَمْ يَعْثُرْ فِي مُشْكِلٍ وَلا هَفاً فِي مُعْضِلٍ بَلْ كَشَفَ الغُمَّةَ وَسَدَّ الفُرْجَةَ وَأَدَّى المُفْتَرَضَ، اللّهُمَّ فَكما أَقْرَرْتَ ناظِرَ نَبِيِّكَ بِهِ فَرَقِّهِ دَرَجَتَهُ وَأَجْزِلْ لَدَيْكَ مَثُوبَتَهُ وَصَلِّ عَلَيْهِ وَبَلِّغْهُ مِنَّا تَحِيَّةً وَسَلاماً، وَآتِنا مِنْ لَدُنْكَ فِي مُوالاتِهِ فَضْلاً وَإِحْسانا وَمَغْفِرَةً وَرِضْوانا إِنَّكَ ذُو الفَضْلِ العَظِيمِ].ثم تصلّي صلاة الزيارة فإذا سلّمت فقل: [ ياذا القُدْرَةِ الجامِعَةِ وَالرَّحْمَةِ الواسِعَةِ وَالمِنَنِ المُتَتابِعَةِ والآلاءِ المُتَواتِرَةِ وَالاَيادِي الجَلِيلَةِ وَالمَواهِبِ الجَزِيلَةِ صَلِّ عَلى مُحَمَّدٍ وَآلِ مُحَمَّدٍ الصَّادِقِينَ، وَأَعْطِنِي سُؤْلِي وَاجْمَعْ شَمْلِي وَلُمَّ شَعَثِي وَزَكِّ عَمَلِي وَلاتُزِغْ قَلْبِي بَعْدَ إِذْ هَدَيْتَنِي وَلاتُزِلْ قَدَمِي '
                    'وَلا تَكِلْنِي إِلى نَفْسِي طَرْفَةَ عَيْنٍ أَبَداً، وَلاتُخَيِّبْ طَمَعِي وَلاتُبْدِ عَوْرَتِي وَلاتَهْتِكْ سِتْرِي وَلاتُوْحِشْنِي وَلاتُؤْيِسْنِي وَكُنْ بِي رَؤُوفاً رَحِيماً، وَاهْدِنِي وَطَهِّرْنِي وَصَفِّنِي وَاصْطَفِنِي وَخَلِّصْنِي وَاسْتَخْلِصْنِي وَاصْنَعْنِي وَاصْطَنِعْنِي وَقَرِّبْنِي إِلَيْكَ وَلا تُباعِدْنِي مِنْكَ، وَالْطُفْ بِي وَلاتَجْفُنِي وَأَكْرِمْنِي وَلاتُهِنِّي وَما أَسْأَلُكَ فَلا تَحْرِمْنِي وَما لا أَسْأَلُكَ فَاجْمَعْهُ لِي بِرَحْمَتِكَ ياأَرْحَمَ الرَّاحِمِينَ وَأَسْأَلُكَ بِحُرْمَةِ وَجْهِكَ الكَرِيمِ وَبِحُرْمَةِ نَبِيِّكَ مُحَمَّدٍ صَلَواتُكَ عَلَيْهِ وَآلِهِ وَبِحُرْمَةِ أَهْلِ بَيْتِ رَسُولِكَ أَمِيرِ المُؤْمِنِينَ عَلِيٍّ وَالحَسَنِ وَالحُسَيْنِ وَعَلِيٍّ وَمُحَمَّدٍ وَجَعْفَرٍ وَمُوسى وَعَلِيٍّ ومُحَمَّدٍ وَعَلِيٍّ وَالحَسَنِ وَالخَلَفِ الباقِي صَلَواتُكَ وَبَرَكاتُكَ عَلَيْهِمْ، أَنْ تُصَلِّيَ عَلَيْهِمْ أَجْمَعِينَ وَتُعَجِّلَ فَرَجَ قائِمِهِمْ بِأَمْرِكَ وَتَنْصُرَهُ وَتَنْتَصِرَ بِهِ '
                    'لِدِينِكَ وَتَجْعَلَنِي فِي جُمْلَةِ النَّاجِينَ بِهِ وَالمُخْلِصِينَ فِي طاعَتِهِ، وَأَسْأَلُكَ بِحَقِّهِمْ لَمَّا اسْتَجَبْتَ لِي دَعْوَتِي وَقَضَيْتَ لِي حاجَتِي وَأَعْطَيْتَنِي سُؤْلِي وَكَفَيْتَنِي ماأَهَمَّنِي مِنْ أَمْرِ دُنْيايَ وَآخِرَتِي ياأَرْحَمَ الرَّاحِمِينَ، يانُورُ يابُرْهانُ يامُنِيرُ يامُبِينُ يارَبِّ اكْفِنِي شَرَّ الشُّرُورِ وَآفاتِ الدُّهُورِ، وَأَسْأَلُكَ النَّجاةَ يَوْمَ يُنْفَخُ فِي الصُّورِ ].\n\n'
                    'وادع بما شئت واكثر من قولك: [ ياعُدَّتِي عِنْدَ العَدَدِ وَيارَجائِي وَالمُعْتَمَدَ وَياكَهْفِي وَالسَّنَدَ ياواحِدُ ياأَحَدُ وَيا قُلْ هُوَ الله أَحَدٌ أَسْأَلُكَ اللّهُمَّ بِحَقِّ مَنْ خَلَقْتَ مِنْ خَلْقِكَ وَلَمْ تَجْعَلْ فِي خَلْقِكَ مِثْلَهُمْ أَحَداً صَلِّ عَلى جَماعَتِهِمْ وَافْعَلْ بِي كَذا وَكَذا ]. وسل حوائجك عوض هذه الكلمة فقد روي عنه (صلوات الله عليه) أنّه قال: إنّني دعوت الله عزَّ وجلَّ أن لايخيب من دعا به في مشهدي بعدي.',
                weight: FontWeight.w600,
                size: isTablet ? _fontSizeTablet : _fontSize,
              ),
            ),
          ],
        ),
      ),
      bottomNavigationBar: AddCustomBottomNavigationBar(
        pushNext: ZiyaratAlimamAl3askari.screenRoute,
        pushBack: ZiyaratAl2imamAlmahdiAl2o5raAlsalisa.screenRoute,
        soud: '',
        onTap: (double fontSize) {
          // تحديث حجم الخط
          setState(() {
            isTablet ? _fontSizeTablet = fontSize : _fontSize = fontSize;
          });
          print('fontSize: $fontSize');
          // إغلاق Dialog
          Navigator.of(context).pop();
        },
        onLongPress: () {
          final snackBar = SnackBar(
            content: Center(
              child: Text(
                '${isTablet ? _fontSizeTablet.toInt() : _fontSize.toInt()}',
                style: TextStyle(
                  color: Colors.white,
                  fontSize: 16,
                ),
              ),
            ),
            width: 60,
            behavior: SnackBarBehavior.floating,
            backgroundColor: Colors.blue,
            duration: Duration(seconds: 2),
            shape: ShapeBorder.lerp(
              RoundedRectangleBorder(
                borderRadius: BorderRadius.circular(50),
              ),
              RoundedRectangleBorder(
                borderRadius: BorderRadius.circular(50),
              ),
              1,
            ),
          );
          ScaffoldMessenger.of(context).showSnackBar(snackBar);
        },
      ),
    );
  }
}
