import 'package:flutter/material.dart';
import 'package:maktabat_almoslim/widgets/container_scrollview.dart';
import 'package:provider/provider.dart';
import 'package:shared_preferences/shared_preferences.dart';

import '../../../../widgets/add_custom_bottom_navigation_bar.dart';
import '../../../../widgets/list_of_nine_verses.dart';
import '../../../favorites_provider.dart';
import '../../../favorites_screen.dart';
import '../ziyarat_2a2imat_sir.dart';
import 'ziyarat_al2imam_almahdi_almankoula.dart';
import 'ziyarat_al2imam_almahdi_alsalat_3alaih.dart';

class ZiyaratAl2imamAlmahdiAl2o5raAlsaniya extends StatefulWidget {
  static String screenRoute = 'ziyarat_al2imam_almahdi_al2o5ra_alsaniya_screen';
  const ZiyaratAl2imamAlmahdiAl2o5raAlsaniya({super.key});

  @override
  State<ZiyaratAl2imamAlmahdiAl2o5raAlsaniya> createState() =>
      _ZiyaratAl2imamAlmahdiAl2o5raAlsaniyaState();
}

double _fontSize = 18;
double _fontSizeTablet = 30;

class _ZiyaratAl2imamAlmahdiAl2o5raAlsaniyaState
    extends State<ZiyaratAl2imamAlmahdiAl2o5raAlsaniya> {
  bool isIcon = true;
  @override
  void initState() {
    super.initState();
    _loadFavoriteState();
  }

  Future<void> _loadFavoriteState() async {
    final prefs = await SharedPreferences.getInstance();
    bool? savedState = prefs
        .getBool('isFavorite_ziyarat_al2imam_almahdi_al2o5ra_alsaniya_screen');
    setState(() {
      isIcon = savedState ?? true;
    });
  }

  Future<void> _saveFavoriteState(bool value) async {
    final prefs = await SharedPreferences.getInstance();
    await prefs.setBool(
        'isFavorite_ziyarat_al2imam_almahdi_al2o5ra_alsaniya_screen', value);
  }

    Future<bool> _onWillPop() async {
    final args =
        ModalRoute.of(context)!.settings.arguments as Map<String, dynamic>?;
    final previousPage = args?['previousPage'];
    if (previousPage == 'favorite_screen') {
      Navigator.of(context).pushReplacementNamed(FavoritesScreen.screenRoute);
      return false;
    } else {
      Navigator.of(context).pushReplacementNamed(Ziyarat2a2imatSir.screenRoute);
      return false;
    }
  }

  @override
  Widget build(BuildContext context) {
    double size = MediaQuery.of(context).textScaleFactor;
    final screenWidth = MediaQuery.of(context).size.width;
    final isTablet = screenWidth >= 600;
    return WillPopScope(
      onWillPop: _onWillPop,
      child: Scaffold(
        appBar: AppBar(
          toolbarHeight: isTablet ? 100 : 50,
          centerTitle: true,
          leading: IconButton(
            onPressed: _onWillPop,
            icon: Icon(
              Icons.arrow_back,
              size: isTablet ? 50 : 25,
            ),
          ),
          actions: [
            IconButton(
              padding: EdgeInsets.only(left: isTablet ? 50 : 30),
              icon: Icon(
                isIcon ? Icons.favorite_border : Icons.favorite_rounded,
                size: isTablet ? 40 : 25,
                color: isIcon ? Colors.black : Colors.red,
              ),
              onPressed: () async {
                setState(() {
                  isIcon = !isIcon;
                });
                await _saveFavoriteState(isIcon);
      
                if (!isIcon) {
                  Provider.of<FavoritesProvider>(context, listen: false)
                      .addFavorite(
                          'زيارة الإمام المهدي (عليه السلام) - الزيارة الأخرى',
                          ZiyaratAl2imamAlmahdiAl2o5raAlsaniya.screenRoute);
                } else {
                  Provider.of<FavoritesProvider>(context, listen: false)
                      .removeFavorite(
                          'زيارة الإمام المهدي (عليه السلام) - الزيارة الأخرى',
                          ZiyaratAl2imamAlmahdiAl2o5raAlsaniya.screenRoute,
                          ZiyaratAl2imamAlmahdiAl2o5raAlsaniya.screenRoute);
                }
              },
            ),
          ],
          title: Text(
            'زيارة الإمام المهدي (عليه السلام) - الزيارة الأخرى',
            style: TextStyle(
              fontSize: isTablet
                  ? 40
                  : size > 1.0
                      ? 20
                      : 23,
              fontWeight: FontWeight.bold,
            ),
          ),
        ),
        body: ContainerScrollview(
          widget: Column(
            crossAxisAlignment: CrossAxisAlignment.start,
            children: [
              Container(
                child: Column(
                  children: [
                    Center(
                      child: Text(
                        'بسم الله الرحمن الرحيم',
                        style: TextStyle(
                          fontSize: isTablet ? _fontSizeTablet : _fontSize,
                          fontWeight: FontWeight.w900,
                        ),
                      ),
                    ),
                    Center(
                      child: Text(
                        'اللهم صلِّ على محمد وآل محمد',
                        style: TextStyle(
                          fontSize: isTablet ? _fontSizeTablet : _fontSize,
                          fontWeight: FontWeight.w900,
                        ),
                      ),
                    ),
                  ],
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: '',
                  subtitle:
                      'مارواه السيد ابن طاووس قال: صلّ ركعتين وقل بعدها: سَلامُ الله الكامِلُ التَّامُّ الشَّامِلُ …الخ. ونحن قد أثبتناها في الفصل السابع من الباب الأول تحت عنوان الاستغاثة به (عليه السلام) نقلاً عن كتاب (الكلم الطيب) فراجعها هناك (ص2266).\n\n'
                      'أقول: أفرد السيد ابن طاووس في كتاب (مصباح الزائر) فصلاً لاعمال السرداب المقدس فأثبت فيه ست زيارات ثم قال: ويلحق بهذا الفصل دعاء الندبة وما يزار به مولانا صاحب الأمر (عليه السلام) في كل يوم بعد فريضة الفجر وهي السابعة من الزيارات، ودعاء العهد الذي أُمرنا بتلاوته في زمان الغيبة ومايدعى به عند إرادة الخروج من ذلك الحرم الشّريف.\n\n'
                      'ثم بداً في ذكر هذه الامور الاربعة ونحن نتابعه في هذا الكتاب المبارك بذكر تلك الامور:الأمر الأول: دعاء الندبة ويستحب أن يدعى به في الاعياد الاربعة (أي عيد الفطر والاضحى والغدير ويوم الجمعة) وهو:[ الحَمدُ للهِ رَبِّ العالَمِينَ وَصَلّى الله عَلى سَيِّدِنا مُحَمَّدٍ نَبِيّهِ وَآلِهِ وَسَلَّمَ تَسليماً، اللّهُمَّ لَكَ الحَمدُ عَلى ماجَرى بِهِ قَضاؤُكَ فِي أَوْلِيائِكَ الَّذينَ اسْتَخْلَصْتَهُمْ لِنَفْسِكَ وَدِينِكَ إِذْ اخْتَرْتَ لَهُمْ جَزِيلَ ماعِنْدَكَ مِنَ النَّعيمِ المُقيمِ الَّذِي لا زَوالَ لَهُ وَلا اضْمِحْلالَ، بَعْدَ أَنْ شَرَطْتَ عَلَيْهِمُ الزُّهْدَ فِي دَرَجاتِ هذِهِ الدُّنيا الدَّنِيَّةِ وَزُخْرُفِها وَزِبْرجِها، فَشَرَطُوا لَكَ ذلِكَ وَعَلِمْتَ مِنْهُمُ الوَفاءَ بِهِ فَقَبِلْتَهُمْ وَقَرَّبْتَهُمْ وَقَدَّمْتَ لَهُمُ الذِّكْرَ العَلِيَّ وَالثَّناءَ الجَلِيَّ وَأَهْبَطْتَ عَلَيْهِمْ مَلائِكَتَكَ وَكَرَّمْتَهُم بِوَحْيِكَ '
                      'وَرَفَدْتَهُمْ بِعِلْمِكَ وَجَعَلْتَهُمُ الذَّرِيعَةَ إِلَيْكَ وَالوَسِيلَةَ إِلى رِضْوانِكَ فَبَعْضٌ أَسْكَنْتَهُ جَنَّتَكَ إِلى أَنْ أَخْرَجْتَهُ مِنها، وَبَعْضٌ حَمَلْتَهُ فِي فُلْكِكَ وَنَجَّيْتَهُ وَمَنْ آمَنَ مَعَهُ مِنَ الهَلَكَةِ بِرَحْمَتِكَ، وَبَعْضٌ اتَّخَذْتَهُ لِنَفْسِكَ خَلِيلاً وَسَأَلَكَ لِسانَ صِدْقٍ فِي الآخِرينَ فَأَجَبْتَهُ وَجَعَلْتَ ذلِكَ عَلِيّاً، وَبَعْضٌ كَلَّمْتَهُ مِنْ شَجَرَةٍ تَكْلِيماً وَجَعَلْتَ لَهُ مِنْ أَخِيهِ رِداً وَوَزِيراً، وَبَعْضٌ أَوْلَدْتَهُ مِنَ غَيْرِ أَبٍ وَآتَيْتَهُ البَيِّناتِ وَأيَّدْتَهُ بِرُوحِ القُدُسِ، وَكُلٌ شَرَعْتَ لَهُ شَرِيعَةً وَنَهَجْتَ لَهُ مِنْهاجاً وَتَخَيَّرْتَ لَهُ أَوْصِياء مُسْتَحْفِظاً بَعْدَ مُسْتَحْفِظٍ مِنْ مُدَّةٍ إِلى مُدَّةٍ إِقامَةً لِدِينِكَ وَحُجَّةً عَلى عِبادِكَ، وَلِئَلا يَزُولَ الحَقُّ عَنْ مَقَرِّهِ وَيَغْلِبَ الباطِلُ عَلى أَهْلِهِ وَلا يَقُولَ أَحَدٌ لَوْلا أَرْسَلْتَ إِلَيْنا رَسُولاً مُنْذِراً وَأَقَمْتَ لَنا عَلَماً هادِياً فَنَتَّبِعَ آياتِكَ مِنْ قَبْلِ أَنْ نَذِلَّ وَنَخْزى، إِلى أَنْ '
                      'إِنْتَهَيْتَ بِالأَمْرِ إِلى حَبِيبِكَ وَنَجِيبِكَ مُحَمَّدٍ صَلّى الله عَلَيْهِ وَآلِهِ فَكانَ كَما انْتَجَبْتَهُ سَيِّدَ مَنْ خَلَقْتَهُ وصَفْوَةَ مَنِ اصْطَفَيْتَهُ وَأَفْضَلَ مَنِ اجْتَبَيْتَهُ وَأَكْرَمَ مَنِ اعْتَمَدْتَهُ. قَدَّمْتَهُ عَلى أَنْبِيائِكَ وَبَعَثْتَهُ إِلى الثَّقَلَينِ مِنْ عِبادِكَ وَأَوْطأْتَهُ مَشارِقَكَ وَمَغارِبَكَ وَسَخَّرْتَ لَهُ البُراقَ وَعرَجْتَ بِرُوحِهِ إِلى سَمائِكَ وَأوْدَعْتَهُ عِلْمَ ماكانَ وَمايَكُونُ إِلى انْقَضاء خَلْقِكَ، ثُمَّ نَصَرْتَهُ بِالرُّعْبِ وَحَفَفْتَهُ بِجَبْرائِيلَ وَمِيكائِيلَ وَالمُسَوِّمِينَ مِن مَلائِكَتِكَ وَوَعَدْتَهُ أَنْ تُظْهِرَ دِينَهُ عَلى الدِّينِ كُلِّهِ وَلَوْ كَرِهَ المُشْرِكُونَ، وَذلِكَ بَعْدَ أَنْ بَوَّأْتَهُ مُبَوَّأَ صِدْقٍ مِنْ أَهْلِهِ وَجَعَلْتَ لَهُ وَلَهُمْ أَوَّلَ بَيْتٍ وَُضِعَ لِلنَّاسِ لَلَّذي بِبَكَّةَ مُبارَكاً وَهُدىً لِلْعالَمِينَ فِيهِ آياتٌ بَيِّناتٌ مَقامُ إِبْراهِيمَ وَمَنْ دَخَلَهُ كانَ آمِناً، وَقُلْتَ: إِنَّما يُرِيدُ الله لِيُذْهِبَ عَنْكُمُ الرِّجْسَ أَهْلَ البَيْتِ وَيُطَهِّرَكُمْ تَطْهِيراً. ثُمَّ جَعَلْتَ أَجْرَ مُحَمَّدٍ صَلَواتُكَ عَلَيْهِ وَآلِهِ '
                      'مَوَدَّتَهُمْ فِي كِتابِكَ فَقُلْتَ: قُلْ لا أَسْأَلُكُمْ عَلَيْهِ أَجْراً إِلاّ المَوَدَّةَ فِي القُرْبى، وَقُلْتَ: ماسَأَلْتُكُمْ مِنْ أجْرٍ فَهُو لَكُمْ، وَقُلْتَ: ماأسْأَلُكُمْ عَلَيْهِ مِنْ أَجْرٍ إِلاّ مَنْ شاءَ أنْ يَتَّخِذَ إِلى رَبِّهِ سَبِيلاً ؛ فَكانُوا هُمُ السَّبِيلَ إِلَيْكَ وَالمَسْلَكَ إِلى رِضْوانِكَ. فَلَمّا انْقَضَتْ أَيّامُهُ أَقامَ وَلِيَّهُ عَلِيَّ بْنَ أَبِي طالِبٍ صَلَواتُكَ عَلَيْهِما وَآلِهِما هادِياً إِذْ كانَ هُوَ المُنْذِرَ وَلِكُلِّ قَوْمٍ هادٍ، فَقالَ وَالمَلاَ أَمامَهُ: مَنْ كُنْتُ مَوْلاهُ فَعَلِيُّ مَوْلاهُ، اللّهُمَّ وَالِ مَنْ وَالاهُ وَعادِ مَنْ عاداهُ وَانْصُرْ مَنْ نَصَرَهُ وَاخْذُلْ مَنْ خَذَلَهُ، وَقالَ: مَنْ كُنْتُ أَنا نَبِيَّهُ فَعَلِيُّ أَمِيرُهُ، وَقَالَ: أَنَا وَعَلِيُّ مِنْ شَجَرَةٍ وَاحِدَةٍ وَسائِرُ النَّاسِ مِنْ شَجَرٍ شَتّى.\n\n'
                      'وَأَحَلَّهُ مَحلَّ هارُونَ مِنْ مُوسى فَقالَ لَهُ: أَنْتَ مِنِّي بِمَنْزِلَةِ هارُونَ مِنْ مُوسى إِلاّ أَنَّهُ لانَبِيَّ بَعْدِي، وَزَوَّجَهُ إِبْنَتَهُ سَيِّدَةَ نِساءِ العالَمِينَ، وَأحَلَّ لَهُ مِنْ مَسْجِدِهِ ما حَلَّ لَهُ، وَسَدَّ الابْوابَ إِلاّ بابَهُ ثُمَّ أَوْدَعَهُ عِلْمَهُ وَحِكْمَتَهُ فَقالَ: أَنَا مَدِينَةُ العِلْمِ وَعَلِيُّ بابُها فَمَنْ أَرادَ المَدِينَةَ وَالحِكْمَةَ فَلْيَأْتِها مِنْ بابِها. ثُمَ قالَ: أَنْتَ أَخِي وَوَصِيِّي وَوَارِثِي، لَحْمُكَ مِنْ لَحْمِي وَدَمُكَ مِنْ دَمِي وَسِلْمُكَ سِلْمِي وَحَرْبُكَ حَرْبِي، وَالإيْمانُ مُخالِطٌ لَحْمَكَ وَدَمَكَ كَما خالَطَ لَحْمِي وَدَمِي، وَأَنْتَ غَداً عَلى الحَوْضِ خَلِيفَتِي وَأَنْتَ تَقْضِي دَيْنِي وَتُنْجِزُ عِداتِي، وَشِيعَتُكَ عَلى مَنابِرَ مِنْ نُورٍ مُبْيَضَّةً وَُجُوهُهُمْ حَوْلِي فِي الجَنَّةِ وَهُمْ جِيرانِي، وَلَوْلا أَنْتَ ياعَلِيُّ لَمْ '
                      'يُعْرَفِ المُؤْمِنُونَ بَعْدِي. وَكانَ بَعْدَهُ هُدىً مِنَ الضَّلالِ وَنُوراً مِنَ العَمى وَحَبْلَ الله المَتِينَ وَصِراطَهُ المُسْتَقِيمَ لايُسْبَقُ بِقَرابَةٍ فِي رَحِمٍ وَلا بِسابِقَةٍ فِي دِينٍ وَلا يُلْحَقُ فِي مَنْقَبَةٍ مِنْ مَناقِبِهِ، يَحْذُو حَذْوَ الرَّسُولِ صَلّى الله عَلَيْهِما وَآلِهِما وَيُقاتِلُ عَلى التَأوِيلِ وَلا تَأخُذُهُ فِي الله لَوْمَةُ لائِمٍ ؛ قَدْ وَتَرَ فِيهِ صَناديدَ العَرَبِ وَقَتَلَ أَبْطالَهُمْ وَناوَشَ ذُؤْبانَهُمْ فَأَوْدَعَ قُلُوبَهُمْ أَحْقاداً بَدْرِيَّةً وَخَيْبَرِيَّةً وَحُنَيْنِيَّةً وَغَيْرَهُنَّ، فَأَضَبَّتْ عَلى عَداوَتِهِ وَأَكَبَّتْ عَلى مُنابَذَتِهِ حَتى قَتَلَ النَّاكِثِينَ وَالقاسِطِينَ وَالمارِقِينَ. وَلَمَّا قَضى نَحْبَهُ وَقَتَلَهُ أَشْقى الآخِرينَ يَتْبَعُ أَشْقَى الأوّلِينَ لَمْ يُمْتَثَلْ أَمْرُ رَسُولِ '
                      'الله صَلّى الله عَلَيْهِ وَآلِهِ فِي الهادِينَ بَعْدَ الهادِينَ، وَالاُمَّةُ مُصِرَّةٌ عَلى مَقْتِهِ مُجْتَمِعَةٌ عَلى قَطِيعَةِ رَحِمِهِ وَإِقْصاءِ وُلْدِهِ إِلاّ القَلِيلَ مِمَّنْ وَفى لِرِعايَةِ الحَقِّ فِيهِمْ، فَقُتِلَ مَنْ قُتِلَ وَسُبِيَ مَنْ سُبِيَ وَأُقْصِيَ مَنْ أُقْصِيَ وَجَرى القَضاء لَهُمْ بِما يُرْجى لَهُ حُسْنُ المَثُوبَةِ، إِذْ كانَتِ الارْضُ للهِ يُورِثُها مَنْ يَشاءُ مِنْ عِبادِهِ وَالعاقِبَةُ لِلْمُتَّقِينَ وَسُبْحانَ رَبِّنا إِنْ كانَ وَعْدُ رَبِّنا لَمَفْعُولاً وَلَنْ يُخْلِفَ الله وَعْدَهُ وَهُوَ العَزِيزُ الحَكِيمُ. فَعَلى الاطائِبِ مِنْ أَهْلِ بَيْتِ مُحَمَّدٍ وَعَلِيٍّ صَلّى الله عَلَيْهِما وَآلِهِما فَلْيَبْكِ الباكُونَ وَإِيّاهُمْ فَليَنْدُبِ النّادِبُونَ وَلِمِثْلِهِمْ فَلْتَذْرِفِ الدُّمُوعُ وَلِيَصْرُخِ الصارِخُونَ وَيَضِجَّ الضَّاجُّونَ وَيَعِجَّ العاجُّونَ ! أَيْنَ الحَسَنُ أَيْنَ الحُسَيْنُ أَيْنَ أَبْناءُ الحُسَيْنِ ؟ صالِحٌ بَعْدَ صالِحٍ وَصادِقٌ بَعْدَ صادِقٍ ! أَيْنَ السَّبِيلُ بَعْدَ السَّبِيلِ أَيْنَ الخِيَرَةُ بَعْدَ الخِيَرَةِ ؟ أَيْنَ الشُّمُوسُ الطَّالِعَةُ ؟ أَيْنَ الاَقْمارُ المُنِيرَةُ ؟ أَيْنَ الاَنْجُمُ الزّاهِرَةُ ؟ أَيْنَ أَعْلامُ الدِّينِ '
                      'وَقَواعِدُ العِلْمِ ؟ أَيْنَ بَقِيَّةُ الله الَّتِي لاتَخْلُو مِنَ العِتْرَةِ الهادِيَةِ ؟ أَيْنَ المُعَدُّ لِقَطْعِ دابِرِ الظَّلَمَةِ ؟ أَيْنَ المُنَتَظَرُ لاِقامَةِ الاَمْتِ وَالعِوَجِ ؟ أَيْنَ المُرْتَجى لاِزالَةِ الجَوْرِ وَالعُدْوانِ ؟ أَيْنَ المُدَّخَرُ لِتَجْدِيدِ الفَرائِضِ وَالسُّنَنِ ؟ أَيْنَ المُتَخَيَّرُ لاِعادَةِ المِلَّةِ وَالشَّرِيعَةِ ؟ أَيْنَ المُؤَمَّلُ لاِحْياءِ الكِتابِ وَحُدُودِهِ ؟ أَيْنَ مُحْيِي مَعالِمِ الدِّينِ وَأَهْلِهِ ؟ أَيْنَ قاصِمُ شَوْكَةِ المُعْتَدِينَ ؟ أَيْنَ هادِمُ أَبْنِيَةِ الشِرْكِ وَالنِّفاقِ ؟ أَيْنَ مُبِيدُ أَهْلِ الفُسُوقِ وَالعِصْيانِ وَالطُّغْيانِ ؟ أَيْنَ حاصِدُ فُروعِ '
                      'الغَيِّ وَالشِّقاقِ ؟ أَيْنَ طامِسُ آثارِ الزَّيْغ‌وَالاَهْواءِ؟ أَيْنَ قاطِعُ حَبائِلَ الكِذْبِ وَالاِفْتِراءِ ؟ أَيْنَ مُبِيدُ العُتاةِ وَالمَرَدَةِ ؟ أَيْنَ مُسْتَأصِلُ أَهْلِ العِنادِ وَالتَّضْلِيلِ وَالاِلحادِ ؟ أَيْنَ مُعِزُّ الأوْلِياء وَمُذِلُّ الأعداء ؟ أَيْنَ جامِعُ الكَلِمَةِ عَلى التَّقْوى ؟ أَيْنَ بابُ الله الَّذِي مِنْهُ يُؤْتى ؟ أَيْنَ وَجْهُ الله الَّذِي إِلَيْهِ يَتَوجَّهُ الأوْلِياء ؟ أَيْنَ السَّبَبُ المُتَّصِلُ بَيْنَ الاَرْضِ وَالسَّماء ؟ أَيْنَ صاحِبُ يَوْمِ الفَتْحِ وَناشِرُ رايَةِ الهُدى ؟ '
                      'أَيْنَ مُؤَلِّفُ شَمْلِ الصَّلاحِ وَالرِّضا ؟ أَيْنَ الطّالِبُ بِذُحُولِ الأَنْبِياءِ وَأَبْناءِ الأَنْبِياءِ ؟ أَيْنَ الطَّالِبُ بِدَمِ المَقْتُولِ بِكَرْبَلاَء ؟ أَيْنَ المَنْصُورُ عَلى مَنْ اعْتَدى عَلَيْهِ وَافْتَرى ؟ أَيْنَ المُضْطَرُّ الَّذِي يُجابُ إِذا دَعا ؟ أَيْنَ صَدْرُ الخَلائِقِ ذُو البِرِّ وَالتَّقْوى ؟ أَيْنَ ابْنُ النَّبِيِّ المُصْطَفى وَابْنُ عَلِيٍّ المُرْتَضى وَابْنُ خَدِيجَةَ الغَرَّاءِ وَابنُ فاطِمَةَ الكُبْرى ؟!\n\n'
                      'بِأَبِي أَنْتَ وَاُمِّي وَنَفْسِي لَكَ الوِقاءُ وَالحِمى يَابْنَ السّادَةِ المُقَرَّبِينَ يَابْنَ النُجباءِ الاَكْرَمِينَ يَابْنَ الهُداةِ المَهْدِيِّينَ يَابْنَ الخِيَرَةِ المُهَذَّبِينَ يَابْنَ الغَطارِفَةِ الاَنْجَبِينَ يَابْنَ الاَطائِبِ المُطَهَّرِينَ يَابْنَ الخَضارِمَةِ المُنْتَجَبِينَ يَابْنَ القَماقِمَةِ الاَكْرَمِينَ، يَابْنَ البُدُورِ المُنِيرَةِ يَابْنَ السُّرُجِ المُضِيئَةِ يَابْنَ الشُّهُبِ الثَّاقِبَةِ يَابْنَ الاَنْجُمِ الزَّاهِرَةِ يَابْنَ السُّبُلِ الواضِحَةِ يَابْنَ الاَعْلامِ اللائِحَةِ، يَابْنَ العُلُومِ الكامِلَةِ يَابْنَ السُّنَنِ المَشْهُورَةِ يَابْنَ المَعالِمِ المَأثُورَةِ يَابْنَ المُعْجِزاتِ المَوْجُودَةِ يَابْنَ الدَّلائِلِ المَشْهُودَةِ، يَابْنَ الصِّراطِ المُسْتَقِيمِ يَابْنَ النَّبَأ العَظِيمِ يَابْنَ مَنْ هُوَ فِي اُمِّ الكِتابِ '
                      'لَدَى الله عَلِيُّ حَكِيمٌ، يَابْنَ الاياتِ وَالبَيِّناتِ يَابْنَ الدَّلائِلِ الظّاهِراتِ يَابْنَ البَراهِينِ الواضِحاتِ الباهِراتِ يَابْنَ الحُجَجِ البالِغاتِ يَابْنَ النِّعَمِ السَّابِغاتِ يَابْنَ طهَ وَالمُحْكَماتِ يَابْنَ يسَّ وَالذّارِياتِ يَابْنَ الطُّورِ وَالعادِياتِ، يَابْنَ مَنْ دَنى فَتَدَلَّى فَكانَ قابَ قَوْسَيْنِ أَوْ أَدْنى دُنُواً وَاقْتِراباً مِنَ العَلِيِّ الاَعْلى ! لَيْتَ شِعْرِي ايْنَ اسْتَقَرَّتْ بِكَ النَّوى بَلْ أَيُّ أَرْضٍ تُقِلُّكَ أَوْ ثَرى ؟!\n\n'
                      'أَبِرَضْوى أَوْ غَيْرِها أَمْ ذِي طُوى ؟! عَزِيزٌ عَلَيَّ أَنْ أَرى الخَلْقَ وَلاتُرى وَلا أَسْمَعُ لَكَ حَسِيساً وَلا نَجْوى، عَزِيزٌ عَلَيَّ أَنْ تُحِيطَ بِكَ دُونِيَ البَلْوى وَلا يَنالُكَ مِنِّي ضَجِيجٌ وَلا شَكْوى. بِنَفْسِي أَنْتَ مِنْ مُغَيَّبٍ لَمْ يَخْلُ مِنّا بِنَفْسِي أَنْتَ مِنْ نازِحٍ مانَزَحَ عَنّا بِنَفْسِي أَنْتَ أُمْنِيَّةُ شائِقٍ يَتَمَنَّى مِنْ مُؤْمِنٍ وَمُؤْمِنَةٍ ذَكَراً فَحَنّا، بِنَفْسِي أَنْتَ مِنْ عَقِيدِ عِزٍّ لايُسامى بِنَفْسِي أَنْتَ مِنْ أَثِيلِ مَجْدٍ لايُجارى بِنَفْسِي أَنْتَ مِنْ تِلادِ نِعَمٍ لاتُضاهى بِنَفْسِي أَنْتَ مِنْ نَصِيفِ شَرَفٍ لايُساوى ! إِلى مَتى أُحارُ فِيكَ يامَوْلايَ وَإِلى مَتّى وَأَيُّ خِطابٍ أَصِفُ فِيكَ وَأيُّ نَجْوى ؟ عَزِيزٌ عَلَيَّ أَنْ اُجابَ دُونَكَ وَأُناغى عَزِيزٌ عَلَيَّ أَنْ أَبْكِيَكَ وَيَخْذُلَكَ الوَرى عَزِيزٌ عَلَيَّ أَنْ يَجْرِيَ عَلَيْكَ دُونَهُمْ ماجَرى، هَلْ مِن مُعينٍ فَأُطِيلَ مَعَهُ العَوِيلَ '
                      'وَالبُكاءَ هَلْ مِنْ جَزُوعٍ فَأُساعِدَ جَزَعَهُ إِذا خَلا هَلْ قَذِيَتْ عَينٌ فَساعَدَتْها عَيْنِي عَلَى القَذى هَلْ إِلَيْكَ يَابْنَ أَحْمَدَ سَبِ يلٌ فَتُلْقى هَلْ يَتَّصِلُ يَوْمُنا مِنْكَ بِعِدَةٍ فَنَحْظى ؟ مَتى نَرِدُ مَناهِلَكَ الرَّوِيَةَ فَنَرْوى مَتى نَنْتَقِعُ مِنْ عَذْبِ مائِكَ فَقَدْ طالَ الصَّدى مَتى نُغادِيكَ وَنُراوِحُكَ فَنُقِرُّ عَيْناً مَتى تَرانا وَنَراكَ وَقَدْ نَشَرْتَ لِواءَ النَّصْرِ؟ تُرى أَتَرانا نَحُفُّ بِكَ وَأَنْتَ تَؤُمُّ المَلاَ وَقَدْ مَلاْتَ الاَرْضَ عَدْلاً وَأَذَقْتَ أَعْدائَكَ هَواناً وَعِقاباً وَأَبَرْتَ العُتاةَ وَجَحَدةَ الحَقِّ وَقَطَعْتَ دابِرَ المُتَكَبِّرِينَ وَاجْتَثَثْتَ أُصُولَ الظَّالِمِينَ. وَنَحْنُ نَقُولُ: الحَمْدُ للهِ رَبِّ العالَمِينَ، اللّهُمَّ أَنْتَ كَشَّافُ الكُرَبِ وَالبَلْوى وَإِلَيْكَ أَسْتَعْدِي فَعِنْدَكَ العَدْوى وَأَنْتَ رَبُّ الآخِرةِ وَالدُّنْيا فَأَغِثْ ياغِياثَ المُسْتَغِيثِينَ عُبَيْدُكَ المُبْتَلى وَأَرِهِ سَيِّدَهُ ياشَدِيدَ القُوى وَأَزِلْ عَنْهُ بِهِ الاَسى وَالجَوى وَبَرِّدْ غَلِيلَهُ يَامَن عَلى العَرْشِ اسْتَوى '
                      'وَمَن إِلَيْهِ الرُّجْعى وَالمُنْتَهى، اللّهُمَّ وَنَحنُ عَبِيدُكَ التّائِقُونَ إِلى وَلِيِّكِ المُذَكِّرِ بِكَ وَبِنَبِيِّكَ خَلَقْتَهُ لَنا عِصْمَةً وَمَلاذاً وَأَقَمْتَهُ لَنا قِواماً وَمَعاذاً وَجَعَلْتَهُ لِلمُؤْمِنِينَ مِنّا إِماماً، فَبَلِّغْهُ مِنّا تَحِيَّةً وَسَلاماً وَزِدْنا بِذلِكَ يارَبِّ إِكْراماً وَاجْعَلْ مُسْتَقَرَّهُ لَنا مُسْتَقَرّاً وَمُقاماً وَأَتْمِمْ نِعْمَتَكَ بِتَقْدِيمِكَ إِيّاهُ أَمامَنا حَتى تُورِدَنا جِنانَكَ وَمُرافَقَةَ الشُّهَداء مِنْ خُلَصائِكَ، اللّهُمَّ صَلِّ عَلى مُحمَّدٍ وَآلِمُحَمَّدٍ وَصَلِّ عَلى مُحَمَّدٍ جَدِّهِ وَرَسُولِكَ السَّيِّدِ الاَكْبَرِ وَعَلى أَبِيهِ '
                      'السَّيِّدِ الاَصْغَرِ وَجَدَّتِهِ الصِّدِّيقَةِ الكُبْرى فاطِمَةَ بِنْتِ مُحَمَّدٍ صَلّى الله عَلَيْهِ وَآلِهِ، وَعَلى مَنْ اصْطَفَيْتَ مِن آبائِهِ البَرَرَةِ وَعَلَيْهِ أَفْضَلَ وَأَكْمَلَ وَأَتَمَّ وَأَدْوَمَ وَأَكْثَرَ وَأَوْفَرَ ماصَلَّيْتَ عَلى أَحَدٍ مِنْ أَصْفِيائِكَ وَخِيَرَتِكَ مِنْ خَلْقِكَ، وَصَلِّ عَلَيْهِ صَلاةً لاغايَةَ لِعَدَدِها وَلانِهايَةَ لِمَدَدِها وَلانَفادَ لاَمَدِها، اللّهُمَّ وَأَقِمْ بِهِ الحَقَّ وَأدْحِضْ بِهِ الباطِلَ وَأَدِلْ بِهِ أَوْلِيائَكَ وَأَذْلِلْ بِهِ أَعْدائَكَ، وَصِلِ اللّهُمَّ بَيْنَنا وَبَيْنَهُ وَُصْلَةً تُؤَدِّي إِلى مُرافَقَةِ سَلَفِهِ وَاجْعَلْنا مِمَّنْ يَأخُذُ بِحُجْزَتِهِمْ وَيَمْكُثُ فِي ظِلِّهِمْ وَأَعِنّا عَلى تَأدِيَةِ حُقُوقِهِ إِلَيْهِ وَالاجْتِهادِ فِي طاعَتِهِ وَاجتِنابِ مَعْصِيَتِهِ، وَامنُنْ عَلَيْنا بِرِضاهُ وَهَبْ لَنا رَأفَتَهُ وَرَحْمَتَهُ '
                      'وَدَعائَهُ وَخَيْرَهُ مانَنالُ بِهِ سَعَةً مِنْ رَحْمَتِكَ وَفَوْزاً عِنْدَكَ، وَاجْعَلْ صَلاتَنا بِهِ مَقْبُولَةً وَذُنُوبَنا بِهِ مَغْفُورَةً وَدُعائنا بِهِ مُسْتَجاباً وَاجْعَلْ أَرْزاقَنا بِهِ مَبْسُوطَةً وَهُمُومَنا بِهِ مَكَفِيَّةً وَحَوائِجَنا بِهِ مَقْضِيَّةً، وَأَقْبِلْ إِلَيْنا بِوَجْهِكَ الكَرِيمِ وَاقْبَلْ تَقَرُّبَنا إِلَيْكَ وَانْظُرْ إِلَيْنا نَظْرَةً رَحِيمَةً نَسْتَكْمِلُ بِها الكَرامَةَ عِنْدَكَ ثُمَّ لاتَصْرِفْها عَنا بِجُودِكَ، وَاسْقِنا مِنْ حَوضِ جَدِّهِ صَلَّى الله عَلَيْهِ وَآلِهِ بِكَأسِهِ وَبِيَدِهِ رَيّاً رَوِيّاً هَنِيئاً سائِغاً لاظَمأَ بَعْدَهُ ياأَرْحَمَ الرَّاحِمِينَ ].ثم صلّ صلاة الزيارة وقد تقدم وصفها، ثم تدعو بما أحببت فيجاب لك إن شاء الله تعالى.',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
            ],
          ),
        ),
        bottomNavigationBar: AddCustomBottomNavigationBar(
        pushNext: ZiyaratAl2imamAlmahdiAlsalat3alaih.screenRoute,
        pushBack: ZiyaratAl2imamAlmahdiAlmankoula.screenRoute,
        soud: 'https://cdn.jsdelivr.net/gh/SounaDiab/image_audio@master/audio/زيارة الامام المهدي الثانية.mp3',
        onTap: (double fontSize) {
          // تحديث حجم الخط
          setState(() {
            isTablet ? _fontSizeTablet = fontSize : _fontSize = fontSize;
          });
          print('fontSize: $fontSize');
          // إغلاق Dialog
          Navigator.of(context).pop();
        },
        onLongPress: () {
          final snackBar = SnackBar(
            content: Center(
              child: Text(
                '${isTablet ? _fontSizeTablet.toInt() : _fontSize.toInt()}',
                style: TextStyle(
                  color: Colors.white,
                  fontSize: 16,
                ),
              ),
            ),
            width: 60,
            behavior: SnackBarBehavior.floating,
            backgroundColor: Colors.blue,
            duration: Duration(seconds: 2),
            shape: ShapeBorder.lerp(
              RoundedRectangleBorder(
                borderRadius: BorderRadius.circular(50),
              ),
              RoundedRectangleBorder(
                borderRadius: BorderRadius.circular(50),
              ),
              1,
            ),
          );
          ScaffoldMessenger.of(context).showSnackBar(snackBar);
        },
      ),
      ),
    );
  }
}
