import 'package:flutter/material.dart';
import 'package:maktabat_almoslim/widgets/container_scrollview.dart';
import 'package:provider/provider.dart';
import 'package:shared_preferences/shared_preferences.dart';

import '../../../../widgets/add_custom_bottom_navigation_bar.dart';
import '../../../../widgets/list_of_nine_verses.dart';
import '../../../favorites_provider.dart';
import '../../../favorites_screen.dart';
import '../ziyarat_2a2imat_sir.dart';
import 'almakam_al2awal.dart';
import 'almakam_alsani.dart';

class ZiyaratAlimamAl3askari extends StatefulWidget {
  static String screenRoute = 'ziyarat_alimam_al3askari_screen';
  const ZiyaratAlimamAl3askari({super.key});

  @override
  State<ZiyaratAlimamAl3askari> createState() => _ZiyaratAlimamAl3askariState();
}

double _fontSize = 18;
double _fontSizeTablet = 30;

class _ZiyaratAlimamAl3askariState extends State<ZiyaratAlimamAl3askari> {
  bool isIcon = true;
  @override
  void initState() {
    super.initState();
    _loadFavoriteState();
  }

  Future<void> _loadFavoriteState() async {
    final prefs = await SharedPreferences.getInstance();
    bool? savedState =
        prefs.getBool('isFavorite_ziyarat_alimam_al3askari_screen');
    setState(() {
      isIcon = savedState ?? true;
    });
  }

  Future<void> _saveFavoriteState(bool value) async {
    final prefs = await SharedPreferences.getInstance();
    await prefs.setBool('isFavorite_ziyarat_alimam_al3askari_screen', value);
  }

  Future<bool> _onWillPop() async {
    final args =
        ModalRoute.of(context)!.settings.arguments as Map<String, dynamic>?;
    final previousPage = args?['previousPage'];
    if (previousPage == 'favorite_screen') {
      Navigator.of(context).pushReplacementNamed(FavoritesScreen.screenRoute);
      return false;
    } else {
      Navigator.of(context).pushReplacementNamed(Ziyarat2a2imatSir.screenRoute);
      return false;
    }
  }

  @override
  Widget build(BuildContext context) {
    double size = MediaQuery.of(context).textScaleFactor;
    final screenWidth = MediaQuery.of(context).size.width;
    final isTablet = screenWidth >= 600;
    return WillPopScope(
      onWillPop: _onWillPop,
      child: Scaffold(
        appBar: AppBar(
          toolbarHeight: isTablet ? 100 : 50,
          centerTitle: true,
          leading: IconButton(
            onPressed: _onWillPop,
            icon: Icon(
              Icons.arrow_back,
              size: isTablet ? 50 : 25,
            ),
          ),
          actions: [
            IconButton(
              padding: EdgeInsets.only(left: isTablet ? 50 : 30),
              icon: Icon(
                isIcon ? Icons.favorite_border : Icons.favorite_rounded,
                size: isTablet ? 40 : 25,
                color: isIcon ? Colors.black : Colors.red,
              ),
              onPressed: () async {
                setState(() {
                  isIcon = !isIcon;
                });
                await _saveFavoriteState(isIcon);

                if (!isIcon) {
                  Provider.of<FavoritesProvider>(context, listen: false)
                      .addFavorite('زيارة الإمام الحسن العسكري (عليه السلام)',
                          ZiyaratAlimamAl3askari.screenRoute);
                } else {
                  Provider.of<FavoritesProvider>(context, listen: false)
                      .removeFavorite(
                          'زيارة الإمام الحسن العسكري (عليه السلام)',
                          ZiyaratAlimamAl3askari.screenRoute,
                          ZiyaratAlimamAl3askari.screenRoute);
                }
              },
            ),
          ],
          title: Text(
            'زيارة الإمام الحسن العسكري (عليه السلام)',
            style: TextStyle(
              fontSize: isTablet
                  ? 40
                  : size > 1.0
                      ? 20
                      : 23,
              fontWeight: FontWeight.bold,
            ),
          ),
        ),
        body: ContainerScrollview(
          widget: Column(
            crossAxisAlignment: CrossAxisAlignment.start,
            children: [
              Container(
                child: Column(
                  children: [
                    Center(
                      child: Text(
                        'بسم الله الرحمن الرحيم',
                        style: TextStyle(
                          fontSize: isTablet ? _fontSizeTablet : _fontSize,
                          fontWeight: FontWeight.w900,
                        ),
                      ),
                    ),
                    Center(
                      child: Text(
                        'اللهم صلِّ على محمد وآل محمد',
                        style: TextStyle(
                          fontSize: isTablet ? _fontSizeTablet : _fontSize,
                          fontWeight: FontWeight.w900,
                        ),
                      ),
                    ),
                  ],
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: '',
                  subtitle:
                      'روى الشيخ بسند معتبر عنه (عليه السلام) قال: قبري بسر من رأى أمان لاهل الجانبين. وقد فسر المجلسي الأول كلمة أهل الجانبين بالشيعة وأهل السنّة وقال: إنّ فضله (عليه السلام) يعمّ الموالي والمعادي، كما إنّ قبر الكاظمين أمان لبغداد… الخ. وقال السيد ابن طاووس: إذا أردت زيارة أبي محمد الحسن العسكري (عليه السلام) فليكن بعد عمل جميع ماقدّمناه في زيارة أبيه الهادي (عليه السلام) ثم قف على ضريحه (عليه السلام) وقل:\n\n'
                      '[ السَّلامُ عَلَيْكَ يامَوْلايَ ياأَبا الحَسَنِ بْنَ عَلِيٍّ الهادِي المُهْتَدِي وَرَحْمَةُ الله وَبَرَكاتُهُ، السَّلامُ عَلَيْكَ ياوَلِيَّ الله وَابْنَ أَوْلِيائِهِ السَّلامُ عَلَيْكَ ياحُجَّةَ الله وابْنَ حُجَجِهِ السَّلامُ عَلَيْكَ ياصَفِيَّ الله وَابْنَ أَصْفِيائِهِ السَّلامُ عَلَيْكَ ياخَلِيفَةَ الله وَابْنَ خُلَفائِهِ وَأَبا خَلِيفَتِهِ، السَّلامُ عَلَيْكَ ياابْنَ خاتَمِ النَّبِيِّينَ السَّلامُ عَلَيْكَ ياابْنَ سَيِّدِ الوَصِيِّينَ السَّلامُ عَلَيْكَ ياابْنَ أَمِيرِ المُؤْمِنِينَ السَّلامُ عَلَيْكَ ياابْنَ سِّيَدِة نِساءِ العالَمِينَ السَّلامُ عَلَيْكَ ياابْنَ الأَئِمَّةِ الهادِينَ السَّلامُ عَلَيْكَ ياابْنَ الأَوْصِياء الرَّاشِدِينَ السَّلامُ عَلَيْكَ ياعِصْمَةَ المُتَّقِينَ السَّلامُ عَلَيْكَ ياإِمامَ الفائِزِينَ السَّلامُ عَلَيْكَ يارُكْنَ المُؤْمِنِينَ السَّلامُ عَلَيْكَ يافَرَجَ المَلْهُوفِينَ السَّلامُ عَلَيْكَ ياوارِثَ '
                      'الأَنْبِياءِ المُنْتَجَبِينَ، السَّلامُ عَلَيْكَ ياخازِنَ عِلْمِ وَصِيِّ رَسُولِ الله السَّلامُ عَلَيْكَ أَيُّها الدَّاعِي بِحُكْمِ الله السَّلامُ عَلَيْكَ أَيُّها النَّاطِقُ بِكِتابِ اللهِ، السَّلامُ عَلَيْكَ ياحُجَّةَ الحُجَجِ السَّلامُ عَلَيْكَ ياهادِيَ الاُمَمِ السَّلامُ عَلَيْكَ ياوَلِيَّ النِّعَمِ السَّلامُ عَلَيْكَ ياعَيْبَةَ العِلْمِ السَّلامُ عَلَيْكَ ياسَفِينَةَ الحِلْمِ السَّلامُ عَلَيْكَ ياأَبا الإمام المُنْتَظَرِ الظَّاهِرِ لِلعاقِلِ حُجَّتُهُ وَالثَّابِتَةِ فِي اليَّقِينِ مَعْرِفَتُهُ المُحْتَجَبِ عَنْ أَعْيُنِ الظَّالِمِينَ وَالمُغَيَّبِ عَنْ دَوْلَةِ الفاسِقِينَ وَالمُعِيدِ رَبُّنا بِهِ الإسلام جَدِيداً بَعْدَ الانْطِماسِ وَالقُرْآنِ غَضّا بَعْدَ الانْدِراسِ.\n\n'
                      'أَشْهَدُ يامَوْلايَ أَنَّكَ أَقَمْتَ الصَّلاةَ وَآتَيْتَ الزَّكاةَ وَأَمَرْتَ بِالمَعْرُوفِ وَنَهَيْتَ عَنِ المُنْكَرِ وَدَعَوْتَ إِلى سَبِيلِ رَبِّكَ بِالحِكْمَةِ وَالمَوْعِظَةِ الحَسَنَةِ وَعَبَدْتَ الله مُخْلِصاً حَتّى أَتاكَ اليَقِينُ، أَسْأَلُ الله بِالشَّأْنِ الَّذِي لَكُمْ عِنْدَهُ أَنْ يَتَقَبَّلَ زِيارَتِي لَكُمْ وَيَشْكُرَ سَعْيِي إِلَيْكُمْ وَيَسْتَجِيبَ دُعائِي بِكُمْ وَيَجْعَلَنِي مِنْ أَنْصارِ الحَقِّ وَأَتْباعِهِ وَأَشْياعِهِ وَمَوالِيهِ وَمُحِبِّيهِ وَالسَّلامُ عَلَيْكُمْ ورَحْمَةُ الله وَبَرَكاتُهُ ].\n\n'
                      'ثم قبل ضريحه وضع خدّك الايمن عليه ثم الايسر وقل:\n\n'
                      '[ اللّهُمَّ صَلِّ عَلى سَيِّدِنا مُحَمَّدٍ وَأَهْلِ بَيْتِهِ وَصَلِّ عَلى الحَسَنِ بْنَ عَلِيٍّ الهادِي إِلى دِينِكَ وَالدَّاعِي إِلى سَبِيلِكَ عَلَمِ الهُدى وَمَنارِ التُّقى وَمَعْدَنِ الحِجى وَمَأْوى النُّهى وَغَيْثِ الوَرى وَسَحابِ الحِكْمَةِ وَبَحْرِ المَوْعِظَةِ وَوارِثِ الأَئِمَّةِ وَالشَّهِيدِ عَلى الاُمَّةِ، المَعْصُومِ المُهَذَّبِ وَالفاضِلِ الُمَقَّربِ وَالمُطَهَّرِ مِنَ الرِّجْسِ الَّذِي وَرَّثْتَهُ عِلْمَ الكِتابِ وَأَلْهَمْتَهُ فَصْلَ الخِطابِ وَنَصَبْتَهُ عَلَما لاَهْلِ قِبْلَتِكَ وَقَرَنْتَ طاعَتَهُ بِطاعَتِكَ وَفَرَضْتَ مَوَدَّتَهُ عَلى جَمِيعِ خَلْقِكَ، '
                      'اللّهُمَّ فَكَما أَنابَ بِحُسْنِ الاِخْلاصِ فِي تَوْحِيدِكَ وَأَرْدى مِنْ خاضَ فِي تَشْبِيهِكَ وَحامى عَنْ أَهْلِ الإيْمانِ بِكَ ؛ فَصَلِّ يارَبِّ عَلَيْهِ صَلاةً يَلْحَقُ بِها مَحَلَّ الخاشِعِينَ وَيَعْلُو فِي الجَنَّةِ بِدَرَجَةِ جَدِّهِ خاتَمِ النَّبِيِّينَ وَبَلِّغْهُ مِنّا تَحِيَّةً وَسَلاماً، وَآتِنا مِنْ لَدُنْكَ فِي مُوالاتِهِ فَضْلاً وَإِحْساناً وَمَغْفِرَةً وَرِضْوانا إِنَّكَ ذُو فَضْلٍ عَظِيمٍ وَمَنٍّ جَسِيمٍ ].\n\n'
                      'ثم تصلي صلاة الزيارة فإذا فرغت قل:\n\n'
                      '[ يادائِمُ يادَيْمُومُ ياحَيُّ ياقَيُّومُ ياكاشِفَ الكَرْبِ وَالهَمِّ وَيافارِجَ الغَمِّ وَياباعِثَ الرُّسُلِ وَياصادِقَ الوَعْدِ وَياحَيُّ لا إِلهَ إِلاّ أَنْتَ، أَتَوَسَّلُ إِلَيْكَ بِحَبِيبِكَ مُحَمَّدٍ وَوَصِيِّهِ عَلِيٍّ ابْنِ عَمِّهِ وَصِهْرِهِ عَلى ابْنَتِهِ الَّذِي خَتَمْتَ بِهِما الشَّرائِعَ وَفَتَحْتَ بِهِما التَّأْوِيلَ وَالطَّلائِعَ فَصَلِّ عَلَيْهِما صَلاةً يَشْهَدُ بِها الأولونَ وَالآخِرُونَ وَيَنْجُو بِها الأوْلِياء وَالصَّالِحُونَ، '
                      'وَأَتَوَسَّلُ إِلَيْكَ بِفاطِمَةَ الزَّهْراءِ وَالِدَةِ الأَئِمَّةِ المَهْدِيِّينَ وَسَيِّدَةِ نِساءِ العالَمِينَ المُشَفَّعَةِ فِي شيعَةِ أَوْلادِها الطَّيِّبِينَ، فَصَلِّ عَلَيْها صَلاةً دائِمَةً أَبَدَ الابِدِينَ وَدَهْرَ الدَّاهِرِينَ، وَأَتَوَسَّلُ إِلَيْكَ بِالحَسَنِ الرَّضِيِّ الطَّاهِر الزَّكِيِّ وَالحُسَيْنِ المَظْلُومِ المَرْضِيِّ البَرِّ التَّقِيِّ سَيِّدَيْ شَبابِ أَهْلِ الجَنَّةِ الإماميْنِ الخَيِّرَيْنِ الطَّيِّبَيْنِ التَّقِيَّيْنِ النَّقِيَّيْنِ الطَّاهِرَيْنِ الشَّهِيدَيْنِ المَظْلُومَيْنِ المَقْتُولَيْنِ، فَصَلِّ عَلَيْهِما ما طَلَعَتْ شَمْسٌ وَما غَرَبَتْ صَلاةً مُتَوالِيَةً مُتَتالِيَةً وَأَتَوَسَّلُ إِلَيْكَ بِعَلِيٍّ بْنِ الحُسَيْنِ سَيِّدِ العابِدِينَ المَحْجُوبِ مِنْ خَوْفِ الظَّالِمِينَ وَبِمُحَمَّدِ بْنِ عَلِيٍّ الباقِرِ الطَّاهِرِ النُّورِ الزَّاهِرِ الإماميْنِ السَّيِّدَيْنِ مِفْتاحَي البَرَكاتِ وَمِصْباحَي الظُّلُماتِ، فَصَلِّ عَلَيْهِما ماسَرى لَيْلٌ وَما أضاءَ نَهارٌ صَلاةً تَغْدُو '
                      'وَتَرُوحُ، وَأَتَوَسَّلُ إِلَيْكَ بِجَعْفَرِ بْنِ مُحَمَّدٍ الصَّادِقِ عَنِ الله وَالنَّاطِقِ فِي عِلْمِ الله وَبِمُوسى بْنِ جَعْفَرٍ العَبْدِ الصَّالِحِ فِي نَفْسِهِ وَالوَصِيِّ النَّاصِحِ الإماميْنِ الهادِيَيْنِ المَهْدِيَّيْنِ الوافِيَيْنِ الكافِيَيْنِ، فَصَلِّ عَلَيْهِما ماسَبَّحَ لَكَ مَلَكٌ وَتَحَرَّكَ لَكَ فَلَكٌ صَلاةً تُنْمى وَتَزِيدُ وَلاتَفْنى وَلاتَبِيدُ، وَأَتَوَسَّلُ إِلَيْكَ بِعَلِيِّ بْنِ مُوسى الرِّضا وَبِمُحَمَّدِ بْنِ عَلِيٍّ المُرْتَضى الإماميْنِ المُطَهَّرَيْنِ المُنْتَجَبَيْنِ، فَصَلِّ عَلَيْهِما ماأَضاءَ صُبْحٌ وَدامَ صَلاةً تُرَقِّيهِما إِلى رِضْوانِكَ فِي العِلِّيِّينَ مِنْ جِنانِكَ، وَأَتَوَسَّلُ إِلَيْكَ بِعَلِيّ بْنِ مُحَمَّدٍ الرَّاشِدِ وَالحَسَنِ بْنِ عَلِيٍّ الهادِي القائِمَيْنِ بِأَمْرِ عِبادِكَ المُخْتَبَرَيْنِ بِالمِحَنِ الهائِلَةِ وَالصَّابِرَيْنِ فِي الاِحَنِ المائِلَةِ، فَصَلِّ عَلَيْهِما كِفاءَ أَجْرِ الصَّابِرِينَ '
                      'وَإزاءِ ثَوابِ الفائِزِينَ صَلاةً تُمَهِّدُ لَهُما الرِّفْعَةَ، وَأَتَوَسَّلُ إِلَيْكَ يارَبِّ بِإِمامِنا وَمُحَقِّقِ زَمانِنا اليَوْمِ المَوْعُودِ وَالشَّاهِدِ المَشْهُودِ وَالنُّورِ الاَزْهَرِ وَالضِّياءِ الاَنْوَرِ المَنْصُورِ بِالرُّعْبِ وَالمُظَفَّرِ بِالسَّعادَةِ، فَصَلِّ عَلَيْهِ عَدَدَ الثَّمَرِ وَأَوْراقِ الشَّجَرِ وَأَجْزاءِ المَدَرِ وَعَدَدَ الشَّعْرِ وَالوَبَرِ وَعَدَدَ ماأَحاطَ بِهِ عِلْمُكَ وَأَحْصاهُ كِتابُكَ صَلاةً يَغْبِطُهُ بِها الأوّلُونَ وَالآخِرُونَ، اللّهُمَّ وَاحْشُرْنا فِي زُمْرَتِهِ وَاحْفَظْنا عَلى طاعَتِهِ وَاحْرُسْنا بِدَوْلَتِهِ وَأَتْحِفْنا بِوِلايَتِهِ وَانْصُرْنا عَلى أَعْدائِنا بِعِزَّتِهِ وَاجْعَلْنا يارَبِّ مِنَ التَّوَّابِينَ ياأَرْحَمَ الرَّاحِمِينَ.\n\n'
                      'اللّهُمَّ وَإِنَّ إِبْلِيسَ المُتَمَرِّدَ اللّعِينَ قَدِ اسْتَنْظَرَكَ لاِغْواءِ خَلْقِكَ فَأنْظَرْتَهُ وَاسْتَمْهَلَكَ لاِضْلالِ عَبِيدَكَ، فَأَمْهَلْتَهُ بِسابِقِ عِلْمِكَ فِيهِ وَقَدْ عَشَّشَ وَكَثُرَتْ جُنُودُهُ وَازْدَحَمَتْ جُيُوشُهُ وَانْتَشَرَتْ دُعاتُهُ فِي أَقْطارِ الاَرْضِ، فَأَضَلُّوا عِبادَكَ وَأَفْسَدُوا دِينَكَ وَحَرَّفُوا الكَلِمَ عَنْ مَواضِعِهِ وَجَعَلُوا عِبادَكَ شِيَعاً مُتَفَرِّقِينَ وَأَحْزابا مُتَمَرِّدِينَ، وَقَدْ وَعَدْتَ نَقْضَ بُنْيانِهِ وَتَمْزِيقَ شَأْنِهِ فَأَهْلِكْ أَوْلادَهُ وَجُيُوشَهُ وَطَهِّرْ بِلادَكَ مِنْ اخْتِراعاتِهِ وَاخْتِلافاتِهِ وَأَرِحْ عِبادَكَ مِنْ مَذاهِبِهِ '
                      'وَقِياساتِهِ وَاجْعَلْ دائِرَةَ السُّوءِ عَلَيْهِمْ، وَابْسُطْ عَدْلَكَ وَأظْهِرْ دِينَكَ وَقَوِّ أَوْلِيائَكَ وَأَوْهِنْ أَعْدائَكَ وَأَوْرِثْ دِيارَ إِبْلِيسَ وَدِيارَ أَوْلِيائِهِ أَوْلِيائَكَ وَخَلِّدْهُمْ فِي الجَحِيمِ وَأَذِقْهُمْ مِنَ العَذابِ الاَلِيمِ، وَاجْعَلْ لَعائِنَكَ المُسْتَوْدَعَةَ فِي مَناحِسِ الخِلْقَةِ وَمَشاوِيهِ الفِطْرَةِ دائِرَةً عَلَيْهِمْ وَمُوَكَّلَةً بِهِمْ وَجارِيَةً فِيهِمْ كُلَّ صَباحٍ وَمَساءٍ وَغُدُوٍّ وَرَواحٍ، رَبَّنا آتِنا فِي الدُّنْيا حَسَنَةً وَفِي الآخِرةِ حَسَنَةً وَقِنا بِرَحْمَتِكَ عَذابَ النَّارِ ياأَرْحَمَ الرَّاحِمِينَ ]. ثم ادع بما تحبّ لنفسك ولاخوانك.\n\n'
                      'ثم تزور مليكة الدنيا والآخِرة أُمَّ القائم (عليه السلام) وقبرها خلف ضريح مولانا الحسن العسكري (عليه السلام) فتقول:\n\n'
                      '[ السَّلامُ عَلى رَسُولِ الله صَلّى الله عَلَيْهِ وَآلِهِ الصَّادِقِ الاَمِينِ السَّلامُ عَلى مَوْلانا أَمِيرِ المُوْمِنِينَ السَّلامُ عَلى الأَئِمَّةِ الطَّاهِرِينَ الحُجَجِ المَيامِينَ، السَّلامُ عَلى وَالِدَةِ الإمام وَالمُودَعَةِ أَسْرارَ المَلِكِ العَلامِ والحامِلَةِ لاَشْرَفِ الأنامِ، '
                      'السَّلامُ عَلَيْكِ أَيَّتُها الصِّدِّيقَةُ المَرْضِيَّةُ، السَّلامُ عَلَيْكِ ياشَبِيهَةَ أُمِّ مُوسى وَابْنَةَ حَوارِيَّ عِيسى السَّلامُ عَلَيْكِ أَيَّتُها التَّقِيَّةُ النَّقِيَّةُ السَّلامُ عَلَيْكِ أَيَّتُها الرَّضِيَّةُ المَرْضِيَّةُ السَّلامُ عَلَيْكِ أَيَّتُها المَنْعُوتَةُ فِي الاِنْجِيلِ المَخْطُوبَةُ مِنْ رُوحِ الله الاَمِينِ وَمَنْ رَغِبَ فِي وُصْلَتِها مُحَمَّدٌ سَيِّدُ المُرْسَلِينَ وَالمُسْتَوْدَعَةُ أَسْرارَ رَبِّ العالَمِينَ، السَّلامُ عَلَيْكِ وَعَلى آبائِكَ الحَوارِيِّينَ السَّلامُ عَلَيْكِ وَعَلى بَعْلِكِ وَوَلَدِكِ السَّلامُ عَلَيْكِ وَعَلى رُوحِكِ وَبَدَنِكِ الطَّاهِرِ. أَشْهَدُ أَنَّكِ أحْسَنْتِ الكَفالَةَ وَأَدَّيْتِ الاَمانَةَ وَاجْتَهَدْتِ فِي مَرْضاتِ الله وَصَبَرْتِ فِي ذاتِ الله وَحَفِظْتِ '
                      'سِرَّ الله وَحَمَلْتِ وَلِيَّ الله وَبالَغْتِ فِي حِفْظِ حُجَّةِ الله وَرَغِبْتِ فِي وُصْلَةِ أَبْناءِ رَسُولِ الله عارِفَةً بِحَقِّهِمْ مُؤْمِنَةً بِصِدْقِهِمْ مُعْتَرِفَةً بِمَنْزِلَتِهِمْ مُسْتَبْصِرَةً بِأَمْرِهِمْ مُشْفِقَةً عَلَيْهِمْ مُؤْثِرَةً هَواهُمْ، وَأَشْهَدُ أَنَّكِ مَضَيْتِ عَلى بَصِيرَةٍ مِنْ أَمْرِكِ مُقْتَدِيَةً بِالصّالِحِينَ راضِيَةً تَقِيَّةً نَقِيَّةً زَكِيَّةً فَرَضِيَ الله عَنْكِ وَأَرْضاكِ وَجَعَلَ الجَنَّةَ مَنْزِلَكِ وَمَأواكِ، فَلَقَدْ أَولاكِ مِنَ الخَيْراتِ ماأَوْلاكِ وَأَعْطاكِ مِنَ الشَّرَفِ ما بِهِ أَغْناكِ فَهَنَّأَكِ الله بِما مَنَحَكِ مِنَ الكَرامَةِ وَأَمْرَاكِ ].\n\n'
                      'ثم ترفع رأسك وتقول:\n\n'
                      '[ اللّهُمَّ إِيَّاكَ اعْتَمَدْتُ وَلِرِضاكَ طَلَبْتُ وَبِأَوْلِيائِكَ إِلَيْكَ تَوَسَّلْتُ وَعَلى غُفْرانِكَ وَحِلْمِكَ اتَّكَلْتُ وَبِكَ اعْتَصَمْتُ وَبِقَبْرِ أُمِّ وَلِيِّكَ لُذْتُ، فَصَلِّ عَلى مُحَمَّدٍ وَآلِ مُحَمَّدٍ وَانْفَعْنِي بِزِيارَتِها وَثَبِّتْنِي عَلى مَحَبَّتِها وَلاتَحْرِمْنِي شَفاعَتَها وَشَفاعَةَ وَلَدِها وَارْزُقْنِي مُرافَقَتَها وَاحْشُرْنِي مَعَها وَمَعَ وَلَدِها كَما وَفَّقْتَنِي لِزِيارَةِ وَلَدِها وَزِيارَتِها، اللّهُمَّ إِنِّي أَتَوَجَّهُ إِلَيْكَ بِالأَئِمَّةِ الطَّاهِرِينَ وَأَتَوَسَّلُ إِلَيْكَ بِالحُجَجِ المَيامِينِ مِنْ آلِ طهَ وَيَّس أَنْ تُصَلِّيَ عَلى مُحَمَّدٍ وَآلِ مُحَمَّدٍ الطَّيِّبِينَ، وَأَنْ تَجْعَلَنِي مِنَ المُطْمَئِنِّينَ الفائِزِينَ الفَرِحِينَ المُسْتَبْشِرِينَ الَّذِينَ لاخَوفٌ عَلَيْهُمْ وَلا هُمْ يَحْزَنُونَ، وَاجْعَلْنِي '
                      'مِمَّنْ قَبِلْتَ سَعْيَهُ وَيَسَّرْتَ أَمْرَهُ وَكَشَفْتَ ضُرَّهُ وَآمَنْتَ خَوْفَهُ، اللّهُمَّ بِحَقِّ مُحَمَّدٍ وَآلِ مُحَمَّدٍ صَلِّ عَلى مُحَمَّدٍ وَآلِ مُحَمَّدٍ وَلاتَجْعَلْهُ آخِرَ العَهْدِ مِنْ زِيارَتِي إِيَّاها، وَارْزُقْنِي العَوْدَ إِلَيْها أَبَداً ما أَبْقَيْتَنِي وَإِذا تَوَفَّيْتَنِي فَاحْشُرْنِي فِي زُمْرَتِها وَأَدْخِلْنِي فِي شَفاعَةِ وَلَدِها وَشَفاعَتِها، وَاغْفِرْ لِي وَلِوالِدَيَّ وَلِلْمُؤْمِنِينَ وَالمُوْمِناتِ وَآتِنا فِي الدُّنْيا حَسَنَةً وَفِي الآخِرةِ حَسَنَةً وَقِنا بِرَحْمَتِكَ عَذابَ النَّارِ وَالسَّلامُ عَلَيْكُمْ ياسادَتِي وَرَحْمَةُ الله وَبَرَكاتُهُ ].\n\n'
                      'أقول: روي عن زيد الشحام قال قلت للصادق (عليه السلام): ما لمن زار واحداً منكم ؟ قال: كمن زار رسول الله (صلّى الله عليه وآله وسلم). وقد أسلفنا الرواية عن الصادق (عليه السلام) قال: من زار إماما مفترض الطاعة وصلّى عنده أربع ركعات كتبت له حجّة وعمرة.\n\n'
                      'وقد ذكرنا في كتاب (هدية الزائر) فضائل حكيمة بنت الإمام محمد التقي (عليه السلام) وقبرها الشريف مما يلي رجلي العسكريِّيْن (عليه السلام) متصل بضريحهما. وقلنا هناك إنّ كتب الزيارة لم تخصها بزيارة خاصة مع مالها من رفيع المنزلة فينبغي أن تزار بالزيارة العامة لاولاد الأئمة (عليهم السلام) أو تزار بما ورد لزيارة عمّتها الكريمة فاطمة بنت موسى (عليه السلام) بان تستقبل القبلة وتقول:\n\n'
                      '[ السَّلامُ عَلَى آدَمَ صَفْوَةِ اللهِ، السَّلامُ عَلَى نُوحٍ نَبِيِّ الله السَّلامُ عَلَى إِبْراهِيمَ خَلِيلِ الله السَّلامُ عَلَى مُوسى كَلِيمِ الله السَّلامُ عَلَى عِيسى رُوحِ اللهِ، السَّلامُ عَلَيْكَ يارَسُولَ الله السَّلامُ عَلَيْكَ ياخَيْرَ خَلْقِ اللهِ السَّلامُ عَلَيْكَ ياصَفِيَّ الله السَّلامُ عَلَيْكَ يامُحَمَّد بْنَ عَبْدِ الله خاتَمِ النَّبِيِّينَ، السَّلامُ عَلَيْكَ ياأَمِيرَ المُؤْمِنِينَ عَلِيَّ بْنَ أَبِي طالِبٍ وَصِيَّ رَسُولِ الله السَّلامُ عَلَيْكِ يافاطِمَةُ سَيِّدَةَ نِساءِ العالَمِينَ، السَّلامُ عَلَيْكُما ياسِبْطَي الرَّحْمَةِ وَسَيِّدَيْ شَبابِ أَهْلِ الجَنَّةِ السَّلامُ عَلَيْكَ ياعَلِيَّ بْنَ '
                      'الحُسَيْنِ سَيِّدَ العابِدِينَ وَقُرَّةَ عَيْنِ النَّاظِرِينَ السَّلامُ عَلَيْكَ يامُحَمَّدَ بْنَ عَلِيٍّ باقِرَ العِلْمِ بَعْدَ النَّبِيِّ السَّلامُ عَلَيْكَ ياجَعْفَرَ بْنَ مُحَمَّدٍ الصَّادِقَ البارَّ الاَمِينَ السَّلامُ عَلَيْكَ يامُوسى بْنَ جَعْفَرٍ الطَّاهِرَ الطُّهْرَ السَّلامُ عَلَيْكَ ياعَلِيَّ بْنَ مُوسى الرِّضا المُرْتَضى السَّلامُ عَلَيْكَ يامُحَمَّدَ بْنَ عَلِيِّ التَّقِيَّ السَّلامُ عَلَيْكَ ياعَلِيَّ بْنَ مُحَمَّدٍ النَّقِيَّ النَّاصِحَ الاَمِينَ السَّلامُ عَلَيْكَ ياحَسَنَ بْنَ عَلِيٍّ السَّلامُ عَلى الوَصِيِّ مِنْ بَعْدِهِ، اللّهُمَّ صَلِّ عَلى نُورِكَ وَسِراجِكَ وَوَلِيِّ وَلِيِّكَ وَوَصِيِّ وَصِيِّكَ وَحُجَّتِكَ عَلى خَلْقِكَ. السَّلامُ عَلَيْكِ يابِنْتَ رَسُولِ الله السَّلامُ عَلَيْكِ يابِنْتَ فاطِمَةَ وَخَدِيجَةَ السَّلامُ عَلَيْكِ يابِنْتَ أَمِيرِ المُوْمِنِينَ السَّلامُ عَلَيْكِ يابِنْتَ الحَسَنِ '
                      'وَالحُسَيْنِ السَّلامُ عَلَيْكِ يابِنْتَ وَلِيِّ الله السَّلامُ عَلَيْكِ يااُخْتَ وَلِيِّ الله السَّلامُ عَلَيْكِ ياعَمَّةَ وَلِيِّ الله السَّلامُ عَلَيْكِ يابِنْتَ مُحَمَّدٍ بْنَ عَلِيٍّ التَّقِيِّ وَرَحْمَةُ الله وَبَرَكاتُهُ. السَّلامُ عَلَيْكِ عَرَّفَ الله بَيْنَنا وَبَيْنَكُمْ فِي الجَنَّةِ وَحَشَرَنا فِي زُمْرَتِكُمْ وَأَوْرَدَنا حَوْضَ نَبِيِّكُمْ وَسَقانا بِكَأْسِ جَدِّكُمْ مِنْ يَدِ عَلِيِّ بْنِ أَبِي طالِبٍ صَلَواتُ الله عَلَيْكُمْ، أَسْأَلُ الله أَنْ يُرِينا فِيكُمُ السُّرُورَ وَالفَرَجَ وَأَنْ يَجْمَعَنا وَإِيَّاكُمْ فِي زُمْرَةِ جَدِّكُمْ مُحَمَّدٍ صَلّى الله عَلَيْهِ وَآلِهِ وَأَنْ لايَسْلُبَنا مَعْرِفَتَكُمْ إِنَّهُ وَلِيُّ قَدِيرٌ، أَتَقَرَّبُ إِلى الله بِحُبِّكُمْ وَالبَرائةِ مِنْ أَعْدائِكُمْ وَالتَّسْلِيمِ إِلى الله راضِياً بِهِ غَيْرَ مُنْكِرٍ وَلامُسْتَكْبِرٍ، وَعَلى يَقِينٍ ماأَتى بِهِ مُحَمَّدٌ وَبِهِ راضٍ نَطْلُبُ بِذلِكَ وَجْهَكَ '
                      'ياسَيِّدِي اللّهُمَّ وَرِضاكَ وَالدَّارَ الآخِرةَ. ياحَكِيمَةُ اشْفَعِي لِي فِي الجَنَّةِ فَإِنَّ لَكِ عِنْدَ الله شَأْنا مِنَ الشَّأْنِ، اللّهُمَّ إِنِّي أَسْأَلُكَ أَنْ تَخْتِمَ لِي بِالسَّعادَةِ فَلا تَسْلُبْ مِنِّي ما أَنا فِيهِ وَلاحَوْلَ وَلاقُوَّةَ إِلاّ بِالله العَلِيِّ العَظِيمِ، اللّهُمَّ اسْتَجِبْ لَنا وَتَقَبَّلْهُ بِكَرَمِكَ وَعِزَّتِكَ وَبِرَحْمَتِكَ وَعافِيَتِكَ وَصَلّى الله عَلى مُحَمَّدٍ وَآلِهِ أَجْمَعِينَ وَسَلَّمَ تَسْلِيماً ياأَرْحَمَ الرَّاحِمِينَ ].\n\n'
                      'أقول: عند قبر العسكريِّيْن (عليهما السلام) على المشهور قبور عصبة من السادة العظام منهم حسين ابن الإمام علي النقي (عليه السلام) وإني لم أقف على حال الحسين هذا وقوفاً، ويبدو لي أنّه من أعاظم السادة وأجلائهم فقد استفدت من بعض الاحاديث أنه كان يعبر عن مولانا الإمام الحسن العسكري (عليه السلام) وأخيه الحسين هذا بالسِّبطين تشبيها لهما بسبطي نبيِّ الرحمة جدَّيهما الإمامين الحسن والحسين (عليهم السلام).\n\n'
                      'وقد ورد في حديث أبي الطيب أن صوت الحجة (صَلَوات الله عَليه ) كان يشبه صوت الحسين(عليه السلام).\n\n'
                      'والفقيه المحدّث الحكيم السيد أحمد الاردكاني اليزدي قال في كتاب (شجرة الأولياء) عند ذكره أولاد الإمام علي النقي (عليه السلام): إن ابنه الحسين كان من الزُهّاد والعُبّاد وكان يقر لاخيه بالإمامة ولعل المتتبع البصير يعثر على غير ماوقفنا عليه ممّا يومي إلى فضله وجلاله.\n\n'
                      'واعلم أيضاً أنّ للسيد محمد بن الإمام علي النقي (عليه السلام) مزار مشهور قرب قرية (البلد) وهو معروف بالفضل والجلال وبما يبديه من الكرامات الخارقة للعادات، ويتشرف بزيارته عامة الخلائق ينذرون له النذور ويهدون إليه الهدايا الكثيرة ويسألون عنده حوائجهم. والعرب في تلك المنطقة تهابه وتخشاه وتحسب له الحساب. وقد برز منه كما يحكى كرامات كثيرة لايسع المقام ذكرها ويكفيه فضلاً وشرفاً أنّه كان أهلا للإمامة وكان أكبر أولاد الإمام الهادي (عليه السلام) وقد شق جيبه في عزائه الإمام الحسن العسكري (عليه السلام).\n\n'
                      'وكان شيخنا ثقة الإسلام النوري نور الله مرقده يعتقد في زيارته اعتقاداً راسخاً وهو قد سعى لتعمير بقعته الشريفة وضريحه وكتب على ضريحه الشريف هذا مرقد السيد الجليل أبي جعفر محمد إبن الإمام أبي الحسن علي الهادي (عليه السلام) عظيم الشأن جليل القدر وكانت الشيعة تزعم أنّه الإمام بعد أبيه (عليه السلام) فلمّا توفى نصّ أبوه على أخيه أبي محمد الزّكي (عليه السلام) وقال له: أحدث للهِ شكراً فقد أحدث فيك أمراً.\n\n'
                      'خلّفه أبوه في المدينة طفلاً وقدم عليه في سامراء مشتداً ونهض إلى الرجوع إلى الحجاز ولما بلغ (بلد) على تسعة فراسخ مرض وتوفى ومشهده هناك. ولما توفي شق أبو محمد (عليه السلام) عليه ثوبه وقال في جواب من عابه عليه: قد شق موسى على أخيه هارون، وكانت وفاته في حدود اثنين وخمسين بعد المائتين.\n\n'
                      'وعلى أيّ حال فإذا شئت أن تودع العسكريِّيْن (عليهما السلام) فقفعلى القبر الطاهر وقل:\n\n'
                      '[ السَّلامُ عَلَيْكُما ياوَلِيَّي الله اسْتَوْدِعُكُما الله وَأقْرَأُ عَلَيْكُما السَّلامُ، آمَنَّا بِالله وَبِالرَّسُولِ وَبِما جِئْتُما بِهِ وَدَلَلْتُما عَلَيْهِ، اللّهُمَّ اكْتُبْنا مَعَ الشَّاهِدِينَ اللّهُمَّ لاتَجْعَلْهُ آخِرَ العَهْدِ مِنْ زِيارَتِي إِيّاهُما وَارْزُقْنِي العَوْدَ إِلَيْهِما وَاحْشُرْنِي مَعَهُما وَمَعَ آبائِهِما الطَّاهِرِينَ وَالقائِمِ الحُجَّةِ مِنْ ذُرِّيَّتِهِما ياأَرْحَمَ الرَّاحِمِينَ.',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
            ],
          ),
        ),
        bottomNavigationBar: AddCustomBottomNavigationBar(
        pushNext: AlmakamAlsani.screenRoute,
        pushBack: AlmakamAl2awal.screenRoute,
        soud: 'https://cdn.jsdelivr.net/gh/SounaDiab/image_audio@master/audio/زيارة الامام العسكري.mp3',
        onTap: (double fontSize) {
          // تحديث حجم الخط
          setState(() {
            isTablet ? _fontSizeTablet = fontSize : _fontSize = fontSize;
          });
          print('fontSize: $fontSize');
          // إغلاق Dialog
          Navigator.of(context).pop();
        },
        onLongPress: () {
          final snackBar = SnackBar(
            content: Center(
              child: Text(
                '${isTablet ? _fontSizeTablet.toInt() : _fontSize.toInt()}',
                style: TextStyle(
                  color: Colors.white,
                  fontSize: 16,
                ),
              ),
            ),
            width: 60,
            behavior: SnackBarBehavior.floating,
            backgroundColor: Colors.blue,
            duration: Duration(seconds: 2),
            shape: ShapeBorder.lerp(
              RoundedRectangleBorder(
                borderRadius: BorderRadius.circular(50),
              ),
              RoundedRectangleBorder(
                borderRadius: BorderRadius.circular(50),
              ),
              1,
            ),
          );
          ScaffoldMessenger.of(context).showSnackBar(snackBar);
        },
      ),
      ),
    );
  }
}
