import 'package:flutter/material.dart';
import 'package:maktabat_almoslim/widgets/container_scrollview.dart';
import 'package:provider/provider.dart';
import 'package:shared_preferences/shared_preferences.dart';

import '../../../../widgets/add_custom_bottom_navigation_bar.dart';
import '../../../../widgets/list_of_nine_verses.dart';
import '../../../favorites_provider.dart';
import '../../../favorites_screen.dart';
import '../rajab.dart';
import 'alyawm_al5ames_wal3ishroun.dart';
import 'lailat_alnisf_men_rajab.dart';

class YawmAlnisfMenRajab extends StatefulWidget {
  static String screenRoute = 'yawm_alnisf_men_rajab_screen';
  const YawmAlnisfMenRajab({super.key});

  @override
  State<YawmAlnisfMenRajab> createState() => _YawmAlnisfMenRajabState();
}

double _fontSize = 18;
double _fontSizeTablet = 30;

class _YawmAlnisfMenRajabState extends State<YawmAlnisfMenRajab> {
  bool isIcon = true;
  @override
  void initState() {
    super.initState();
    _loadFavoriteState();
  }

  Future<void> _loadFavoriteState() async {
    final prefs = await SharedPreferences.getInstance();
    bool? savedState = prefs.getBool('isFavorite_yawm_alnisf_men_rajab_screen');
    setState(() {
      isIcon = savedState ?? true;
    });
  }

  Future<void> _saveFavoriteState(bool value) async {
    final prefs = await SharedPreferences.getInstance();
    await prefs.setBool('isFavorite_yawm_alnisf_men_rajab_screen', value);
  }

  Future<bool> _onWillPop() async {
    final args =
        ModalRoute.of(context)!.settings.arguments as Map<String, dynamic>?;
    final previousPage = args?['previousPage'];
    if (previousPage == 'favorite_screen') {
      Navigator.of(context).pushReplacementNamed(FavoritesScreen.screenRoute);
      return false;
    } else {
      Navigator.of(context).pushReplacementNamed(Rajab.screenRoute);
      return false;
    }
  }

  @override
  Widget build(BuildContext context) {
    double size = MediaQuery.of(context).textScaleFactor;
    final screenWidth = MediaQuery.of(context).size.width;
    final isTablet = screenWidth >= 600;
    return WillPopScope(
      onWillPop: _onWillPop,
      child: Scaffold(
        appBar: AppBar(
          toolbarHeight: isTablet ? 100 : 50,
          centerTitle: true,
          leading: IconButton(
            onPressed: _onWillPop,
            icon: Icon(
              Icons.arrow_back,
              size: isTablet ? 50 : 25,
            ),
          ),
          actions: [
            IconButton(
              padding: EdgeInsets.only(left: isTablet ? 50 : 30),
              icon: Icon(
                isIcon ? Icons.favorite_border : Icons.favorite_rounded,
                size: isTablet ? 40 : 25,
                color: isIcon ? Colors.black : Colors.red,
              ),
              onPressed: () async {
                setState(() {
                  isIcon = !isIcon;
                });
                await _saveFavoriteState(isIcon);

                if (!isIcon) {
                  Provider.of<FavoritesProvider>(context, listen: false)
                      .addFavorite(
                          'يوم النصف من رجب', YawmAlnisfMenRajab.screenRoute);
                } else {
                  Provider.of<FavoritesProvider>(context, listen: false)
                      .removeFavorite(
                          'يوم النصف من رجب',
                          YawmAlnisfMenRajab.screenRoute,
                          YawmAlnisfMenRajab.screenRoute);
                }
              },
            ),
          ],
          title: Text(
            'يوم النصف من رجب',
            style: TextStyle(
              fontSize: isTablet
                  ? 40
                  : size > 1.0
                      ? 20
                      : 23,
              fontWeight: FontWeight.bold,
            ),
          ),
        ),
        body: ContainerScrollview(
          widget: Column(
            crossAxisAlignment: CrossAxisAlignment.start,
            children: [
              Container(
                child: Column(
                  children: [
                    Center(
                      child: Text(
                        'بسم الله الرحمن الرحيم',
                        style: TextStyle(
                          fontSize: isTablet ? _fontSizeTablet : _fontSize,
                          fontWeight: FontWeight.w900,
                        ),
                      ),
                    ),
                    Center(
                      child: Text(
                        'اللهم صلِّ على محمد وآل محمد',
                        style: TextStyle(
                          fontSize: isTablet ? _fontSizeTablet : _fontSize,
                          fontWeight: FontWeight.w900,
                        ),
                      ),
                    ),
                  ],
                ),
              ),
              Container(
                padding: EdgeInsets.all(20),
                child: Text(
                  'وهو يوم مبارك وفيه أعمال :',
                  style: TextStyle(
                    fontWeight: FontWeight.w900,
                    fontSize: isTablet ? _fontSizeTablet + 4 : _fontSize - 1,
                    color: const Color.fromARGB(255, 17, 126, 20),
                  ),
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: 'الاوّل :',
                  subtitle: 'الغُسل.',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: 'الثّاني :',
                  subtitle:
                      'زيارة الحسين (عليه السلام) فعن ابن أبي نصر انّه قال : سألت أبا الحسن الرّضا (عليه السلام)؟ في أيّ شهر نزور الحسين (عليه السلام)قال : في النّصف من رجب، والنّصف من شعبان.',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: 'الثّالث :',
                  subtitle: 'صلاة سلمان على نحو ما مرّ في اليوم الاوّل.',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: 'الرّابع :',
                  subtitle: 'أن يصلّي أربع ركعات فاذا سلّم بسط يده وقال :\n\n'
                      'اَللّـهُمَّ يا مُذِلَّ كُلِّ جَبّار، وَيا مُعِزَّ الْمُؤْمِنينَ، اَنْتَ كَهْفي حينَ تُعْيينِى الْمَذاهِبُ، وَاَنْتَ بارِئُ خَلْقي رَحْمَةً بي وَقَدْ كُنْتَ عَنْ خَلْقي غَنِيّاً، وَلَوْلا رَحْمَتُكَ لَكُنْتُ مِنَ الْهالِكينَ، وَاَنْتَ مُؤَيِّدي بِالنَّصْرِ عَلى اَعْدائي وَلَوْلا نَصْرُكَ اِيّايَ لَكُنْتُ مِنَ الْمَفْضُوحينَ، يا مُرْسِلَ الرَّحْمَةِ مِنْ مَعادِنِها، وَمُنْشِىءَ الْبَرَكَةِ مِنْ مَواضِعِها، يا مَنْ خَصَّ نَفْسَهُ بِالشُّمُوخِ وَالرِّفْعَةِ، فَاَوْلِياؤُهُ بِعِزِّهِ يَتَعَزَّزُونَ، وَيا مَنْ وَضَعَتْ لَهُ الْمُلُوكِ نيرَ الْمَذَلَّةِ عَلى اَعْناقِهِمْ، فَهُمْ مِنْ سَطَواتِهِ خائِفُونَ، اَساَلُكَ بِكَيْنُونِيَّتِكَ الَّتِي اشْتَقَقْتَها مِنْ كِبْرِيائِكَ، وَاَساَلُكَ بِكِبْرِيائِكَ الَّتِى اشْتَقَقْتَها مِنْ عِزَّتِكَ، وَاَساَلُكَ بِعِزَّتِكَ الَّتِي اسْتَوَيْتَ بِها عَلى عَرْشِكَ فَخَلَقْتَ بِها جَميعَ خَلْقِكَ فَهُمْ لَكَ مُذْعِنُونَ اَنْ تُصَلِّيَ عَلى مُحَمَّد وَاَهْلِ بَيْتِهِ.',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
              Container(
                padding: EdgeInsets.all(20),
                child: Text(
                  'وفي الحديث ما دعا بهذا الدّعاء مكروب الّا نفّس الله كُربته.',
                  style: TextStyle(
                    fontWeight: FontWeight.w900,
                    fontSize: isTablet ? _fontSizeTablet + 4 : _fontSize - 1,
                    color: const Color.fromARGB(255, 17, 126, 20),
                  ),
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: 'الخامس :',
                  subtitle:
                      'دعاء أمّ داوُد وهو اهمّ أعمال هذا اليوم ومن آثاره قضاء الحوائج وكشف الكروب ودفع ظُلم الظالمين، وصفته على ما أورده الشّيخ في المصباح هي انّ من أراد ذلك فليصم اليوم الثّالث عشر والرّابع عشر والخامس عشر : فاذا كان عند الزّوال من اليوم الخامس عشر اغتسل، فاذا زالت الشّمس صلّى الظّهر والعصر يحسن ركوعهما وسجُودهما، وليكن في موضع خال لا يشغله شاغل، ولا يكلّمه انسان، فاذا فرغ من الصّلاة استقبل القبلة وقرأ الحمد مائة مرّة، والاخلاص مائة مرّة، وآية الكرسي عشر مرّات، ثمّ يقرأ بعد ذلك سُورة الانعام، وبني اسرائيل، والكهف، ولقمان، ويس، والصّافات، وحم، السّجدة وحم، عسق وحم، الدّخان، والفتح، والواقعة، والملك، ون، و (اذا السّماء انشقّت)، وما بعدها الى آخر القرآن، فاذا فرغ من ذلك قال وهو مستقبل القبلة:\n\n'
                      'صَدَقَ اللهُ الْعَظيمُ الَّذي لا اِلـهَ إِلاّ هُوَ الْحَيُّ الْقَيُّومُ، ذُو الْجَلالِ وَالاِْكْرامِ، الرَّحْمنُ الرَّحيمُ، الْحَليمُ الْكَريمُ، الَّذي لَيْسَ كَمِثْلِهِ شَيْءٌ وَهُوَ السَّميعُ الْعَليمُ الْبَصيرُ الْخَبيرُ، شَهِدَ اللهُ اَنَّهُ لا اِلـهَ إِلاّ هُوَ وَالْمَلائِكَةُ وَاُولُو الْعِلْمِ قائِماً بِالْقِسْطِ لا اِلـهَ إِلاّ هُوَ الْعَزيزُ الْحَكيمُ، وَبَلَّغَتْ رُسُلُهُ الْكِرامُ وَاَنَا عَلى ذلِكَ مِنَ الشّاهِدينَ، اَللّـهُمَّ لَكَ الْحَمْدُ، وَلَكَ الَْمجْدُ، وَلَكَ الْعِزُّ، وَلَكَ الْفَخْرُ، وَلَكَ الْقَهْرُ، وَلَكَ النِّعْمَةُ، وَلَكَ الْعَظَمَةُ، وَلَكَ الرَّحْمَةُ، وَلَكَ الْمَهابَةُ، وَلَكَ السُّلْطانُ، وَلَكَ الْبَهاءُ، وَلَكَ الاِْمْتِنانُ، وَلَكَ التَّسْبيحُ، وَلَكَ التَّقْديسُ، وَلَكَ التَّهْليلُ، وَلَكَ التَّكْبيرُ، وَلَكَ ما يُرى، وَلَكَ ما لا يُرى، وَلَكَ ما فَوْقَ السَّمواتِ الْعُلى، وَ لَكَ ما تَحْتَ الثَّرى، وَلَكَ الاَْرَضُونَ السُّفْلى، وَلَكَ الاْخِرَةُ وَالاُْولى، وَلَكَ ما تَرْضى بِهِ مِنَ الثَّناءِ وَالْحَمْدِ وَالشُّكرِ وَ النَّعْماءِ، اَللّـهُمَّ صَلِّ عَلى جَبْرَئيلَ اَمينِكَ عَلى وَحْيِكَ، وَالْقَوِيِّ عَلى اَمْرِكَ، وَالْمُطاعِ في سَمواتِكَ، وَمَحالِّ كَراماتِكَ الْمُتَحَمِّلِ لِكَلِماتِكَ النّاصِرِ لاَِنْبِيائِكَ الْمُدَمِّرِ لاَِعْدائِكَ، اَللّـهُمَّ صَلِّ عَلى ميكائيلَ مَلَكِ رَحْمَتِكَ، وَالَْمخْلُوقِ لِرَأْفَتِكَ، وَالْمُسْتَغْفِرِ الْمُعينِ لاَِهْلِ طاعَتِكَ، اَللّـهُمَّ صَلِّ عَلى اِسْرافيلَ حامِلِ عَرْشِكَ، وَصاحِبِ الصُّورِ الْمُنْتَظِرِ لاَِمْرِكَ، الْوَجِلِ الْمُشْفِقِ مِنْ خيفَتِكَ، اَللّـهُمَّ صَلِّ عَلى حَمَلَةِ الْعَرْشِ الطّاهِرينَ، وَعَلى السَّفَرَةِ الْكِرامِ الْبَرَرَةِ الطَّيِّبينَ، وَعَلى مَلائِكَتِكَ الْكِرامِ الْكاتِبينَ، وَ عَلى مَلائِكَةِ الْجِنانِ، وَخَزَنَةِ النّيرانِ، وَمَلَكِ الْمَوْتِ وَالاَْعْوانِ، يا ذَا الْجَلالِ وَالاِْكْرامِ، اَللّـهُمَّ صَلِّ عَلى اَبينا آدَمَ بَديعِ فِطْرَتِكَ الَّذي كَرَّمْتَهُ بِسُجُودِ مَلائِكَتِكَ،وَاَبَحْتَهُ جَنَّتَكَ، اَللّـهُمَّ صَلِّ عَلى اُمِّنا حَوّاءَ الْمُطَهَّرَةِ مِنَ الرِّجْسِ، الْمُصَفّاةِ مِنَ الدَّنَسِ، الْمُفَضَّلَةِ مِنَ الاِْنْسِ، الْمُتَرَدِّدَةِ بَيْنَ مَحالِّ الْقُدْسِ، اَللّـهُمَّ صَلِّ عَلى هابيلَ وَشَيْث وَاِدْريسَ وَنُوح وَهُود وَصالِح وَ اِبْراهيمَ وَاِسْماعيلَ وَاِسْحاقَ وَيَعْقُوبَ وَيُوسُفَ وَالاَْسْباطِ وَلُوط وَشُعَيْب وَاَيُّوبَ وَمُوسى وَهارُونَ وَيُوشَعَ وَميشا وَالْخِضْرِ وَذِى الْقَرْنَيْنِ وَيُونُسَ وَاِلْياسَ وَالْيَسَعَ وَذِي الْكِفْلِ وَطالُوتَ وَداوُدَ وَسُلَيْمانَ وَزَكَرِيّا وَشَعْيا وَيَحْيى وَتُورَخَ وَمَتّى وَاِرْمِيا وَحَيْقُوقَ وَدانِيالَ وَعُزَيْر وَعيسى وَشَمْعُونَ وَجِرْجيسَ وَالْحَوارِيّينَ وَالاَْتْباعِ وَخالِد وَحَنْظَلَةَ وَلُقْمانَ، اَللّـهُمَّ صَلِّ عَلى مُحَمَّد وَآلِ مُحَمَّد، وَارْحَمْ مُحَمَّداً وَآلَ مُحَمَّد، وَبارِكْ عَلى مُحَمَّد وَآلِ مُحَمَّد، كَما صَلَّيْتَ وَرَحِمْتَ وَبارَكْتَ عَلى اِبْرهيمَ وَآلِ اِبْرهيمَ اِنَّكَ حَميدٌ مَجيدٌ، اَللّـهُمَّ صَلِّ عَلَى الاَْوْصِياءِ وَالسُّعَداءِ وَالشُّهَداءِ وَاَئِمَّةِ الْهُدى، اَللّـهُمَّ صَلِّ عَلَى الاَْبْدالِ وَالاَْوْتادِ وَالسُّيّاحِ وَالْعُبّادِ وَالُْمخْلِصينَ وَالزُّهّادِ وَاَهْلِ الجِدِّ وَالاِْجْتِهادِ، وَاخْصُصْ مُحَمَّداً وَاَهْلَ بَيْتِهِ بِاَفْضَلِ صَلَواتِكَ وَاَجْزَلِ كَراماتِكَ، وَبَلِّغْ رُوحَهُ وَ جَسَدَهُ مِنّي تَحِيَّةً وَسَلاماً، وَزِدْهُ فَضْلاً وَشَرَفاً وَكَرَماً، حَتّى تُبَلِّغَهُ اَعْلى دَرَجاتِ اَهْلِ الشَّرَفِ مِنَ النَّبِيّينَ وَالْمُرْسَلينَ وَالاَْفاضِلِ الْمُقَرَّبينَ، اَللّـهُمَّ وَصَلِّ عَلى مَنْ سَمَّيْتُ وَمَنْ لَمْ اُسَمِّ مِنْ مَلائِكَتِكَ وَاَنْبِيائِكَ وَرُسُلِكَ وَاَهْلِ طاعَتِكَ، وَاَوْصِلْ صَلَواتي اِلَيْهِمْ وَاِلى اَرْواحِهِمْ، وَاجْعَلْهُمْ اِخْواني فيكَ وَاَعْواني عَلى دُعائِكَ، اَللّـهُمَّ اِنّي اَسْتَشْفِعُ بِكَ اِلَيْكَ، وَبِكَرَمِكَ اِلى كَرَمِكَ، وَبِجُودِكَ اِلى جُودِكَ، وَبِرَحْمَتِكَ اِلى رَحْمَتِكَ، وَبِاَهْلِ طاعَتِكَ اِلَيْكَ، وَاَساَلُكَ الّلهُمَّ بِكُلِّ ما سَأَلَكَ بِهِ اَحَدٌ مِنْهُمْ مِنْ مَسْأَلَة شَريفَة غَيْرِ مَرْدُودَة، وَبِما دَعَوْكَ بِهِ مِنْ دَعْوَة مُجابَة غَيْرِ مُخَيَّبَة، يااَللهُ يارَحْمنُ يا رَحيمُ يا كَريمُ يا عَظيمُ يا جَليلُ يا مُنيلُ يا جَميلُ يا كَفيلُ يا وَكيلُ يا مُقيلُ يا مُجيرُ يا خَبيرُ يا مُنيرُ يا مُبيرُ يا مَنيعُ يا مُديلُ يا مُحيلُ يا كَبيرُ يا قَديرُ يا بَصيرُ يا شَكُورُ يا بَرُّ يا طُهْرُ يا طاهِرُ يا قاهِرُ يا ظاهِرُ يا باطِنُ يا ساتِرُ يا مُحيطُ يا مُقْتَدِرُ يا حَفيظُ يا مُتَجَبِّرُ يا قَريبُ يا وَدُودُ يا حَميدُ يا مَجيدُ يا مُبْدِئُ يا مُعيدُ يا شَهيدُ يا مُحْسِنُ يا مُجْمِلُ يا مُنْعِمُ يا مُفْضِلُ يا قابِضُ يا باسِطُ يا هادي يا مُرْسِلُ يا مُرْشِدُ يا مُسَدِّدُ يا مُعْطي يا مانِعُ يا دافِعُ يا رافِعُ يا باقي يا واقي يا خَلاّقُ يا وَهّابُ يا تَوّابُ يا فَتّاحُ يا نَفّاحُ يا مُرْتاحُ يا مَنْ بِيَدِهِ كُلُّ مِفْتاح، يا نَفّاعُ يا رَؤوفُ يا عَطُوفُ يا كافي يا شافي يا مُعافي يا مُكافي يا وَفِيُّ يا مُهَيْمِنُ يا عَزيزُ يا جَبّارُ يا مُتَكَبِّرُ يا سَلامُ يا مُؤْمِنُ يا اَحَدُ يا صَمَدُ يا نُورُ يا مُدَبِّرُ يا فَرْدُ يا وِتْرُ يا قُدُّوسُ يا ناصِرُ يا مُؤنِسُ يا باعِثُ يا وارِثُ يا عالِمُ يا حاكِمُ يا بادي يا مُتَعالي يا مُصَوِّرُ يا مُسَلِّمُ يا مُتَحَّبِّبُ يا قائِمُ يا دائِمُ يا عَليمُ يا حَكيمُ يا جَوادُ يا بارِىءُ يا بارُّ يا سارُّ يا عَدْلُ يا فاصِلُ يا دَيّانُ يا حَنّانُ يا مَنّانُ يا سَميعُ يا بَديعُ يا خَفيرُ يا مُعينُ يا ناشِرُ يا غافِرُ يا قَديمُ يا مُسَهِّلُ يا مُيَسِّرُ يا مُميتُ يا مُحْيي يا نافِعُ يا رازِقُ يا مُقْتَدِرُ يا مُسَبِّبُ يا مُغيثُ يا مُغْني يا مُقْني يا خالِقُ يا راصِدُ يا واحِدُ يا حاضِرُ يا جابِرُ يا حافِظُ يا شَديدُ يا غِياثُ يا عائِدُ يا قابِضُ، يا مَنْ عَلا فَاسْتَعْلى فَكانَ بِالْمَنْظَرِ الاَْعْلى، يا مَنْ قَرُبَ فَدَنا وَبَعُدَ فَنَأى، وَعَلِمَ السِّرَّ وَاَخْفى، يا مَنْ اِلَيْهِ التَّدْبيرُ وَلَهُ الْمَقاديرُ، وَيا مَنِ الْعَسيرُ عَلَيْهِ سَهْلٌ يَسيرٌ، يا مَنْ هُوَ عَلى ما يَشاءُ قَديرٌ، يا مُرْسِلَ الرِّياحِ، يا فالِقَ الاِْصْباحِ، يا باعِثَ الاَْرْواحِ، يا ذَا الْجُودِ وَالسَّماحِ، يا رادَّ ما قَدْ فاتَ، يا ناشِرَ الاَْمْواتِ، يا جامِعَ الشَّتاتِ، يا رازِقَ مَنْ يَشاءُ بِغَيْرِ حِساب، وَيا فاعِلَ ما يَشاءُ، كَيْفَ يَشاءُ وَيا ذَا الْجَلالِ وَالاِْكْرامِ، يا حَيُّ يا قَيُّومُ، يا حَيّاً حينَ لا حَيَّ، يا حَيُّ يا مُحْيِيَ الْمَوْتى يا حَيُّ لا اِلـهَ إِلاّ اَنْتَ بَديعُ السَّماواتِ وَالاَْرْضِ، يا اِلهي وَسَيِّدي صَلِّ عَلى مُحَمَّد وَآلِ مُحَمَّد، وَارْحَمْ مُحَمَّداً وَآلَ مُحَمَّد، وَبارِكْ عَلى مُحَمَّد وَآلِ مُحَمَّد، كَما صَلَّيْتَ وَبارَكْتَ وَرَحِمْتَ عَلى اِبْرهيمَ وَآلِ اِبْرهيمَ اِنَّكَ حَميدٌ مَجيدٌ، وَارْحَمْ ذُلىّ وَ فاقَتي وَفَقْري وَانْفِرادي وَوَحْدَتي وَخُضُوعي بَيْنَ يَدَيْكَ وَاعْتِـمادي عَلَيْكَ، وَتَضَرُّعي اِلَيْكَ، اَدْعُوكَ دُعاءَ الْخاضِعِ الذَّليلِ الْخاشِعِ، الْخائِفِ الْمُشْفِقِ الْبائِسِ، الْمَهينِ الْحَقيرِ، الْجائِعِ الْفَقيرِ، الْعائِذِ الْمُسْتَجيرِ، الْمُقِرِّ بِذَنْبِهِ الْمُسْتَغْفِرِ مِنْهُ، الْمُسْتَكينِ لِرَبِّهِ، دُعاءَ مَنْ اَسْلَمْتَهُ ثَقِتُهُ، وَرَفَضَتْهُ اَحِبَتُّهُ، وَعَظُمَتْ فَجيعَتُهُ، دُعاءَ حَرِق حَزين، ضَعيف مَهين، بائِس مُسْتَكين بِكَ مُسْتَجير، اَللّـهُمَّ وَاَساَلُكَ بِاَنَّكَ مَليكٌ، وَاَنَّكَ ما تَشاءُ مِنْ اَمْر يَكُونُ، وَاَنَّكَ عَلى ما تَشاءُ قَديرٌ، وَاَساَلُكَ بِحُرْمَةِ هذَا الشَّهْرِ الْحَرامِ، وَالْبَيْتِ الْحَرامِ، وَالْبَلَدِ الْحَرامِ، وَالرُّكْنِ وَالْمَقامِ، وَالْمَشاعِرِ الْعِظامِ، وَبِحَقِّ نَبِيِّكَ مُحَمَّد عَلَيْهِ وَآلِهِ السَّلامُ، يا مَنْ وَهَبَ لاِدَمَ شِيْثاً، وَلاِِبْراهيمَ اِسْماعيلَ وَاِسْحاقَ، وَيا مَنْ رَدَّ يُوسُفَ عَلى يَعْقُوبَ، وَيا مَنْ كَشَفَ بَعْدَ الْبَلاءِ ضُرَّ اَيُّوبَ، يا رادَّ مُوسى عَلى اُمِّهِ، وَ زائِدَ الْخِضْرِ في عِلْمِهِ، وَيا مَنْ وَهَبَ لِداوُدَ سُلَيْمانَ،وَلِزَكَرِيّا يَحْيى، وَلِمَرْيَمَ عيسى، يا حافِظَ بِنْتِ شُعَيْب، وَيا كافِلَ وَلَدِ اُمِّ مُوسى، اَساَلُكَ اَنْ تُصَلِّيَ عَلى مُحَمَّد وَآلِ مُحَمَّد، وَاَنْ تَغْفِرَ لِي ذُنُوبي كُلَّها، وَتُجيرَني مِنْ عَذابِكَ، وَتُوجِبَ لي رِضْوانَكَ وَاَمانَكَ وَاِحْسانَكَ وَغُفْرانَكَ وَجِنانَكَ، وَاَساَلُكَ اَنْ تَفُكَّ عَنّي كُلَّ حَلْقَة بَيْني وَبَيْنَ مَنْ يُؤْذيني، وَتَفْتَحَ لي كُلَّ باب، وَتُلَيِّنَ لي كُلَّ صَعْب، وَتُسَهِّلَ لي كُلَّ عَسَير، وَتُخْرِسَ عَنّي كُلَّ ناطِق بِشَرٍّ، وَتَكُفَّ عَنّي كُلَّ باغ، وَتَكْبِتَ عَنّي كُلَّ عَدُوٍّ لي وَحاسِد، وَتَمْنَعَ مِنّي كُلَّ ظالِم، وَتَكْفِيَني كُلَّ عائِق يَحُولُ بَيْني وَبَيْنَ حاجَتي، وَيُحاوِلُ اَنْ يُفَرِّقَ بَيْني وَبَيْنَ طاعَتِكَ، وَيُثَبِّطَني عَنْ عِبادَتِكَ، يا مَنْ اَلْجَمَ الْجِنَّ الْمُتَمَرِّدينَ، وَقَهَرَ عُتاةَ الشَّياطينِ، وَاَذَلَّ رِقابَ الْمُتَجَبِّرينَ، وَرَدَّ كَيْدَ الْمُتَسَلِّطين عَنِ الْمُسْتَضْعَفينَ، اَساَلُكَ بِقُدْرَتِكَ عَلى ما تَشاءُ، وَتَسْهيلِكَ لِما تَشاءُ كَيْفَ تَشاءُ اَنْ تَجْعَلَ قَضاءَ حاجَتي فيما تَشاءُ.',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
              Container(
                child: ListOfNineVerses(
                  title: 'ثمّ اسجد على الارض وعفّر خدّيك وقل :',
                  subtitle:
                      'َللّـهُمَّ لَكَ سَجَدْتُ، وَبِكَ امَنْتُ، فَارْحَمْ ذُلّي وَفاقَتي، وَاجْتِهادي وَتَضَرُّعي، وَمَسْكَنَتي وَفَقْرى اِلَيْكَ يا رَبِّ.',
                  weight: FontWeight.w600,
                  size: isTablet ? _fontSizeTablet : _fontSize,
                ),
              ),
              Container(
                padding: EdgeInsets.all(20),
                child: Text(
                  'واجتهد أن تسح عيناك ولو بقدر رأس الذّبابة دُموعاً فانّ ذلك علامة الاجابة.',
                  style: TextStyle(
                    fontWeight: FontWeight.w900,
                    fontSize: isTablet ? _fontSizeTablet + 4 : _fontSize - 1,
                    color: const Color.fromARGB(255, 54, 80, 158),
                  ),
                ),
              ),
            ],
          ),
        ),
        bottomNavigationBar: AddCustomBottomNavigationBar(
        pushNext: AlyawmAl5amesWal3ishroun.screenRoute,
        pushBack: LailatAlnisfMenRajab.screenRoute,
        soud: '',
        onTap: (double fontSize) {
          // تحديث حجم الخط
          setState(() {
            isTablet ? _fontSizeTablet = fontSize : _fontSize = fontSize;
          });
          print('fontSize: $fontSize');
          // إغلاق Dialog
          Navigator.of(context).pop();
        },
        onLongPress: () {
          final snackBar = SnackBar(
            content: Center(
              child: Text(
                '${isTablet ? _fontSizeTablet.toInt() : _fontSize.toInt()}',
                style: TextStyle(
                  color: Colors.white,
                  fontSize: 16,
                ),
              ),
            ),
            width: 60,
            behavior: SnackBarBehavior.floating,
            backgroundColor: Colors.blue,
            duration: Duration(seconds: 2),
            shape: ShapeBorder.lerp(
              RoundedRectangleBorder(
                borderRadius: BorderRadius.circular(50),
              ),
              RoundedRectangleBorder(
                borderRadius: BorderRadius.circular(50),
              ),
              1,
            ),
          );
          ScaffoldMessenger.of(context).showSnackBar(snackBar);
        },
      ),
      ),
    );
  }
}
